Repository: common-workflow-language/user_guide
Catalog: locales/*/LC_MESSAGES/user_guide.po
Languages: ja, ru, ta, zh_hans

source: Now the scatter acts on a single step, but that step consists of two steps so each step is performed in parallel.
ja: 今、scatter は1つのステップに作用しますが、そのステップは2つのステップで構成されているので、各ステップは並行して実行されます。
ru: Теперь рассеиватель действует на один шаг, но этот шаг состоит из двух шагов, поэтому каждый шаг выполняется параллельно.
ta: இப்போது சிதறல் ஒரு படியில் செயல்படுகிறது, ஆனால் அந்த படி இரண்டு படிகளைக் கொண்டுள்ளது, எனவே ஒவ்வொரு அடியும் இணையாக செய்யப்படுகிறது.

source: Conditional Workflows
ja: 条件分岐ワークフロー
ru: Условные рабочие процессы
ta: நிபந்தனை பணிப்பாய்வு

source: This workflow contains a conditional step and is executed based on the input. This allows workflows to skip additional steps based on input parameters given at the start of the program or by previous steps.
ja: このワークフローは、条件付きステップを含み、入力に基づき実行されます。これにより、ワークフローは、プログラムの開始時に与えられた入力パラメータや以前のステップによって、追加のステップをスキップすることができます。
ru: Этот рабочий процесс содержит условный шаг и выполняется на основе входных данных. Это позволяет рабочим процессам пропускать дополнительные шаги на основе входных параметров, заданных в начале программы или на предыдущих шагах.
ta: இந்த பணிப்பாய்வு ஒரு நிபந்தனை படி உள்ளது மற்றும் உள்ளீட்டின் அடிப்படையில் செயல்படுத்தப்படுகிறது. நிரலின் தொடக்கத்தில் அல்லது முந்தைய படிகளால் கொடுக்கப்பட்ட உள்ளீட்டு அளவுருக்களின் அடிப்படையில் கூடுதல் படிகளைத் தவிர்க்க இது பணிப்பாய்வுகளை அனுமதிக்கிறது.

source: `conditional-workflow.cwl`
ta: `நிபந்தனை-வொர்க்ஃப்ளோ.சிடபிள்யூஎல்`

source: The first thing you'll notice is that this workflow is only compatible for version 1.2 or greater of the CWL standards.
ja: まず、このワークフローはCWL仕様のバージョン1.2以降から対応しているがわかります。
ru: Первое, что вы заметите, это то, что этот рабочий процесс совместим только с версией 1.2 или более поздней версией стандартов CWL.
ta: நீங்கள் கவனிக்கும் முதல் சேதி என்னவென்றால், இந்த பணிப்பாய்வு பதிப்பு 1.2 அல்லது அதற்கு மேற்பட்ட சி.டபிள்யூ.எல் தரத்திற்கு மட்டுமே இணக்கமானது.

source: The first step of the workflow (step1) contains two input properties and will execute foo.cwl when the conditions are met. The new property `when` is where the condition validation takes place. In this case only when `in1` from the workflow contains a value `< 1` this step will be executed.
ru: Первый шаг рабочего процесса (step1) содержит два входных свойства и будет выполнять foo.cwl при выполнении условий. Новое свойство `when` - это место, где происходит проверка условия. В данном случае только когда `in1` из рабочего процесса содержит значение `<1`, этот шаг будет выполнен.
ta: பணிப்பாய்வுகளின் முதல் படி (Step1) இரண்டு உள்ளீட்டு பண்புகளைக் கொண்டுள்ளது மற்றும் நிபந்தனைகள் நிறைவு செய்யப்படும்போது FOO.CWL ஐ இயக்கும். புதிய சொத்து `எப்போது` நிபந்தனை சரிபார்ப்பு நடைபெறுகிறது. இந்த வழக்கில் பணிப்பாய்வுகளிலிருந்து `in1` ஒரு மதிப்பு` <1` இந்த படி செயல்படுத்தப்படும்.

source: Using the following command `cwltool cond-wf-003.1.cwl --val 0` the value will pass the first conditional step and will therefore be executed and is shown in the log by `INFO [step step1] start` whereas the second step is skipped as indicated by `INFO [step step2] will be skipped`.
ja: 次のコマンド`cwltool cond-wf-003.1.cwl --val 0` を実行します。この値(val)は最初の条件ステップを通過するため実行され、ログには`INFO [step step1] start` で示されています。一方、2番目のステップは`INFO [step step2] will be skipped` で示されているようにスキップされ ます。
ru: При использовании следующей команды `cwltool cond-wf-003.1.cwl --val 0` значение пройдет первый условный шаг и, следовательно, будет выполнено, что отображается в журнале командой `INFO [step step1] start`, тогда как второй шаг будет пропущен, о чем свидетельствует `INFO [step step2] will be skipped`.
ta: பின்வரும் கட்டளையைப் பயன்படுத்தி `cwltool cond-wf-003.1.cwl --val 0` மதிப்பு முதல் நிபந்தனை படியைக் கடந்து, எனவே செயல்படுத்தப்படும் மற்றும்` செய்தி [படி 1] தொடக்க` மூலம் பதிவில் காட்டப்படுகிறது, அதேசமயம் இரண்டாவது படி `தகவல் [STEP STEP2] மூலம் சுட்டிக்காட்டப்பட்டபடி தவிர்க்கப்படுகிறது.

source: When a value of 3 is given the first conditional step will not be executed but the second step will `cwltool cond-wf-003.1.cwl --val 3`.
ja: `cwltool cond-wf-003.1.cwl --val 3`のように値(val)として3が与えられた場合、最初の条件ステップは実行されませんが、2番目の条件ステップは実行されます.
ru: Если задано значение 3, первый условный шаг не будет выполнен, но второй шаг будет выполнен `cwltool cond-wf-003.1.cwl --val 3`.
ta: 3 இன் மதிப்பு வழங்கப்படும் போது முதல் நிபந்தனை படி செயல்படுத்தப்படாது, ஆனால் இரண்டாவது படி `cwltool cond-wf-003.1.cwl --val 3`.

source: If no conditions are met for example when using `--val 2` the workflow will raise a permanentFail.
ja: `--val 2` を使用した場合など、条件を満たさない場合は、ワークフローはpermanentFailを発生させ、失敗となります。
ru: Если ни одно из условий не выполнено, например, при использовании `--val 2`, рабочий процесс выдаст ошибку permanentFail.
ta: `--Val 2` ஐப் பயன்படுத்தும் போது எந்த நிபந்தனைகளும் நிறைவு செய்யப்படாவிட்டால், பணிப்பாய்வு ஒரு நிரந்தர படத்தை உயர்த்தும்.

source: YAML Guide
ja: YAMLガイド
ru: Руководство по YAML
ta: யாம் வழிகாட்டி

source: [YAML][yaml] is a file format designed to be readable by both computers and humans. This guide introduces the features of YAML that are relevant when writing CWL descriptions and input parameter files.
ja: [YAML][yaml]は、コンピュータと人間の両方が読むことができるように設計されたファイル形式です。本ガイドでは、CWL定義や入力パラメータファイルを書く際に関連するYAMLの機能を紹介します。
ru: [YAML][yaml] - это формат файлов, предназначенный для чтения как компьютером, так и человеком. В этом руководстве представлены особенности YAML, которые важны при написании описаний CWL и файлов входных параметров.
ta: [YAML][yaml] என்பது ஒரு கோப்பு வடிவமாகும், இது கணினிகள் மற்றும் மனிதர்களால் படிக்கக்கூடியதாக வடிவமைக்கப்பட்டுள்ளது. இந்த வழிகாட்டி CWL விளக்கங்கள் மற்றும் உள்ளீட்டு அளவுருக் கோப்புகளை எழுதும்போது பொருத்தமான YAML இன் அம்சங்களை அறிமுகப்படுத்துகிறது.

source: You can skip this section if you are already comfortable with YAML.
ja: すでにYAMLに慣れている方は、このセクションを読み飛ばしてもかまいません。
ru: Вы можете пропустить этот раздел, если вы уже знакомы с YAML.
ta: நீங்கள் ஏற்கனவே YAML உடன் வசதியாக இருந்தால் இந்த பகுதியைத் தவிர்க்கலாம்.

source: Contents
ja: 目次
ru: Содержание
ta: உள்ளடக்கங்கள்

source: [Key-Value Pairs](#key-value-pairs)
ja: [キーバリューペア](#key-value-pairs)
ru: [Пары ключ-значение](#key-value-pairs)
ta: [முக்கிய மதிப்பு சோடிகள்](#key-value-pairs)

source: [Comments](#comments)
ja: [コメント](#comments)
ru: [Комментарии](#comments)
ta: [கருத்துரைகள்](#comments)

source: [Maps](#maps)
ja: [マップ](#maps)
ta: [வரைபடங்கள்](#maps)

source: [Arrays](#arrays)
ja: [配列](#arrays)
ta: [வரிசைகள்](#arrays)

source: [JSON Style](#json-style)
ja: [JSON 形式](#json-style)
ta: [JSON ச்டைல்](#json-style)

source: Key-Value Pairs
ja: キーバリューペア
ta: முக்கிய மதிப்பு சோடிகள்

source: Fundamentally, a file written in YAML consists of a set of _key-value pairs_. Each pair is written as `key: value`, where whitespace after the `:` is required. Key names in CWL files should not contain whitespace - [_camelCase_][camelCase] is used for multi-word key names that have special meaning in the CWL specification and underscored key names otherwise. For example:
ja: 基本的に、YAML で書かれたファイルは_キーと値のペア_ のセットで構成されています。各ペアは`key: value` として記述され、`:` の後に空白が必要です。CWLファイルのキー名には、空白を含めるべきではありません。[_camelCase_][camelCase] は、CWL仕様で特別な意味を持つ複数語のキー名、それ以外はアンダースコアのキー名として使用します。例えば：
ta: அடிப்படையில், YAML இல் எழுதப்பட்ட ஒரு கோப்பு _கே-மதிப்பு சோடிகளின்_ தொகுப்பைக் கொண்டுள்ளது. ஒவ்வொரு சோடியும் `விசை: மதிப்பு` என எழுதப்பட்டுள்ளன, அங்கு`: `க்குப் பிறகு இடைவெளி தேவைப்படுகிறது. சி.டபிள்யூ.எல் கோப்புகளில் உள்ள முக்கிய பெயர்கள் வைட்ச்பேசைக் கொண்டிருக்கக்கூடாது - [[_camelCase_][camelCase] CWL விவரக்குறிப்பில் சிறப்பு அர்த்தமுள்ள பல சொல் முக்கிய பெயர்களுக்கு பயன்படுத்தப்படுகிறது மற்றும் இல்லையெனில் அடிக்கோடிட்டுக் காட்டப்பட்ட முக்கிய பெயர்கள். உதாரணமாக:

source: The YAML above defines four keys - `first_name`, `last_name`, `age_years`, and `home` - with their four respective values. Values can be character strings, numeric (integer, floating point, or scientific representation), Boolean (`true` or `false`), or more complex nested types (see below).
ja: 上記のYAMLは4つのキー -`first_name`,`last_name`,`age_years`, `home` - 及びそれぞれの値を定義しています。値は、文字列、数値（整数、浮動小数点、科学的表現）、ブール値（`true` または`false` ）、またはより複雑な入れ子型（下記参照）にすることができます。
ta: மேலே உள்ள YAML நான்கு விசைகளை வரையறுக்கிறது - `First_name`,` கடைசி_பெயர்`, `வயது_இயர்கள்`, மற்றும்` வீடு` - அவற்றின் நான்கு அந்தந்த மதிப்புகளுடன். மதிப்புகள் எழுத்து சரங்கள், எண் (முழு எண், மிதக்கும் புள்ளி, அல்லது அறிவியல் பிரதிநிதித்துவம்), பூலியன் (`உண்மை` அல்லது` தவறு`) அல்லது மிகவும் சிக்கலான உள்ளமைக்கப்பட்ட வகைகளாக இருக்கலாம் (கீழே காண்க).

source: Values may be wrapped in quotation marks, but be aware that this may change the way that they are interpreted i.e. `"1234"` will be treated as a character string , while `1234` will be treated as an integer. This distinction can be important, for example when describing parameters to a command: in CWL all parts of `baseCommand` must be strings so, if you want to specify a fixed numeric value to a command, make sure that you wrap that numeric value in quotes: `baseCommand: [echo, "42"]`.
ja: 値は引用符で括ることができますが、意味が変わってきます。例えば、`"1234"` は文字列として扱われ、`1234` は整数値として扱われます。CWLでは、`baseCommand` のすべての部分が文字列でなければならないので、コマンドに固定した数値を指定する場合は、その数値を引用符で囲むようにしてください：[echo, "42"]`.
ta: மதிப்புகள் மேற்கோள் மதிப்பெண்களில் மூடப்பட்டிருக்கலாம், ஆனால் இது அவை விளக்கப்படும் விதத்தை மாற்றக்கூடும் என்பதை அறிந்து கொள்ளுங்கள். அதாவது `" 1234 "` ஒரு எழுத்து சரமாக கருதப்படும், அதே நேரத்தில் `1234` ஒரு முழு எண்ணாக கருதப்படும். இந்த வேறுபாடு முக்கியமானது, எடுத்துக்காட்டாக ஒரு கட்டளைக்கு அளவுருக்களை விவரிக்கும் போது: சி.டபிள்யூ.எல் இல் `பேச் கமாண்டின் 'அனைத்து பகுதிகளும் சரங்களாக இருக்க வேண்டும், நீங்கள் ஒரு கட்டளைக்கு ஒரு நிலையான எண் மதிப்பைக் குறிப்பிட விரும்பினால், அந்த எண் மதிப்பை நீங்கள் போர்த்திக் கொள்ளுங்கள் என்பதை உறுதிப்படுத்திக் கொள்ளுங்கள் மேற்கோள்கள்: `பேச் கமாண்ட்: [எதிரொலி," 42 "]`.

source: Comments
ja: コメント
ta: கருத்துகள்

source: You may use `#` to add comments to your CWL and parameter files. Any characters to the right of ` #` will be ignored by the program interpreting the YAML. For example:
ja: `#` を使うと、CWL定義や入力パラメータファイルにコメントを追加することができます。` #` の右側にある文字は、YAML を解釈するプログラムによって無視されます。たとえば、次のようになります：
ta: உங்கள் CWL மற்றும் அளவுரு கோப்புகளில் கருத்துகளைச் சேர்க்க `#` பயன்படுத்தலாம். ` #` என்ற வலதுபுறத்தில் உள்ள எந்த எழுத்துக்களும் YAML ஐ விளக்கும் நிரலால் புறக்கணிக்கப்படும். உதாரணமாக:

source: If there is anything on the line before the comment, be sure to add at least one space before the `#`!
ja: 同じ行の中でコメントの前に何かある場合は、必ず`#` の前に少なくとも1つのスペースを追加してください！
ta: கருத்துக்கு முன் வரியில் ஏதேனும் இருந்தால், `#` க்கு முன் குறைந்தது ஒரு இடத்தையாவது சேர்க்க மறக்காதீர்கள்!

source: Maps
ja: マップ
ta: வரைபடங்கள்

source: When describing a tool or workflow with CWL, it is usually necessary to construct more complex, nested representations. Referred to as _maps_, these hierarchical structures are described in YAML by providing additional key-value pairs as the value of any key. These pairs (sometimes referred to as "children") are written on new lines under the key to which they belong (the "parent"), and should be indented with two spaces (⇥tab characters are not allowed). For example:
ta: சி.டபிள்யூ.எல் உடன் ஒரு கருவி அல்லது பணிப்பாய்வுகளை விவரிக்கும் போது, பொதுவாக மிகவும் சிக்கலான, உள்ளமைக்கப்பட்ட பிரதிநிதித்துவங்களை உருவாக்குவது தேவை. _MAPS_ என குறிப்பிடப்படுகிறது, இந்த படிநிலை கட்டமைப்புகள் எந்தவொரு விசையின் மதிப்பாக கூடுதல் விசை-மதிப்பு சோடிகளை வழங்குவதன் மூலம் YAML இல் விவரிக்கப்பட்டுள்ளன. இந்த சோடிகள் (சில நேரங்களில் "குழந்தைகள்" என்று குறிப்பிடப்படுகின்றன) அவர்கள் சேர்ந்த விசையின் கீழ் ("பெற்றோர்") புதிய வரிகளில் எழுதப்பட்டுள்ளன, மேலும் அவை இரண்டு இடங்களுடன் உள்தள்ளப்பட வேண்டும் (⇥TAB எழுத்துக்கள் அனுமதிக்கப்படவில்லை). உதாரணமாக:

source: The YAML above illustrates how to build up complex nested object descriptions relatively quickly. The `inputs` map contains a single key, `example_flag`, which itself contains two keys, `type` and `inputBinding`, while one of these children, `inputBinding`, contains a further two key-value pairs (`position` and `prefix`). See the [Arrays](#arrays) section below for more information about providing multiple values/key-value pairs for a single key. For comparison with the example YAML above, here is a graphical representation of the `inputs` object it describes.
ta: மேலே உள்ள YAML சிக்கலான உள்ளமைக்கப்பட்ட பொருள் விளக்கங்களை ஒப்பீட்டளவில் விரைவாக உருவாக்குவது எப்படி என்பதை விளக்குகிறது. `inputs` வரைபடத்தில்`example_flag` ஒரு ஒற்றை விசையைக் கொண்டுள்ளது, இதில் இரண்டு விசைகள் உள்ளன, `type`(வகை) மற்றும்`inputBinding`(உள்ளீட்டு பைண்டிங்), இந்தக் குழந்தைகளில் ஒருவரான `உள்ளீடு பைண்டிங்` மேலும் இரண்டு முக்கிய மதிப்பு சோடிகளைக் கொண்டுள்ளது (` நிலை` மற்றும் `முன்னொட்டு`). ஒற்றை விசைக்குப் பல மதிப்புகள்/முக்கிய மதிப்பு சோடிகளை வழங்குவது பற்றிய கூடுதல் தகவலுக்குக் கீழே உள்ள [வரிசைகள்](#arrays) பகுதியைக் காண்க. மேலே உள்ள யாம்லுடன் ஒப்பிடுகையில், அது விவரிக்கும் `உள்ளீடுகள்` பொருளின் வரைகலை பிரதிநிதித்துவம் இங்கே.

source: Arrays
ta: வரிசைகள்

source: In certain circumstances, it is necessary to provide multiple values or objects for a single key. As we've already seen in the [Maps](#maps) section above, more than one key-value pair can be mapped to a single key. However, it is also possible to define multiple values for a key without having to provide a unique key for each value. We can achieve this with an _array_, where each value is defined on its own line and preceded by `-`. For example:
ta: சில சூழ்நிலைகளில், ஒரு விசைக்கு பல மதிப்புகள் அல்லது பொருள்களை வழங்குவது தேவை. மேலே உள்ள [வரைபடங்கள்](#maps) பிரிவில் நாம் ஏற்கனவே பார்த்தது போல, ஒன்றுக்கு மேற்பட்ட முக்கிய மதிப்பு சோடியை ஒரு விசையில் வரைபடமாக்கலாம். இருப்பினும், ஒவ்வொரு மதிப்புக்கும் ஒரு தனித்துவமான விசையை வழங்காமல் ஒரு விசையின் பல மதிப்புகளை வரையறுக்கவும் முடியும். _Array_ உடன் இதை நாம் அடையலாம், அங்கு ஒவ்வொரு மதிப்பும் அதன் சொந்த வரியில் வரையறுக்கப்பட்டு `-` ஆல் வரையறுக்கப்படுகிறது. உதாரணமாக:

source: and a more complex example combining maps and arrays:
ta: வரைபடங்கள் மற்றும் வரிசைகளை இணைக்கும் மிகவும் சிக்கலான எடுத்துக்காட்டு:

source: JSON Style
ja: JSON形式
ta: சாதொபொகு நடை

source: YAML is based on [JavaScript Object Notation (JSON)][json]. Maps and arrays can also be defined in YAML using the native JSON syntax. For example:
ja: YAMLは[JavaScript Object Notation (JSON)][json]に基づいています。マップと配列は、JSON構文を使ってYAMLで定義することもできます。例えば:
ta: YAML [சாவாச்கிரிப்ட் பொருள் குறியீடு (JSON)] [json] ஐ அடிப்படையாகக் கொண்டது. சொந்த சாதொபொகு தொடரியல் பயன்படுத்தி YAML இல் வரைபடங்கள் மற்றும் வரிசைகளை வரையறுக்கலாம். உதாரணமாக:

source: and:
ta: மற்றும்:

source: Native JSON can be useful in indicating where a field is intentionally left empty (such as `[]` for an empty array), as well as where it makes more sense for the values to be located on the same line (For example, when providing option flags and their values in a shell command). However, as the second example above shows, it can severely affect the readability of a YAML file, and should be used sparingly.
ta: ஒரு புலம் வேண்டுமென்றே காலியாக இருக்கும் (`[]` போன்றவை வெற்று வரிசைக்கு) எங்கே என்பதைக் குறிக்க பூர்வீக சாதொபொகு பயனுள்ளதாக இருக்கும், அதேபோல் மதிப்புகள் ஒரே வரியில் அமைந்திருப்பதற்கு அதிக அர்த்தமுள்ள இடம் (எடுத்துக்காட்டாக, எப்போது செல் கட்டளையில் விருப்பக் கொடிகள் மற்றும் அவற்றின் மதிப்புகளை வழங்குதல்). இருப்பினும், மேலே உள்ள இரண்டாவது எடுத்துக்காட்டு காண்பித்தபடி, இது ஒரு YAML கோப்பின் வாசிப்புத்திறனை கடுமையாக பாதிக்கும், மேலும் அவை குறைவாகவே பயன்படுத்தப்பட வேண்டும்.

source: Reference
ja: リファレンス
ta: குறிப்பு

source: The [Learn YAML in Y Minutes][yaml-y-mins] reference was very helpful for us while we wrote this guide, though it also covers features that are not valid in CWL.
ta: இந்த வழிகாட்டியை நாங்கள் எழுதியபோது [Y MINES][yaml-y-mins] குறிப்பு எங்களுக்கு மிகவும் உதவியாக இருந்தது, இருப்பினும் இது CWL இல் செல்லுபடியாகாத அம்சங்களையும் உள்ளடக்கியது.

source: Tutorials
ja: チュートリアル
ta: பயிற்சிகள்

source: This is a list of tutorials provided by the CWL community. Use the `Edit this page` link in the menu if you would like to add another tutorial to the list.
ja: これは、CWL コミュニティによって提供されたチュートリアルのリストです。リストに他のチュートリアルを追加したい場合は、メニューの`Edit this page` リンクを使用してください。
ta: இது சி.டபிள்யூ.எல் சமூகத்தால் வழங்கப்பட்ட பயிற்சிகளின் பட்டியல். பட்டியலில் மற்றொரு டுடோரியலைச் சேர்க்க விரும்பினால் பட்டியலில் உள்ள `திருத்து` இணைப்பைப் பயன்படுத்தவும்.

source: Beginner Tutorials
ja: 初心者向けチュートリアル
ta: தொடக்க பயிற்சிகள்

source: [Introduction to Workflows with Common Workflow Language: For Contributors.](https://carpentries-incubator.github.io/cwl-novice-tutorial/)
ja: [Common Workflow Languageによるワークフロー入門：コントリビューターのために](https://carpentries-incubator.github.io/cwl-novice-tutorial/)
ta: [Introduction பெறுநர் Workflows with Common Workflow மொழி: க்கு Contributors.](https://carpentries-incubator.github.io/cwl-novice-tutorial/)

source: Advanced Tutorials
ja: 上級者向けチュートリアル
ta: மேம்பட்ட பயிற்சிகள்

source: [Typescript in CWL](https://github.com/umccr/cwl-ica/wiki/TypeScript)
ja: [CWLでのTypeScript](https://github.com/umccr/cwl-ica/wiki/TypeScript)
ta: [CWL இல் தட்டச்சுஉரை](https://github.com/umccr/cwl-ica/wiki/TypeScript)

source: Bioinformatics Tutorials
ja: バイオインフォマティクス・チュートリアル
ta: பயோ இன்ஃபர்மேடிக்ச் பயிற்சிகள்

source: [rnaseq with CWL](https://arvados.github.io/rnaseq-cwl-training/)
ja: [CWLでrnaseq](https://arvados.github.io/rnaseq-cwl-training/)
ta: [CWL உடன் ஆர்என்ஏவரிசை](https://arvados.github.io/rnaseq-cwl-training/)

source: How do I create non "`File`" types using `evalFrom`?
ja: "`File`" 型をつかわず `evalFrom`を使う方法

source: How do I rename an input file?
ja: 入力ファイルの名前を変更するにはどうしたらよいですか？

source: How do I rename an output file?
ja: 出力ファイルの名前を変更するにはどうしたらよいですか？

source: By modifying the `basename` field in the `outputEval` field, CWL workflow engines will rename the file using the new name for subsequent steps or as a workflow-level output.
ja: `outputEval`フィールドの`basename`フィールドを変更することで、CWLワークフローエンジンは、後続のステップまたはワークフローレベルの出力として、新しい名前を使用してファイル名を変更します。

source: How do I reference a local script?
ja: ローカルスクリプトを参照するにはどうしたらよいですか？

source: The first method involves adding the path to a folder containing your scripts to the `PATH` environment variable. This allows you to execute the shell script directly (without explicitly using the `sh` or `bash` commands).
ja: 最初の方法は、スクリプトの入ったフォルダを 環境変数`PATH`に追加する方法です。これにより、`sh` や`bash` コマンドを使用せずに、シェルスクリプトを直接実行することができます。

source: How can I model a "one-or-the-other" parameter?
ja: 「一か八か」のパラメータをモデル化するにはどうしたらよいですか?

source: How do make an input optional? 💯
ja: 入力パラメータをオプショナルにするにはどうしたらよいですか? 💯

source: How do I specify an input that must come from a list of predefined values (i.e. How do I use enum inputs) ?
ja: どうやってあらかじめ定義された値のリストから入力を指定できますか(つまり、入力でenumを使うにはどうしたらよいですか)?

source: How do I describe dependent or exclusive input parameters(e.g. How do I use record inputs)?
ja: 依存的または排他的な入力パラメータはどのように記述すればよいですか（例えば、レコード入力をどのように使用すればよいですか）？

source: How can I set Booleans?
ja: ブール値を設定するにはどうしたらよいでしょうか？

source: What should I do when concatenating strings in inputs?
ja: 入力された文字列を連結するにはどうしたら良いでしょうか？

source: I get `cwltool` errors due to filenames with space characters inside. What should I do?
ja: `cwltool` ファイル名の中に空白文字があるために起こるエラーにはどのように対処したらよいでしょうか？

source: What should I do when I get CWL Parameter Reference error due to hyphen in an input identifier?
ja: 入力パラメータ名の中のハイフンがあるため、CWLパラメータリファレンスエラーが起こりました。どのようしたらよいでしょうか？

source: To fix this error, change `-` (hyphen) to `_` (underscore):
ja: このエラーを修正するには、`-` (ハイフン) を`_` (アンダースコア) に変更してください:

source: How do I use CWL and cwltool with Singularity?
ja: SingularityをCWLとcwltoolで使うにはどうしたらよいでしょうか？

source: How do I debug the JavaScript in my CWL tool?
ja: CWLツールのJavaScriptをデバッグするには?

source: [`InlineJavascriptWorkflow`](https://w3id.org/cwl/Workflow.html#InlineJavascriptRequirement) - enables JavaScript in expressions.
ja: [`InlineJavascriptWorkflow`](https://w3id.org/cwl/Workflow.html#InlineJavascriptRequirement) - でJavaScriptを有効にします。

source: [`SubworkflowFeatureRequirement`](https://w3id.org/cwl/Workflow.html#SubworkflowFeatureRequirement) - enables nested workflows.
ja: [`SubworkflowFeatureRequirement`](https://w3id.org/cwl/Workflow.html#SubworkflowFeatureRequirement) - ネストしたワークフローを有効にします。

source: [`InitialWorkDirRequirement`](https://w3id.org/cwl/Workflow.html#InitialWorkDirRequirement) - controls staging files in the input directory.
ja: [`InitialWorkDirRequirement`](https://w3id.org/cwl/Workflow.html#InitialWorkDirRequirement) - 入力ディレクトリのステージングファイルを制御します。

source: The Command Line Tool Description Standard: <[https://www.commonwl.org/v1.2/CommandLineTool.html](https://w3id.org/cwl/CommandLineTool.html)>
ja: <[https://www.commonwl.org/v1.2/CommandLineTool.html](https://w3id.org/cwl/CommandLineTool.html)>から

source: If you are using Windows, you will have to install the Windows Subsystem for Linux 2 as documented in the [`cwltool` documentation for Microsoft Windows users](https://github.com/common-workflow-language/cwltool/blob/main/README.rst#ms-windows-users). Your operating system also needs internet access and a recent version of Python (3.6+).
ja: Windowsを使用している場合は、[Microsoft Windows ユーザのための`cwltool` 文書](https://github.com/common-workflow-language/cwltool/blob/main/README.rst#ms-windows-users)に記載されているように、Windows Subsystem for Linux 2をインストールする必要があります。インターネットアクセスとPythonの最新バージョン(3.6+)も必要です。

source: `cwltool` can be installed with `pip`, `apt`, or `conda`. We recommend using a virtual environment like `venv` or `conda`.
ja: `cwltool` は `pip`、`apt` または `conda` でインストールできます。`venv` や `conda` のような仮想環境を使用することを推奨します。

source: Visit the `cwltool` [documentation](https://cwltool.readthedocs.io/en/latest/#install) for details on installing `cwltool`.
ja: `cwltool` を`apt` と`conda` とともにインストールする他の方法については、`cwltool` [ドキュメント](https://github.com/common-workflow-language/cwltool#install) を参照してください。

source: Generic ``cwl-runner`` alias
ja: 一般的な ``cwl-runner`` エイリアス

source: The CWL community publishes a Python package with the name `cwlref-runner` that installs an alias for `cwltool` under the name `cwl-runner`.
ja: CWLコミュニティは、`cwlref-runner` という名前のPythonパッケージを公開しており、`cwltool` のエイリアスを`cwl-runner` という名前でインストールします

source: The *shebang* is the two-character sequence `#!` at the beginning of a script. When the script is executable, the operating system will execute the script using the executable specified after the shebang. It is considered a good practice to use `/usr/bin/env [executable]` rather than using a hard-coded location, since `/usr/bin/env [executable]` looks for the `[executable]` program in the system `PATH`,
ja: *shebang* (訳注：発音、シバン、シェバン)は、スクリプトの冒頭の2文字列`#!` のことです。スクリプトが実行可能な場合、オペレーティングシステムは、shebangの後に指定された実行可能ファイルを使用してスクリプトを実行します。`/usr/bin/env <executable>` は` <executable>` プログラムを設定されている環境変数`PATH` の中で探すので、ハードコードされた場所を使うよりも`/usr/bin/env <executable>` を使うことが良い習慣と考えられています

source: The usage of the `cwltool` command-line executable is basically `cwltool [OPTIONS] [CWL_DOCUMENT] [INPUTS_OBJECT]`. You can run the `hello_world.cwl` workflow without specifying any option:
ja: 基本的に `cwltool` の使い方は、`cwltool [OPTIONS] [CWL_DOCUMENT] [INPUTS_OBJECT]`です。`hello_world.cwl` Workflowは、オプションを指定せずに実行することができます：

source: For more examples of providing metadata within CWL descriptions, see [the Metadata and Authorship section of this User Guide](../topics/metadata-and-authorship.md).
ja: CW定義にメタデータを与える例については、 [このユーザーガイドのメタデータと著者名のセクション](../topics/metadata-and-authorship.md)を参照してください。

source: In tool descriptions, list dependencies using short name(s) under [`SoftwareRequirement`](https://w3id.org/cwl/CommandLineTool.html#SoftwareRequirement).
ja: ツール定義では、[`SoftwareRequirement`](https://w3id.org/cwl/CommandLineTool.html#SoftwareRequirement).の下に、短い名前を使用して依存関係をリストアップします。
