Repository: common-workflow-language/user_guide
Catalog: locales/*/LC_MESSAGES/user_guide.po
Languages: ja, ru, ta, zh_hans

source: Sometimes you may want to write your own custom types for use and reuse in CWL descriptions. Use of such custom types can reduce redundancy between multiple descriptions that all use the same type, and also allow for additional customisation/configuration of a tool/analysis without the need to fiddle with the CWL description directly.
ja: CWL定義で使用・再利用するために、独自のカスタム型を書きたい場合があります。このようなカスタムタイプを使用することで、同じタイプを使用する複数の記述の間の冗長性を減らし、また、CWL定義を直接いじらずに、ツールや分析のカスタマイズや設定を追加できるようになります。
ru: Иногда вы можете захотеть написать собственные пользовательские типы для использования в описаниях CWL. Использование таких пользовательских типов может уменьшить избыточность между несколькими описаниями, использующими один и тот же тип, а также позволяет дополнительно настраивать/конфигурировать инструмент/анализ, не прибегая к непосредственной работе с описанием CWL.
ta: சில நேரங்களில் நீங்கள் சி.டபிள்யூ.எல் விளக்கங்களில் பயன்பாட்டிற்காகவும் மறுபயன்பாட்டுக்காகவும் உங்கள் சொந்த தனிப்பயன் வகைகளை எழுத விரும்பலாம். இத்தகைய தனிப்பயன் வகைகளைப் பயன்படுத்துவது அனைத்தும் ஒரே வகையைப் பயன்படுத்தும் பல விளக்கங்களுக்கிடையில் பணிநீக்கத்தைக் குறைக்கும், மேலும் சி.டபிள்யூ.எல் விளக்கத்துடன் நேரடியாக ஃபிடில் செய்ய வேண்டிய அவசியமின்றி ஒரு கருவி/பகுப்பாய்வின் கூடுதல் தனிப்பயனாக்கம்/உள்ளமைவை அனுமதிக்கும்.
zh_hans: 有时您可能希望自己编写自定义的类型，以便用于 CWL 描述中并重复利用。在多个描述用到相同类型的情况下，使用这样的自定义类型可以删繁就简，还可以让我们对工具或分析进行额外的自定义和配置，而无需直接在 CWL 描述上做手脚。

source: The example below is a CWL description of the [biom convert format][biom] tool for converting a standard biom table file to hdf5 format.
ja: 以下の例は、標準的なbiomテーブルファイルをhdf5形式に変換する[biom convert format][biom] ツールのCWL定義です。
ru: Ниже приведен пример CWL-описания инструмента [biom convert format][biom] для преобразования стандартного файла таблицы biom в формат hdf5.
ta: ஒரு நிலையான பயோம் அட்டவணை கோப்பை HDF5 வடிவமாக மாற்றுவதற்கான [பயோம் மாற்றும் வடிவம்][biom] கருவியின் CWL விளக்கம் கீழே உள்ள எடுத்துக்காட்டு.
zh_hans: 下例用 CWL 描述了一个 [biom 转换格式][biom]工具，用于将标准 biom 表文件转换为 hdf5 格式。

source: ___Note:___ To follow the example below, you need to [download the example input file](https://github.com/common-workflow-language/user_guide/blob/main/src/_includes/cwl/custom-types/rich_sparse_otu_table.biom), *rich_sparse_otu_table.biom* e.g. via `wget`:
ja: ___注意:___ 以下の例に行うには、`wget`などで*rich_sparse_otu_table.biom*という[入力ファイルをダウンロード](https://github.com/common-workflow-language/user_guide/blob/main/src/_includes/cwl/custom-types/rich_sparse_otu_table.biom)する必要があります：
ru: ___Примечание:___Чтобы следовать приведенному ниже примеру, вам необходимо [скачать входной файл примера](https://github.com/common-workflow-language/user_guide/blob/main/src/_includes/cwl/custom-types/rich_sparse_otu_table.biom), *rich_sparse_otu_table.biom*, например, с помощью `wget`:
ta: ___ குறிப்பு. rod_sparse_otu_table.biom), * rol_sparse_otu_table.biom * எ.கா. `wget` வழியாக:
zh_hans: ___注意：___ 按照下例演练前，您需要先[下载示例输入文件](https://github.com/common-workflow-language/user_guide/blob/main/src/_includes/cwl/custom-types/rich_sparse_otu_table.biom) *rich_sparse_otu_table.biom*. 例如，使用 `wget`:

source: On line 29, in `inputs:table_type`, a list of allowable table options to be used in the table conversion are imported as a custom object:
ja: 29行目の`inputs:table_type` で、テーブル変換で使用できるテーブルオプションのリストがカスタムオブジェクトとしてインポートされます：
ru: В строке 29 в `inputs:table_type` в качестве пользовательского объекта импортируется список допустимых параметров таблицы, которые будут использоваться при преобразовании таблицы:
ta: 29 வது வரியில், `உள்ளீடுகள்: அட்டவணை_ வகை` இல், அட்டவணை மாற்றத்தில் பயன்படுத்த அனுமதிக்கக்கூடிய அட்டவணை விருப்பங்களின் பட்டியல் தனிப்பயன் பொருளாக இறக்குமதி செய்யப்படுகிறது:
zh_hans: 在文件第 29 行，`inputs:table_type` 项目中，允许用于数据表转换的选项列表以自定义对象的形式导入：

source: The reference to a custom type is a combination of the name of the file in which the object is defined (`biom-convert-table.yaml`) and the name of the object within that file (`table_type`) that defines the custom type. In this case the `symbols` array from the imported `biom-convert-table.yaml` file define the allowable table options. For example, in `custom-types.yml`, we pass `OTU table` as an `input` that tells the tool to create an OTU table in hdf5 format.
ru: Ссылка на пользовательский тип представляет собой комбинацию имени файла, в котором определен объект (`biom-convert-table.yaml`), и имени объекта в этом файле (`table_type`), определяющего пользовательский тип. В этом случае массив `символов` из импортированного файла `biom-convert-table.yaml` определяет допустимые опции таблицы. Например, в `custom-types.yml` мы передаем `OTU table` в качестве `входа`, который указывает инструменту создать таблицу OTU в формате hdf5.
ta: தனிப்பயன் வகைக்கான குறிப்பு என்பது பொருள் வரையறுக்கப்பட்ட (`பயோம்-கோன்வர்ட்-டேபிள்.யம்ல்`) மற்றும் அந்த கோப்பில் உள்ள பொருளின் பெயர் (` டேபிள்_ டைப்`) தனிப்பயனை வரையறுக்கும் கோப்பின் பெயரின் கலவையாகும் தட்டச்சு செய்க. இந்த வழக்கில் இறக்குமதி செய்யப்பட்ட `பயோம்-கான்வர்ட்-டேபிள்.யம்ல்` கோப்பிலிருந்து` சின்னங்கள்` வரிசை அனுமதிக்கக்கூடிய அட்டவணை விருப்பங்களை வரையறுக்கவும். எடுத்துக்காட்டாக, `Custom-types.yml` இல், HDF5 வடிவத்தில் OTU அட்டவணையை உருவாக்க கருவியைச் சொல்லும்` உள்ளீட்டாக '`OTU அட்டவணையை` கடந்து செல்கிறோம்.
zh_hans: 对自定义类型的引用由两部分构成：对象定义所在的文件名（`biom-convert-table.yaml` ），和该文件中定义该类型的对象名（`table_type` ）。这里，导入的 `biom-convert-table.yaml` 文件中的 `symbols` 数组定义了允许的表选项。例如，在 `custom-types.yml` 中，我们把 `OTU table` 作为一个 `input`（输入）传入，令工具创建一个 hdf5 格式的 OTU 表。

source: The contents of the YAML file describing the custom type are given below:
ja: カスタムタイプを記述するYAMLファイルの内容を以下に示します：
ru: Ниже приведено содержимое YAML-файла, описывающего пользовательский тип:
ta: தனிப்பயன் வகையை விவரிக்கும் YAML கோப்பின் உள்ளடக்கங்கள் கீழே கொடுக்கப்பட்டுள்ளன:
zh_hans: 描述自定义类型的 YAML 文件内容如下：

source: `biom-convert-table.yaml`
ta: `பயோம்-கான்ப்-டேபிள்.யம்ல்`

source: In order for the custom type to be used in the CWL description, it must be imported. Imports are described in `requirements:SchemaDefRequirement`, as below in the example `custom-types.cwl` description:
ja: カスタム型をCWL定義で使用するためには、インポートする必要があります。インポートについては、`requirements:SchemaDefRequirement` で定義されており、例として`custom-types.cwl` の定義にあるように、インポートされます：
ru: Чтобы пользовательский тип мог использоваться в описании CWL, он должен быть импортирован. Импорт описывается в `requirements:SchemaDefRequirement`, как показано ниже в примере описания `custom-types.cwl`:
ta: CWL விளக்கத்தில் தனிப்பயன் வகை பயன்படுத்தப்படுவதற்கு, அது இறக்குமதி செய்யப்பட வேண்டும். இறக்குமதிகள் `தேவைகள்: ச்கெமேட்ஃப்ரெக்விரெமென்ட்` இல் விவரிக்கப்பட்டுள்ளன, எடுத்துக்காட்டாக` தனிப்பயன்-வகை. சி.டபிள்யூ.எல்` விளக்கம்:
zh_hans: 为了在 CWL 描述中使用自定义类型，必须首先导入。 关于导入的描述位于 `requirements:SchemaDefRequirement` 项，如下例 `custom-types.cwl` 所示：

source: Note also that the author of this CWL description has also included `ResourceRequirement`s, specifying the minimum amount of RAM and number of cores required for the tool to run successfully, as well as details of the version of the software that the description was written for and other useful metadata. These features are discussed further in other chapters of this user guide.
ru: Обратите внимание, что автор описания CWL также включил в него `ResourceRequirement`, указав минимальный объем оперативной памяти и количество ядер, необходимых для успешной работы инструмента, а также сведения о версии программного обеспечения, для которого было написано описание, и другие полезные метаданные. Более подробно эти функции рассматриваются в других главах данного руководства пользователя.
ta: இந்த சி.டபிள்யூ.எல் விளக்கத்தின் ஆசிரியருக்கு `ResourceRequirement`'ச் ஆகியவை அடங்கும் என்பதையும் நினைவில் கொள்க, கருவிக்கு வெற்றிகரமாக இயங்க தேவையான குறைந்தபட்ச ரேம் மற்றும் கோரின் எண்ணிக்கையையும், விளக்கம் எழுதப்பட்ட மென்பொருளின் பதிப்பின் விவரங்களையும் குறிப்பிடுகிறது என்பதையும் நினைவில் கொள்க மற்றும் பிற பயனுள்ள மேனிலை தரவு. இந்த பயனர் வழிகாட்டியின் பிற அத்தியாயங்களில் இந்த நற்பொருத்தங்கள் மேலும் விவாதிக்கப்படுகின்றன.
zh_hans: 另请注意，作者还在此 CWL 描述中加入了 `ResourceRequirement`, 指定了工具正常运行所需的最低内存容量和内核数、该描述针对的软件具体版本、以及其他有用的元数据。这些功能将在《用户指南》其他章节中进一步讨论。

source: Environment Variables
ja: 環境変数
ru: Переменные среды
ta: சுற்றுச்சூழல் மாறிகள்
zh_hans: 环境变量

source: Tools run in a restricted environment and do not inherit most environment variables from the parent process. You can set environment variables for the tool using `EnvVarRequirement`.
ja: ツールは制限された環境で実行されるため、親プロセスからほとんどの環境変数を引き継ぎません。 ツールの環境変数は、`EnvVarRequirement` を使って設定できます。
ru: Инструменты работают в ограниченном окружении и не наследуют большинство переменных окружения от родительского процесса. Вы можете задать переменные окружения для инструмента с помощью `EnvVarRequirement`.
ta: கருவிகள் தடைசெய்யப்பட்ட சூழலில் இயங்குகின்றன மற்றும் பெற்றோர் செயல்முறையிலிருந்து பெரும்பாலான சுற்றுச்சூழல் மாறிகள் பெறவில்லை. `Envvarrequirement` ஐப் பயன்படுத்தி கருவிக்கான சூழல் மாறிகள் அமைக்கலாம்.
zh_hans: CWL 工具运行于受限环境中，大多数环境变量都不会从父进程继承。 您可以使用 `EnvVarRequirements` 为该工具设置环境变量。

source: Expression Tool
ru: Экспресс-инструмент
ta: வெளிப்பாடு கருவி
zh_hans: 表达式工具

source: An expression tool is a type of Process that can be run by itself or as a Workflow step. It executes a pure JavaScript expression. It is meant to be used as a way to isolate complex JavaScript expressions that need to operate on input data and produce some result as output.
ja: ExpressionToolは、それ自体またはワークフローのステップとして実行することができるProcessの一種です。純粋な JavaScript 式を実行します。入力データを操作し、出力として結果を生成する必要がある複雑な JavaScript 式を分離する方法として使用されることを意図しています。
ru: Инструмент выражения - это тип процесса, который можно запускать самостоятельно или в качестве шага рабочего процесса. Он выполняет чистое выражение JavaScript. Его можно использовать как способ изолировать сложные выражения JavaScript, которые должны оперировать входными данными и выдавать на выходе некоторый результат.
ta: ஒரு வெளிப்பாடு கருவி என்பது ஒரு வகை செயல்முறையாகும், இது தானாகவே அல்லது பணிப்பாய்வு படியாக இயக்கப்படலாம். இது ஒரு தூய சாவாச்கிரிப்ட் வெளிப்பாட்டை செயல்படுத்துகிறது. உள்ளீட்டு தரவுகளில் செயல்பட வேண்டிய மற்றும் சில முடிவுகளை வெளியீடாக உருவாக்க வேண்டிய சிக்கலான சாவாச்கிரிப்ட் வெளிப்பாடுகளை தனிமைப்படுத்துவதற்கான ஒரு வழியாக இது பயன்படுத்தப்பட வேண்டும்.
zh_hans: 表达式工具是一种类型的流程 (process), 可单独运行，或作为工作流的一个步骤运行。它执行纯 JavaScript 表达式，意在隔离复杂的 JavaScript 表达式，以对输入数据进行运算，并生成结果作为输出。

source: Similar to the command-line tool it requires `inputs` and `outputs`. But instead of `baseCommand`, it requires an `expression` attribute.
ru: Как и инструмент командной строки, он требует `входов` и `выходов`. Но вместо `baseCommand` ему требуется атрибут `expression`.
ta: கட்டளை-வரி கருவியைப் போலவே இதற்கு `உள்ளீடுகள்` மற்றும்` வெளியீடுகள்` தேவைப்படுகிறது. ஆனால் `பேச் கமாண்டிற்கு` பதிலாக, அதற்கு ஒரு` வெளிப்பாடு` பண்புக்கூறு தேவைப்படுகிறது.
zh_hans: 与命令行工具一样，它需要 `inputs`（输入）和 `outputs`（输出），但与之不同的是，它需要的是 `expression` 属性，而非 `baseCommand`.

source: CWL expression tool.
ru: Средство выражения CWL.
ta: சி.டபிள்யூ.எல் வெளிப்பாடு கருவி.
zh_hans: CWL 表达式工具。

source: `uppercase.cwl`
ta: `Worpercase.cwl`

source: We had to use an `InlineJavascriptRequirement` as our expression contains a JavaScript call in `.toUpperCase()`. This means to tools using the expression tool that JavaScript is a requirement.
ru: Мы должны были использовать `InlineJavascriptRequirement`, поскольку наше выражение содержит вызов JavaScript в `.toUpperCase()`. Это означает для инструментов, использующих инструмент выражения, что JavaScript является требованием.
ta: எங்கள் வெளிப்பாடு `.touppercase ()` இல் சாவாச்கிரிப்ட் அழைப்பைக் கொண்டிருப்பதால், `inlinejavascriptrequirement 'ஐப் பயன்படுத்த வேண்டியிருந்தது. சாவாச்கிரிப்ட் ஒரு தேவை என்று வெளிப்பாடு கருவியைப் பயன்படுத்தும் கருவிகளுக்கு இதன் பொருள்.
zh_hans: 因为我们的表达式在 `.toUpperCase()` 处含有一个 JavaScript 调用，所以必须使用 `InlineJavascriptRequirements`. 这向使用表达式工具的其他工具表明 JavaScript 是必备条件。

source: Expressions
ru: Выражения
ta: வெளிப்பாடுகள்
zh_hans: 表达式

source: If you need to manipulate input parameters, include the requirement `InlineJavascriptRequirement` and then anywhere a parameter reference is legal you can provide a fragment of Javascript that will be evaluated by the CWL runner.
ru: Если вам нужно манипулировать входными параметрами, включите требование `InlineJavascriptRequirement`, а затем везде, где ссылка на параметр является законной, вы можете предоставить фрагмент Javascript, который будет оценен CWL runner'ом.
ta: நீங்கள் உள்ளீட்டு அளவுருக்களைக் கையாள வேண்டும் என்றால், `inlinejavascriptrequirement` தேவையைச் சேர்க்கவும், பின்னர் எங்கும் ஒரு அளவுரு குறிப்பு சட்டப்பூர்வமானது, நீங்கள் CWL ரன்னரால் மதிப்பீடு செய்யப்படும் சாவாச்கிரிப்ட்டின் ஒரு பகுதியை வழங்க முடியும்.
zh_hans: 如果需要对输入参数进行处理，请添加需求 `InlineJavascriptRequirement`. 然后，在可以合法引用参数的任何地方，您都可以提供一 JavaScript 片段，让 CWL 运行程序计算其值。

source: JavaScript expressions should only be used when absolutely necessary. When manipulating file names, extensions, paths etc, consider whether one of the [built in `File` properties][file-prop] like `basename`, `nameroot`, `nameext`, etc, could be used instead. See the [list of best practices](best-practices.md).
ru: Выражения JavaScript следует использовать только в случае крайней необходимости. При манипуляциях с именами файлов, расширениями, путями и т. д. подумайте, нельзя ли вместо этого использовать одно из [встроенных свойств `File`][file-prop], например `basename`, `nameroot`, `nameext` и т. д. См. [список лучших практик](best-practices.md).
ta: சாவாச்கிரிப்ட் வெளிப்பாடுகள் முற்றிலும் தேவைப்படும்போது மட்டுமே பயன்படுத்தப்பட வேண்டும். கோப்பு பெயர்கள், நீட்டிப்புகள், பாதைகள் போன்றவற்றைக் கையாளும் போது, `basename`,`nameroot`, `nameext` போன்றவற்றைப் போன்ற [` கோப்பு` பண்புகளில்][file-prop] ஒன்றைப் பயன்படுத்த முடியுமா என்பதைக் கவனியுங்கள். [சிறந்த நடைமுறைகளின் பட்டியல்](best-practices.md) ஐப் பார்க்கவும்.
zh_hans: JavaScript 表达式应当仅在绝对必要时使用。要处理文件名、扩展名、路径等，请优先考虑能否使用 `basename`、`nameroot`、`nameext` 等 [`File` 内置属性][file-prop]。对此，请参阅[优良习惯一览](best-practice.md)。

source: As this tool does not require any `inputs` we can run it with an (almost) empty job file:
ja: このツールは`inputs` を必要としないので、（ほとんど）空のジョブファイルで実行することができます：
ru: Поскольку этот инструмент не требует никаких `входных данных`, мы можем запустить его с (почти) пустым файлом задания:
ta: இந்த கருவிக்கு `inputs`தேவையில்லை என்பதால், அதை (கிட்டத்தட்ட) வெற்று வேலை கோப்புடன் இயக்க முடியும்:
zh_hans: 由于此工具不需要任何 `inputs`（输入），因此运行的时候可以使用一个几乎为空的作业文件：

source: `empty.yml`
ta: `gaing.yml`

source: `empty.yml` contains a description of an empty JSON object. JSON objects descriptions are contained inside curly brackets `{}`, so an empty object is represented simply by a set of empty brackets.
ja: `empty.yml` には、空のJSONオブジェクトの記述があります。JSONオブジェクトの記述は、中括弧`{}` の中に含まれるので、空のオブジェクトは、単に空の括弧のセットで表されます。
ru: `empty.yml` содержит описание пустого JSON-объекта. Описания JSON-объектов содержатся внутри фигурных скобок `{}`, поэтому пустой объект представляется просто набором пустых скобок.
ta: `gall.yml` வெற்று சாதொபொகு பொருளின் விளக்கத்தைக் கொண்டுள்ளது. சாதொபொகு பொருள்களின் விளக்கங்கள் சுருள் அடைப்புக்குறிக்குள் உள்ளன `{}`, எனவே ஒரு வெற்று பொருள் வெறுமனே வெற்று அடைப்புக்குறிகளால் குறிப்பிடப்படுகிறது.
zh_hans: `empty.yml` 的内容是一个空 JSON 对象的描述。JSON 对象描述是用大括号 `{}` 围起来的，因此，表示空对象仅需一对空括号就够了。

source: We can then run `expression.cwl`:
ja: 次に、`expression.cwl` を実行することができます：
ru: Затем мы можем запустить `expression.cwl`:
ta: நாம் `Expression.cwl` ஐ இயக்கலாம்:
zh_hans: 然后我们可以运行 `expression.cwl`:

source: Running `expression.cwl`
ja: `expression.cwl` を実行する
ru: Запуск `expression.cwl`
ta: `Expression.cwl` ஐ இயக்குகிறது
zh_hans: 运行 `expression.cwl`

source: Note that requirements can be provided with the map syntax, as in the example above:
ja: なお、上の例のように、map構文で requirements を指定することも可能です：
ru: Обратите внимание, что требования могут быть представлены с помощью синтаксиса map, как в примере выше:
ta: மேலே உள்ள எடுத்துக்காட்டில் உள்ளதைப் போல, வரைபடத் தொடரியல் மூலம் தேவைகளை வழங்க முடியும் என்பதை நினைவில் கொள்க:
zh_hans: 请注意，如上例所示，requirements（要求）可通过映射语法来提供：

source: Or as an array, with each entry (in this case, only `class: InlineJavascriptRequirement`) marked by a `-`. The same syntax is used to describe the additional command line arguments.
ja: または配列として、各エントリ（この場合、`class: InlineJavascriptRequirement` だけです）に`-` を付けます。同じ構文で、追加のコマンドライン引数を定義します。
ru: Или в виде массива, в котором каждая запись (в данном случае только `class: InlineJavascriptRequirement`) отмечена символом `-`. Тот же синтаксис используется для описания дополнительных аргументов командной строки.
ta: அல்லது ஒரு வரிசையாக, ஒவ்வொரு நுழைவுடனும் (இந்த விசயத்தில், `வகுப்பு: inlinejavascriptrequirement`) ஒரு` -` ஆல் குறிக்கப்பட்டுள்ளது. கூடுதல் கட்டளை வரி வாதங்களை விவரிக்க அதே தொடரியல் பயன்படுத்தப்படுகிறது.
zh_hans: 也可以作为一个数组，每个元素均用 `-` 标记（本例中只有一个 `class: InlineJavascriptRequirement` ），就和描述额外命令行参数的语法一样。

source: Where are JavaScript expressions allowed?
ja: JavaScriptはどこで使えますか？
ru: Где разрешены выражения JavaScript?
ta: சாவாச்கிரிப்ட் வெளிப்பாடுகள் எங்கே அனுமதிக்கப்படுகின்றன?
zh_hans: 哪里可以使用 JavaScript 表达式？

source: Just like [parameter references](parameter-references.md), you can use JavaScript Expressions only in certain fields. These are:
ru: Так же, как и [ссылки на параметры](parameter-references.md), вы можете использовать выражения JavaScript только в определенных полях. К ним относятся:
ta: [அளவுரு குறிப்புகள்](parameter-references.md) போலவே, நீங்கள் சில துறைகளில் மட்டுமே சாவாச்கிரிப்ட் வெளிப்பாடுகளைப் பயன்படுத்தலாம். அவை:
zh_hans: JavaScript 表达式如同[参数引用](parameter-references.md)一样，只能用于某些特定字段，即：

source: From [`CommandLineTool`](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandLineTool)
ja: [`CommandLineTool`](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandLineTool)から
ru: Из [`CommandLineTool`](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandLineTool)
ta: [`CommandLineTool`](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandLineTool) இலிருந்து
zh_hans: 来自 [`CommandLineTool`](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandLineTool)

source: `arguments`
ru: `аргументы`
ta: `வாதங்கள்`

source: `valueFrom`
ta: `மதிப்பு`

source: `stderr`
ta: `ச்டைடர்`

source: From [CommandInputParameter](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandInputParameter)
ja: [CommandInputParameter](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandInputParameter)から
ru: Из [CommandInputParameter](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandInputParameter)
ta: [CommandInputParameter](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandInputParameter) இலிருந்து
zh_hans: 来自 [CommandInputParameter](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandInputParameter)

source: `format`
ru: `формат`
ta: `வடிவமைப்பு`

source: `secondaryFiles`
ta: `இரண்டாம் நிலை கோப்புகள்`

source: From [`inputBinding`](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandLineBinding)
ja: [`inputBinding`](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandLineBinding)から
ru: Из [`inputBinding`](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandLineBinding)
ta: [`inputBinding`](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandLineBinding) இலிருந்து
zh_hans: 来自 [`inputBinding`](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandLineBinding)

source: From [CommandOutputParamater](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandOutputParameter)
ja: [CommandOutputParamater](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandOutputParameter)から
ru: Из [CommandOutputParamater](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandOutputParameter)
ta: [CommandOutputParamater](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandOutputParameter)இலிருந்து
zh_hans: 来自 [CommandOutputParamater](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandOutputParameter)

source: From [CommandOutputBinding](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandOutputBinding)
ja: [CommandOutputBinding](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandOutputBinding)から
ru: Из [CommandOutputBinding](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandOutputBinding)
ta: [CommandOutputBinding](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandOutputBinding) இலிருந்து
zh_hans: 来自 [CommandOutputBinding](https://www.commonwl.org/v1.0/CommandLineTool.html#CommandOutputBinding)

source: `glob`
ta: `குளோப்`

source: From `Workflow`
ru: Из `Рабочего процесса`
ta: `பணிப்பாய்வு` இலிருந்து
zh_hans: 来自 `Workflow`

source: From [InputParameter](https://www.commonwl.org/v1.0/Workflow.html#InputParameter) and [WorkflowOutputParameter](https://www.commonwl.org/v1.0/Workflow.html#WorkflowOutputParameter)
ja: [InputParameter](https://www.commonwl.org/v1.0/Workflow.html#InputParameter) と [WorkflowOutputParameter](https://www.commonwl.org/v1.0/Workflow.html#WorkflowOutputParameter)から
ru: Из [InputParameter](https://www.commonwl.org/v1.0/Workflow.html#InputParameter) и [WorkflowOutputParameter](https://www.commonwl.org/v1.0/Workflow.html#WorkflowOutputParameter)
ta: இருந்து [InputParameter](https://www.commonwl.org/v1.0/Workflow.html#InputParameter) and [WorkflowOutputParameter](https://www.commonwl.org/v1.0/Workflow.html#WorkflowOutputParameter)
zh_hans: 来自 [InputParameter](https://www.commonwl.org/v1.0/Workflow.html#InputParameter) 和 [WorkflowOutputParameter](https://www.commonwl.org/v1.0/Workflow.html#WorkflowOutputParameter)

source: From `steps`
ja: `steps`から
ru: От `шагов`
ta: `படிகள்` இலிருந்து
zh_hans: 来自 `steps`

source: From [WorkflowStepInput](https://www.commonwl.org/v1.0/Workflow.html#WorkflowStepInput)
ja: [WorkflowStepInput](https://www.commonwl.org/v1.0/Workflow.html#WorkflowStepInput)から
ru: Из [WorkflowStepInput](https://www.commonwl.org/v1.0/Workflow.html#WorkflowStepInput)
ta: [WorkflowStepInput](https://www.commonwl.org/v1.0/Workflow.html#WorkflowStepInput) இலிருந்து
zh_hans: 来自 [WorkflowStepInput](https://www.commonwl.org/v1.0/Workflow.html#WorkflowStepInput)

source: From [ExpressionTool](https://www.commonwl.org/v1.0/Workflow.html#ExpressionTool)
ja: [ExpressionTool](https://www.commonwl.org/v1.0/Workflow.html#ExpressionTool)から
ru: Из [ExpressionTool](https://www.commonwl.org/v1.0/Workflow.html#ExpressionTool)
ta: [ExpressionTool](https://www.commonwl.org/v1.0/Workflow.html#ExpressionTool) இலிருந்து
zh_hans: 来自 [ExpressionTool](https://www.commonwl.org/v1.0/Workflow.html#ExpressionTool)

source: `expression`
ru: `выражение`
ta: `வெளிப்பாடு`

source: From [InputParameter](https://www.commonwl.org/v1.0/Workflow.html#InputParameter) and [ExpressionToolOutputParameter](https://www.commonwl.org/v1.0/Workflow.html#ExpressionToolOutputParameter)
ja: [InputParameter](https://www.commonwl.org/v1.0/Workflow.html#InputParameter) と [ExpressionToolOutputParameter](https://www.commonwl.org/v1.0/Workflow.html#ExpressionToolOutputParameter)から
ru: Из [InputParameter](https://www.commonwl.org/v1.0/Workflow.html#InputParameter) и [ExpressionToolOutputParameter](https://www.commonwl.org/v1.0/Workflow.html#ExpressionToolOutputParameter)
ta: இருந்து [InputParameter](https://www.commonwl.org/v1.0/Workflow.html#InputParameter) and [ExpressionToolOutputParameter](https://www.commonwl.org/v1.0/Workflow.html#ExpressionToolOutputParameter)
zh_hans: 来自 [InputParameter](https://www.commonwl.org/v1.0/Workflow.html#InputParameter) 和 [ExpressionToolOutputParameter](https://www.commonwl.org/v1.0/Workflow.html#ExpressionToolOutputParameter)
