Repository: common-workflow-language/user_guide
Catalog: locales/*/LC_MESSAGES/user_guide.po
Languages: ja, ru, ta, zh_hans

source: Implementation extensions not required for correct execution (for example, fields related to GUI presentation) and metadata about the tool or workflow itself (for example, authorship for use in citations) may be provided as additional fields on any object. Such extensions fields (e.g. `format: edam:format_2572`) can use a namespace prefix listed in the `$namespaces` section of the document (e.g. edam: http://edamontology.org/) as described in the [Schema Salad specification][schema-salad]. Once you add the namespace prefix, you can access it anywhere in the document as shown below. Otherwise, one must use full URLs: `format: http://edamontology.org/format_2572`.
ja: 正しい実行に必須でない実装拡張（例えば、GUI表示に関するフィールド）およびツールまたはワークフロー自体に関するメタデータ（例えば、引用で使用するための著者名）は、任意のオブジェクトの追加フィールドとして提供できます。このような拡張フィールド（例：`format: edam:format_2572` ）は、[Schema Salad仕様][schema-salad]で説明されているように、文書の`$namespaces` セクション（例： edam: http://edamontology.org/ ）に記載されている名前空間プレフィックスを使用できます。一度名前空間プレフィックスを追加すれば、以下のように定義内のどこにでもアクセスできるようになります。それ以外の場合は、完全なURLを使用しなければなりません。`format: http://edamontology.org/format_2572`.
ru: Расширения реализации, не требуемые для корректного выполнения (например, поля, связанные с представлением графического интерфейса), и метаданные о самом инструменте или рабочем процессе (например, авторство для использования в цитировании) могут быть предоставлены в качестве дополнительных полей любого объекта. Такие поля расширения (например, `format: edam:format_2572`) могут использовать префикс пространства имен, перечисленный в разделе `$namespaces` документа (например, edam: http://edamontology.org/), как описано в [Schema Salad specification][schema-salad]. После добавления префикса пространства имен вы можете обращаться к нему в любом месте документа, как показано ниже. В противном случае необходимо использовать полные URL: `формат: http://edamontology.org/format_2572`.
ta: சரியான செயலாக்கத்திற்கு அமலாக்க நீட்டிப்புகள் தேவையில்லை (எடுத்துக்காட்டாக, GUI விளக்கக்காட்சி தொடர்பான புலங்கள்) மற்றும் கருவி அல்லது பணிப்பாய்வு பற்றிய மேனிலை தரவு (எடுத்துக்காட்டாக, மேற்கோள்களில் பயன்படுத்துவதற்கான படைப்புரிமை) எந்தவொரு பொருளிலும் கூடுதல் புலங்களாக வழங்கப்படலாம். [Schema Salad specification][schema-salad] இல் விவரிக்கப்பட்டுள்ளபடி, ஆவணத்தின் `$ பெயர்வெளிகள்` பிரிவில் (எ.கா. `edam: http://edamontology.org/`) பட்டியலிடப்பட்டுள்ள பெயர்வெளி முன்னொட்டை இத்தகைய நீட்டிப்பு புலங்கள் (எ.கா.`format: edam:format_2572`). பெயர்வெளி முன்னொட்டை நீங்கள் சேர்த்தவுடன், கீழே காட்டப்பட்டுள்ளபடி ஆவணத்தில் எங்கும் அதை அணுகலாம். இல்லையெனில், ஒருவர் முழு முகவரி களைப் பயன்படுத்த வேண்டும்: `format: http://edamontology.org/format_2572`.
zh_hans: 由某个实现所提供的非必需、不影响正确执行的扩展（如关于图形界面中展示的字段），以及关于工具或工作流本身的元数据（如用于引文的作者信息），都可以作为任意对象的附加字段提供。这种扩展字段（形如 `format: edam:format_2572`）可以使用文件 `$namespaces`（命名空间）部分依照 [Schema Salad 规约][schema-salad]的要求列举的命名空间前缀（例如 `edam：http://edamontology.org/`）。如下所示，一旦添加了命名空间前缀，便可在文档的任何位置使用它。否则，必须使用完整的 URL: `format: http://edamontology.org/format_2572`.

source: For all developers, we recommend the following minimal metadata for your tool and workflows. This example includes metadata allowing others to cite your tool.
ja: すべての開発者に対し、ツールおよびワークフローに関する以下の最小限のメタデータを推奨します。この例では、他の人があなたのツールを引用するためのメタデータを含んでいます。
ru: Для всех разработчиков мы рекомендуем следующие минимальные метаданные для вашего инструмента и рабочих процессов. Этот пример включает метаданные, позволяющие другим пользователям ссылаться на ваш инструмент.
ta: அனைத்து டெவலப்பர்களுக்கும், உங்கள் கருவி மற்றும் பணிப்பாய்வுகளுக்கான பின்வரும் குறைந்தபட்ச மெட்டாடேட்டாவை நாங்கள் பரிந்துரைக்கிறோம். இந்த எடுத்துக்காட்டில் மேனிலை தரவு உங்கள் கருவியை மேற்கோள் காட்ட அனுமதிக்கிறது.
zh_hans: 我们建议所有的开发者为自己编写的工具和工作流提供类似下面所示的精简版元数据。此例中的元数据向他人说明如何在文献中引用你的工具。

source: Extended Example
ru: Расширенный пример
ta: நீட்டிக்கப்பட்ட எடுத்துக்காட்டு
zh_hans: 进一步扩展的例子

source: For those that are highly motivated, it is also possible to annotate your tool with a much larger amount of metadata. This example includes EDAM ontology tags as keywords (allowing the grouping of related tools), hints at hardware requirements in order to use the tool, and a few more metadata fields.
ru: Для тех, кто очень мотивирован, есть возможность аннотировать свой инструмент гораздо большим количеством метаданных. Этот пример включает теги онтологии EDAM в качестве ключевых слов (что позволяет группировать связанные инструменты), намеки на требования к аппаратному обеспечению для использования инструмента и еще несколько полей метаданных.
ta: அதிக உந்துதல் கொண்டவர்களுக்கு, உங்கள் கருவியை மிகப் பெரிய அளவிலான மேனிலை தரவு மூலம் சிறுகுறிப்பு செய்ய முடியும். இந்த எடுத்துக்காட்டில் EDAM ஆன்டாலசி குறிச்சொற்களை முக்கிய வார்த்தைகளாக (தொடர்புடைய கருவிகளின் தொகுப்பை அனுமதிக்கிறது), கருவியைப் பயன்படுத்துவதற்கு வன்பொருள் தேவைகள் மற்றும் இன்னும் சில மேனிலை தரவு புலங்கள் ஆகியவை அடங்கும்.
zh_hans: 如果您积极性更高，也可以加入更多的元数据来注释工具。此例中加入了 EDAM 本体标签作为关键字（以便将彼此关联的工具分组）、关于硬件要求的软性提示，以及其他元数据字段。

source: Operations
ru: Операции
ta: செயல்பாடுகள்
zh_hans: 抽象操作

source: An Operation is a type of CWL process, just like a workflow, a command-line tool, or an expression tool. It is a step of a workflow that specifies inputs and outputs, but it does not provide enough information to be executed.
ja: Operationは、Workflow、CommandLineTool、ExpressionToolと同様に、CWL Processの一種です。Workflowのステップで、入力と出力を指定しますが、実行するのに十分な情報を提供しません。
ru: Операция - это тип процесса CWL, такой же, как рабочий процесс, инструмент командной строки или инструмент выражений. Это шаг рабочего процесса, который определяет входы и выходы, но не предоставляет достаточно информации для выполнения.
ta: ஒரு செயல்பாடு என்பது ஒரு வகை சி.டபிள்யூ.எல் செயல்முறையாகும், இது ஒரு பணிப்பாய்வு, கட்டளை-வரி கருவி அல்லது வெளிப்பாடு கருவி போன்றது. இது உள்ளீடுகள் மற்றும் வெளியீடுகளைக் குறிப்பிடும் பணிப்பாய்வுகளின் ஒரு படியாகும், ஆனால் இது செயல்படுத்த போதுமான தகவல்களை வழங்காது.
zh_hans: 抽象操作 (Operation) 与工作流、命令行工具或表达式工具类似，是一种 CWL 流程。作为工作流中的一个步骤，它可以指定输入和输出，但不完全提供具体执行所需的信息。

source: You can create operations to visualize a workflow during development, before you are ready to submit the workflow to a CWL runner:
ja: CWLランナーにワークフローを送信する前に、開発中のワークフローを可視化することができます：
ru: Вы можете создавать операции для визуализации рабочего процесса во время разработки, прежде чем вы будете готовы отправить рабочий процесс в CWL runner:
ta: ஒரு சி.டபிள்யூ.எல் ரன்னருக்கு பணிப்பாய்வுகளை சமர்ப்பிக்க நீங்கள் தயாராக இருப்பதற்கு முன்பு, வளர்ச்சியின் போது ஒரு பணிப்பாய்வுகளை காட்சிப்படுத்த நீங்கள் செயல்பாடுகளை உருவாக்கலாம்:
zh_hans: 在开发周期中，工作流准备就绪、可以提交给 CWL 运行程序之前，您可以创建抽象操作，将工作流可视化：

source: `operations.cwl`
ta: `செயல்பாடுகள். CWL`

source: The `uppercase` step of the workflow is an operation. It can be used like a command line tool or an expression. You can also plot it with the CWL Viewer or `cwltool`:
ru: Шаг `uppercase` рабочего процесса - это операция. Ее можно использовать как инструмент командной строки или выражение. Вы также можете построить график с помощью CWL Viewer или `cwltool`:
ta: The `uppercase` படி of the workflow is an operation. இது ஒரு கட்டளை வரி கருவி அல்லது வெளிப்பாடு போல பயன்படுத்தப்படலாம். நீங்கள் அதை CWL பார்வையாளர் அல்லது `CWLTool` உடன் சூழ்ச்சி செய்யலாம்:
zh_hans: 工作流中的 `uppercase` 步骤是一个抽象操作，可以充当命令行工具或表达式使用。您可以用 CWL Viewer 或 `cwltool` 将它绘制出来：

source: The output of the command above can be rendered with a Graphviz renderer. The following image is rendered with the Sphinx Graphviz directive (this user guide is built with Sphinx):
ru: Вывод команды выше может быть отображен с помощью рендерера Graphviz. Следующее изображение отображается с помощью директивы Sphinx Graphviz (это руководство пользователя построено с помощью Sphinx):
ta: மேலே உள்ள கட்டளையின் வெளியீட்டை ஒரு கிராப்விச் ரெண்டரர் மூலம் வழங்கலாம். பின்வரும் படம் சூரரிமாச்சிலை Craffviz உத்தரவுடன் வழங்கப்படுகிறது (இந்த பயனர் வழிகாட்டி சூரரிமாச்சிலை உடன் கட்டப்பட்டுள்ளது):
zh_hans: 以上命令的输出可用 Graphviz 渲染出来。下面的图片是使用 Sphinx Graphviz 指令来渲染的（本《用户指南》是以 Sphinx 编译）：

source: If you try running it with `cwltool`, the command will fail since `cwltool` does not have enough information to know how to execute it:
ru: Если вы попытаетесь запустить ее с помощью `cwltool`, команда завершится неудачей, поскольку `cwltool` не имеет достаточно информации, чтобы понять, как ее выполнить:
ta: `Cwltool` உடன் அதை இயக்க முயற்சித்தால்,` cwltool` ஐ எவ்வாறு செயல்படுத்துவது என்பதை அறிய போதுமான தகவல்கள் இல்லை என்பதால் கட்டளை தோல்வியடையும்:
zh_hans: 如果您尝试用 `cwltool` 运行它，该命令会失败，因为 `cwltool` 缺少足够信息，无从知晓如何运行它：

source: `cwltool` does not know how to run operations
ja: `cwltool` は、どうやってoperationsを実行するかを知りません
ru: `cwltool` не знает, как выполнять операции
ta: `cwltool` செயல்பாடுகளை எவ்வாறு இயக்குவது என்று தெரியவில்லை
zh_hans: `cwltool` 不知道如何运行抽象操作

source: CWL runners may come up with ways to bind operations to concrete steps. A CWL runner could, for instance, use abstract operations with ID's that correspond to steps executed by a different workflow engine.
ru: Исполнители CWL могут придумать способы привязки операций к конкретным шагам. Например, CWL-прогонщик может использовать абстрактные операции с идентификаторами, которые соответствуют шагам, выполняемым другим механизмом рабочего процесса.
ta: சி.டபிள்யூ.எல் ஓட்டப்பந்தய வீரர்கள் செயல்பாடுகளை உறுதியான படிகளுடன் பிணைப்பதற்கான வழிகளைக் கொண்டு வரக்கூடும். ஒரு சி.டபிள்யூ.எல் ரன்னர், உதாரணமாக, ஐடியுடன் சுருக்க செயல்பாடுகளைப் பயன்படுத்தலாம், இது வேறு பணிப்பாய்வு இயந்திரத்தால் செயல்படுத்தப்படும் படிகளுக்கு ஒத்திருக்கிறது.
zh_hans: CWL 运行程序可能安排一些将抽象操作绑定到具体步骤的方法。例如，带有 ID 的抽象操作有可能对映到其他工作流引擎中执行的步骤。

source: Outputs
ru: Выходы
ta: வெளியீடுகள்
zh_hans: 输出

source: Returning Output Files
ja: 出力ファイルの回収
ru: Возвращение выходных файлов
ta: வெளியீட்டு கோப்புகளைத் தருகிறது
zh_hans: 返回输出文件

source: The `outputs` of a tool is a list of output parameters that should be returned after running the tool. Each parameter has an `id` for the name of parameter, and `type` describing what types of values are valid for that parameter.
ja: ツールの`outputs` は、ツールの実行後に返されるべき出力パラメータのリストです。 各パラメーターには、パラメーター名を示す`id` と、そのパラメーターに有効な値の型を示す`type` があります。
ru: Выходные данные" инструмента - это список выходных параметров, которые должны быть возвращены после выполнения инструмента. Каждый параметр имеет `id` для имени параметра и `type`, описывающий, какие типы значений допустимы для этого параметра.
ta: ஒரு கருவியின் `வெளியீடுகள்` கருவியை இயக்கிய பின் திருப்பித் தர வேண்டிய வெளியீட்டு அளவுருக்களின் பட்டியல். ஒவ்வொரு அளவுருவிலும் அளவுருவின் பெயருக்கு `ஐடி` உள்ளது, மேலும் அந்த அளவுருவுக்கு எந்த வகையான மதிப்புகள் செல்லுபடியாகும் என்பதை விவரிக்கிறது.
zh_hans: 某个工具的 ` outputs `（输出）项是运行该工具后应返回的输出参数列表。 每个参数都有一个代表其名称的 `id`字段，以及描述其有效值类型的 `type` 字段。

source: When a tool runs under CWL, the starting working directory is the designated output directory. The underlying tool or script must record its results in the form of files created in the output directory. The output parameters returned by the CWL tool are either the output files themselves, or come from examining the content of those files.
ru: Когда инструмент запускается под управлением CWL, начальным рабочим каталогом является назначенный выходной каталог. Инструмент или сценарий должен записывать свои результаты в виде файлов, созданных в выходном каталоге. Выходные параметры, возвращаемые инструментом CWL, являются либо самими выходными файлами, либо получены в результате изучения содержимого этих файлов.
ta: CWL இன் கீழ் ஒரு கருவி இயங்கும்போது, தொடக்க வேலை அடைவு என்பது நியமிக்கப்பட்ட வெளியீட்டு அடைவு ஆகும். அடிப்படை கருவி அல்லது ச்கிரிப்ட் அதன் முடிவுகளை வெளியீட்டு கோப்பகத்தில் உருவாக்கிய கோப்புகளின் வடிவத்தில் பதிவு செய்ய வேண்டும். சி.டபிள்யூ.எல் கருவியால் திரும்பிய வெளியீட்டு அளவுருக்கள் வெளியீட்டு கோப்புகள் அல்லது அந்த கோப்புகளின் உள்ளடக்கத்தை ஆராய்வதிலிருந்து வந்தவை.
zh_hans: 工具在 CWL 下运行时，起始工作目录即指定输出目录。 基础工具或脚本记录运行结果，必须以输出目录下文件的形式实现。 CWL 工具返回的输出参数要么是输出文件本身，要么是分析这些文件的内容而得出的信息。

source: The following example demonstrates how to return a file that has been extracted from a tar file.
ja: 次の例は、tarファイルから抽出されたファイルを返す方法を示しています。
ru: В следующем примере показано, как вернуть файл, извлеченный из tar-файла.
ta: தார் கோப்பிலிருந்து பிரித்தெடுக்கப்பட்ட கோப்பை எவ்வாறு திருப்பித் தருவது என்பதை பின்வரும் எடுத்துக்காட்டு நிரூபிக்கிறது.
zh_hans: 下例演示怎样返回从 tar 文件中提取的文件。

source: Passing mandatory arguments to the `baseCommand`
ja: `baseCommand` に必須引数を渡します。
ru: Передача обязательных аргументов в `baseCommand`
ta: கட்டாய வாதங்களை `பேச் கமாண்டிற்கு` அனுப்புதல்
zh_hans: 将必要参数传递给 `baseCommand`

source: In previous examples, the `baseCommand` was just a string, with any arguments passed as CWL inputs. Instead of a single string we can use an _array of strings_. The first element is the command to run, and any subsequent elements are mandatory command line arguments
ru: В предыдущих примерах `базовая команда` была просто строкой, а все аргументы передавались как CWL-входы. Вместо одной строки мы можем использовать _массив строк_. Первый элемент - это команда, которую нужно выполнить, а все последующие элементы - обязательные аргументы командной строки
ta: முந்தைய எடுத்துக்காட்டுகளில், `baseCommand` ஒரு சரம் மட்டுமே, எந்தவொரு வாதங்களும் சி.டபிள்யூ.எல் உள்ளீடுகளாக நிறைவேற்றப்பட்டன. ஒற்றை சரத்திற்கு பதிலாக நாம் _array இன் சரத்திற்கு_ ஐப் பயன்படுத்தலாம். முதல் உறுப்பு இயக்க கட்டளை, மற்றும் அடுத்தடுத்த கூறுகள் கட்டாய கட்டளை வரி வாதங்கள்
zh_hans: 在此前的例子里，`baseCommand` 命令不过是一个字符串，命令的参数都由 CWL 输入传递而来。不过，我们也可以用字符串数组构建命令。为此，只需要让待运行的命令成为数组的第一个元素，这样所有后续元素均成为命令行的必要参数

source: Next, create a tar file for the example.
ja: 次に、サンプルとなるtarファイルを作成します。
ru: Затем создайте tar-файл для примера.
ta: அடுத்து, எடுத்துக்காட்டுக்கு ஒரு தார் கோப்பை உருவாக்கவும்.
zh_hans: 接下来，新建一个 tar 文件供本示例使用。

source: And now invoke `cwltool` with the tool description and the input object on the command line:
ja: そして、今度はコマンドラインにツール定義と入力オブジェクトを指定して`cwltool` を呼び出します：
ru: А теперь вызовите `cwltool` с описанием инструмента и входным объектом в командной строке:
ta: இப்போது கருவி விளக்கம் மற்றும் கட்டளை வரியில் உள்ளீட்டு பொருளுடன் `cwltool` ஐ அழைக்கவும்:
zh_hans: 现在，在命令行上结合工具描述和输入对象运行 `cwltool`:

source: The field `outputBinding` describes how to set the value of each output parameter.
ru: Поле `outputBinding` описывает, как установить значение каждого выходного параметра.
ta: ஒவ்வொரு வெளியீட்டு அளவுருவின் மதிப்பை எவ்வாறு அமைப்பது என்பதை புலம் `வெளியீடு பைண்டிங்` விவரிக்கிறது.
zh_hans: `outputBinding` 字段描述如何设置每个输出参数的值。

source: The `glob` field consists of the name of a file in the output directory. If you don't know name of the file in advance, you can use a wildcard pattern like `glob: '*.txt'`.
ru: Поле `glob` состоит из имени файла в выходном каталоге. Если вы не знаете имя файла заранее, вы можете использовать подстановочный шаблон, например `glob: '*.txt'`.
ta: `குளோப்` புலம் வெளியீட்டு கோப்பகத்தில் ஒரு கோப்பின் பெயரைக் கொண்டுள்ளது. முன்கூட்டியே கோப்பின் பெயர் உங்களுக்குத் தெரியாவிட்டால், நீங்கள் `குளோப்: '*.txt'` போன்ற வைல்டு அட்டை வடிவத்தைப் பயன்படுத்தலாம்.
zh_hans: `glob` 字段由输出目录中的文件名组成。如果事先不知道文件名，可以使用通配符，例如 `glob: '*.txt'`.

source: Capturing Standard Output
ja: 標準出力をキャプチャする
ru: Захват стандартного вывода
ta: நிலையான வெளியீட்டைக் கைப்பற்றுதல்
zh_hans: 捕获标准输出

source: To capture a tool's standard output stream, add the `stdout` field with the name of the file where the output stream should go. Then add `type: stdout` on the corresponding output parameter.
ru: Чтобы захватить стандартный поток вывода инструмента, добавьте поле `stdout` с именем файла, в который должен попасть поток вывода. Затем добавьте `type: stdout` в соответствующий параметр вывода.
ta: ஒரு கருவியின் நிலையான வெளியீட்டு ச்ட்ரீமைப் பிடிக்க, வெளியீட்டு ச்ட்ரீம் செல்ல வேண்டிய கோப்பின் பெயருடன் `stdout` புலத்தைச் சேர்க்கவும். தொடர்புடைய வெளியீட்டு அளவுருவில் `வகை: stdout` ஐச் சேர்க்கவும்.
zh_hans: 要捕获工具的标准输出流，请添加 `stdout` 字段，配上输出流应定向到的文件名。 然后，给相应的输出参数添加 `type: stdout` 字段。

source: Array Outputs
ja: 出力の配列
ru: Выходы массивов
ta: வரிசை வெளியீடுகள்
zh_hans: 数组输出

source: You can also capture multiple output files into an array of files using `glob`.
ja: また、`glob` を使って、複数の出力ファイルを配列に取り込むことができます。
ru: Вы также можете объединить несколько выходных файлов в массив файлов с помощью `glob`.
ta: `குளோப்` ஐப் பயன்படுத்தி பல வெளியீட்டு கோப்புகளையும் கோப்புகளின் வரிசையில் கைப்பற்றலாம்.
zh_hans: 您也可以用 `glob` 将多个输出文件捕获至一个文件数组。

source: As described in the [YAML Guide](yaml-guide.md#arrays), the array of expected outputs is specified in `array-outputs-job.yml` with each entry marked by a leading `-`. This format can also be used in CWL descriptions to mark entries in arrays, as demonstrated in several of the upcoming sections.
ru: Как описано в [YAML Guide](yaml-guide.md#arrays), массив ожидаемых результатов задается в `array-outputs-job.yml` с каждой записью, помеченной ведущим `-`. Этот формат также может использоваться в описаниях CWL для маркировки записей в массивах, как будет показано в нескольких последующих разделах.
ta: [YAML வழிகாட்டி](yaml-guide.md#arrays) இல் விவரிக்கப்பட்டுள்ளபடி, எதிர்பார்க்கப்படும் வெளியீடுகளின் வரிசை `array-outputs-job.yml` இல் குறிப்பிடப்பட்டுள்ளது. வரவிருக்கும் பல பிரிவுகளில் நிரூபிக்கப்பட்டபடி, வரிசைகளில் உள்ளீடுகளைக் குறிக்க CWL விளக்கங்களில் இந்த வடிவத்தைப் பயன்படுத்தலாம்.
zh_hans: 如[《YAML 指南》](yaml-guide.md#arrays)中所述，`array-outputs-job.yml` 文件中行首为 `-` 的成员代表数组元素，用以指明我们期待的各个输出。这种格式还可以用在 CWL 描述中表示数组成员。接下来若干章节中会演示这一用法。

source: Parameter References
ja: パラメータリファレンス
ru: Ссылки на параметры
ta: அளவுரு குறிப்புகள்
zh_hans: 参数引用

source: In a previous example, we extracted a file using the "tar" program. However, that example was very limited because it assumed that the file we were interested in was called "hello.txt", and this was written into the `.cwl` file. This is not the best way to do this, as the "hello.txt" filename may vary or be dependent on the input file(s) used. To avoid this we can specify the name of the file we want in the job parameters file (`.yml`). In this example, you will see how to reference the value of input parameters dynamically from other fields, which will allow us to then specify the name of the file to extract.
ja: 前の例では、"tar "プログラムを使用してファイルを抽出しました。しかし、その例は非常に限定的なものでした。というのも、私たちが興味を持っているファイルは"hello.txt"と呼ばれ、これが`.cwl` ファイルに直接書き込まれていると仮定していたからです。これは最良の方法ではありません。なぜなら、"hello.txt "というファイル名は、使用する入力ファイルによって異なるか、または依存する可能性があるからです。 これを避けるために、ジョブパラメーターファイル(`.yml`)で必要なファイル名を指定することができます。この例では、入力パラメーターの値を他のフィールドから動的に参照して、抽出するファイル名を指定する方法を説明します。
ru: В предыдущем примере мы извлекли файл с помощью программы "tar". Однако этот пример был очень ограниченным, поскольку предполагалось, что интересующий нас файл называется "hello.txt", и он был записан в файл `.cwl`. Это не самый лучший способ, поскольку имя файла "hello.txt" может меняться или зависеть от используемого входного файла (файлов). Чтобы избежать этого, мы можем указать имя нужного нам файла в файле параметров задания (`.yml`). В этом примере вы увидите, как динамически ссылаться на значение входных параметров из других полей, что позволит нам затем указать имя файла для извлечения.
ta: முந்தைய எடுத்துக்காட்டில், "தார்" நிரலைப் பயன்படுத்தி ஒரு கோப்பைப் பிரித்தெடுத்தோம். எவ்வாறாயினும், அந்த எடுத்துக்காட்டு மிகவும் குறைவாகவே இருந்தது, ஏனெனில் நாங்கள் ஆர்வமாக இருந்த கோப்பு "அலோ.டெக்ச்டி" என்று அழைக்கப்பட்டது, இது `.cwl` கோப்பில் எழுதப்பட்டது. இதைச் செய்வதற்கான சிறந்த வழி இதுவல்ல, ஏனெனில் "அலோ.டெக்ச்டி" கோப்பு பெயர் மாறுபடலாம் அல்லது பயன்படுத்தப்படும் உள்ளீட்டு கோப்பு (களை) சார்ந்துள்ளது. இதைத் தவிர்க்க, வேலை அளவுருக்கள் கோப்பில் (`.yml`) நாம் விரும்பும் கோப்பின் பெயரை குறிப்பிடலாம். இந்த எடுத்துக்காட்டில், உள்ளீட்டு அளவுருக்களின் மதிப்பை மற்ற புலங்களிலிருந்து மாறும் வகையில் எவ்வாறு குறிப்பிடுவது என்பதை நீங்கள் காண்பீர்கள், இது பிரித்தெடுக்க கோப்பின் பெயரைக் குறிப்பிட அனுமதிக்கும்.
zh_hans: 在前面的例子中，我们使用 “tar” 程序提取了一个文件。但是，该示例局限性很强，因为它假定了我们感兴趣的文件名就是 “hello.txt”, 而且这种假设直接写入了 `.cwl` 代码文件里。这种做法有欠妥当，因为文件名 “hello.txt” 可能会改变，也可能依赖我们实际用到的输入文件。 为了避免这类情况，我们可以在作业参数 (`.yml`) 文件中指定我们想要的文件名。本示例将演示如何从其他字段动态引用输入参数值，以便指定待提取的文件名。

source: Create your input files and invoke `cwltool` with the tool description and the input object on the command line:
ja: 入力ファイル(入力オブジェクト)を作成し、コマンドラインでツール定義と入力オブジェクトを指定して`cwltool` を呼び出します：
ru: Создайте входные файлы и вызовите `cwltool` с описанием инструмента и входным объектом в командной строке:
ta: உங்கள் உள்ளீட்டு கோப்புகளை உருவாக்கி, கருவி விளக்கம் மற்றும் கட்டளை வரியில் உள்ளீட்டு பொருளுடன் `CWLTool` ஐ அழைக்கவும்:
zh_hans: 创建输入文件，然后以工具描述和输入对象为命令行参数调用 `cwltool`:

source: Certain fields permit parameter references which are enclosed in `$(...)`. These are evaluated and replaced with value being referenced.
ru: Некоторые поля допускают ссылки на параметры, заключенные в `$(...)`. Они оцениваются и заменяются значением, на которое ссылаются.
ta: சில புலங்கள் `$ (...)` இல் இணைக்கப்பட்டுள்ள அளவுரு குறிப்புகளை அனுமதிக்கின்றன. இவை மதிப்பீடு செய்யப்பட்டு குறிப்பிடப்படும் மதிப்பு மூலம் மாற்றப்படுகின்றன.
zh_hans: 某些字段允许出现用 `$(...)` 符号括起来的参数引用，由求值的结果代入。

source: References are written using a subset of Javascript syntax. In this example, `$(inputs.extractfile)`, `$(inputs["extractfile"])`, and `$(inputs['extractfile'])` are equivalent.
ru: Ссылки записываются с использованием подмножества синтаксиса Javascript. В данном примере `$(inputs.extractfile)`, `$(inputs["extractfile"])` и `$(inputs['extractfile'])` эквивалентны.
ta: சாவாச்கிரிப்ட் தொடரியல் துணைக்குழுவைப் பயன்படுத்தி குறிப்புகள் எழுதப்பட்டுள்ளன. இந்த எடுத்துக்காட்டில், `$(inputs.extractfile)`, `$(inputs["extractfile"])`, மற்றும் `$(inputs['extractfile'])` ஆகியவை சமமானவை.
zh_hans: 引用的编写用的是 JavaScript 语法的一个子集。 本例中，`$(inputs.extractfile)`、`$(inputs["extractfile"])` 和 `$(inputs['extractfile'])` 效果相同。

source: The value of the "inputs" variable is the input object provided when the CWL tool was invoked.
ja: 変数 "inputs "の値は、CWLツールの起動時に提供された入力オブジェクトです。
ru: Значением переменной "inputs" является объект ввода, предоставленный при вызове инструмента CWL.
ta: "உள்ளீடுகள்" மாறியின் மதிப்பு CWL கருவி செயல்படுத்தப்பட்டபோது வழங்கப்பட்ட உள்ளீட்டு பொருள்.
zh_hans: “inputs” 变量的取值为 CWL 工具被调用时获得的输入对象。

source: Note that because `File` parameters are objects, to get the path to an input file you must reference the path field on a file object; to reference the path to the tar file in the above example you would write `$(inputs.tarfile.path)`.
ru: Обратите внимание, что поскольку параметры `File` являются объектами, для получения пути к входному файлу необходимо сослаться на поле path в файловом объекте; чтобы сослаться на путь к tar-файлу в приведенном выше примере, нужно написать `$(inputs.tarfile.path)`.
ta: `கோப்பு` அளவுருக்கள் பொருள்கள் என்பதால், உள்ளீட்டு கோப்பிற்கான பாதையைப் பெற நீங்கள் ஒரு கோப்பு பொருளில் பாதை புலத்தைக் குறிப்பிட வேண்டும்; மேலே உள்ள எடுத்துக்காட்டில் தார் கோப்பிற்கான பாதையை குறிப்பிட நீங்கள் `$ (உள்ளீடுகள். tarfile.path)` எழுதுவீர்கள்.
zh_hans: 请注意，由于 `File`（文件）参数是对象。因此，要获取输入文件的路径，须引用文件对象上的“path”（路径）字段。例如，要引用上面例子中 tar 文件的路径，则需要写为 `$(inputs.tarfile.path)`.

source: Where are parameter references allowed?
ja: パラメータ参照はどこで許されるのですか？
ru: Где разрешены ссылки на параметры?
ta: அளவுரு குறிப்புகள் எங்கே அனுமதிக்கப்படுகின்றன?
zh_hans: 参数引用可以出现在哪些地方？

source: You can only use parameter references in certain fields. These are:
ru: Ссылки на параметры можно использовать только в определенных полях. К ним относятся:
ta: நீங்கள் சில துறைகளில் அளவுரு குறிப்புகளை மட்டுமே பயன்படுத்த முடியும். அவை:
zh_hans: 参数引用只能出现在有限的字段中，即：

source: From [`CommandLineTool`](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandLineTool)
ru: Из [`CommandLineTool`](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandLineTool)
ta: [`CommandLineTool`](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandLineTool) இலிருந்து
zh_hans: 来自 [`CommandLineTool`](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandLineTool)
