Repository: common-workflow-language/user_guide
Catalog: locales/*/LC_MESSAGES/user_guide.po
Languages: ja, ru, ta, zh_hans

source: From [`ResourceRequirement`](https://www.commonwl.org/v1.0/CommandLineTool.html#ResourceRequirement)
ja: [`ResourceRequirement`](https://www.commonwl.org/v1.0/CommandLineTool.html#ResourceRequirement)から
ru: Из [`ResourceRequirement`](https://www.commonwl.org/v1.0/CommandLineTool.html#ResourceRequirement)
ta: [`ResourceRequirement`](https://www.commonwl.org/v1.0/CommandLineTool.html#ResourceRequirement) இலிருந்து
zh_hans: 来自 [`ResourceRequirement`](https://www.commonwl.org/v1.0/CommandLineTool.html#ResourceRequirement)

source: `coresMin`
ta: `colorsmin`

source: `coresMax`
ta: `colorsmax`

source: `outdirMin`
ta: `வெளிப்புறம்`

source: `outdirMax`
ta: `outtirmax`

source: From [`InitialWorkDirRequirement`](https://www.commonwl.org/v1.0/CommandLineTool.html#InitialWorkDirRequirement)
ja: [`InitialWorkDirRequirement`](https://www.commonwl.org/v1.0/CommandLineTool.html#InitialWorkDirRequirement)から
ru: Из [`InitialWorkDirRequirement`](https://www.commonwl.org/v1.0/CommandLineTool.html#InitialWorkDirRequirement)
ta: [`InitialWorkDirRequirement`](https://www.commonwl.org/v1.0/CommandLineTool.html#InitialWorkDirRequirement) இலிருந்து
zh_hans: 来自 [`InitialWorkDirRequirement`](https://www.commonwl.org/v1.0/CommandLineTool.html#InitialWorkDirRequirement)

source: `listing`
ru: `список`
ta: `பட்டியல்`

source: in [Dirent](https://www.commonwl.org/v1.0/CommandLineTool.html#Dirent)
ja: [Dirent](https://www.commonwl.org/v1.0/CommandLineTool.html#Dirent)に
ru: в [Dirent](https://www.commonwl.org/v1.0/CommandLineTool.html#Dirent)
ta: [Dirent](https://www.commonwl.org/v1.0/CommandLineTool.html#Dirent)இல்
zh_hans: 来自 [Dirent](https://www.commonwl.org/v1.0/CommandLineTool.html#Dirent)

source: `entry`
ru: `вход`
ta: `நுழைவு`

source: From `EnvVarRequirement`
ja: `EnvVarRequirement`から
ru: Из `EnvVarRequirement`
ta: `Envvarrequirement` இலிருந்து
zh_hans: 来自 `EnvVarRequirement`

source: From [EnvironmentDef](https://www.commonwl.org/v1.0/CommandLineTool.html#EnvironmentDef)
ja: [EnvironmentDef](https://www.commonwl.org/v1.0/CommandLineTool.html#EnvironmentDef)から
ru: Из [EnvironmentDef](https://www.commonwl.org/v1.0/CommandLineTool.html#EnvironmentDef)
ta: [EnvironmentDef](https://www.commonwl.org/v1.0/CommandLineTool.html#EnvironmentDef) இலிருந்து
zh_hans: 来自 [EnvironmentDef](https://www.commonwl.org/v1.0/CommandLineTool.html#EnvironmentDef)

source: Using External Libraries and Inline JavaScript Code with `expressionLib`
ja: `expressionLib` による外部ライブラリの利用とインラインJavaScriptコードの利用
ru: Использование внешних библиотек и встроенного кода JavaScript с помощью `expressionLib`
ta: வெளிப்புற நூலகங்கள் மற்றும் இன்லைன் சாவாச்கிரிப்ட் குறியீட்டை `எக்ச்பிரசன் லிப்` உடன் பயன்படுத்துதல்
zh_hans: 通过 `expressionLib` 使用外部库和内联 JavaScript 代码

source: The requirement `InlineJavascriptRequirement` supports an `expressionLib` attribute that allows users to load external JavaScript files, or to provide inline JavaScript code.
ru: Требование `InlineJavascriptRequirement` поддерживает атрибут `expressionLib`, который позволяет пользователям загружать внешние файлы JavaScript или предоставлять встроенный код JavaScript.
ta: `Inlinejavascriptrequirement` தேவை ஒரு` எக்ச்பிரசன் லிப்` பண்புகளை ஆதரிக்கிறது, இது பயனர்களை வெளிப்புற சாவாச்கிரிப்ட் கோப்புகளை ஏற்ற அனுமதிக்கிறது அல்லது இன்லைன் சாவாச்கிரிப்ட் குறியீட்டை வழங்குகிறது.
zh_hans: `InlineJavascriptRequirements` 这一需求支持 `expressionLib` 属性，可以让用户加载外部 JavaScript 文件或提供内联 JavaScript 代码。

source: Entries added to the `expressionLib` attribute are parsed with the JavaScript engine of a CWL runner. This can be used to include external files or to create JavaScript functions that can be called in other parts of the CWL document.
ja: `expressionLib` 属性に追加されたエントリーは、CWLランナーのJavaScriptエンジンで解析されます。これは、外部ファイルをインクルードしたり、CWL定義の他の部分で呼び出すことができるJavaScript関数を作成するために使用することができます。
ru: Записи, добавленные в атрибут `expressionLib`, анализируются JavaScript-движком программы запуска CWL. Это может быть использовано для включения внешних файлов или создания функций JavaScript, которые могут быть вызваны в других частях документа CWL.
ta: `எக்ச்பிரசன் லிப்` பண்புக்கூறில் சேர்க்கப்பட்ட உள்ளீடுகள் ஒரு சி.டபிள்யூ.எல் ரன்னரின் சாவாச்கிரிப்ட் எஞ்சினுடன் பாகுபடுத்தப்படுகின்றன. வெளிப்புற கோப்புகளைச் சேர்க்க அல்லது சி.டபிள்யூ.எல் ஆவணத்தின் பிற பகுதிகளில் அழைக்கக்கூடிய சாவாச்கிரிப்ட் செயல்பாடுகளை உருவாக்க இதைப் பயன்படுத்தலாம்.
zh_hans: 添加到 `expressionLib` 属性的条目将由 CWL 运行程序的 JavaScript 引擎进行语法分析。这可以用来纳入外部文件中的代码，或创建可在 CWL 文件其他部分调用的 JavaScript 函数。

source: The CWL standards (versions 1.0 through 1.2) [states](https://www.commonwl.org/v1.0/CommandLineTool.html#Expressions) that the only version of JavaScript valid in CWL expressions is [ECMAScript 5.1](https://262.ecma-international.org/5.1/). This means that any code that you include or write in your CWL Document must be compliant with ECMAScript 5.1.
ja: CWL標準（バージョン1.0から1.2）は、CWL定義で有効なJavaScriptのバージョンは[ECMAScript 5.1](https://262.ecma-international.org/5.1/)のみであると[明記しています](https://www.commonwl.org/v1.0/CommandLineTool.html#Expressions)。これは、CWLドキュメントに含める、または書くコードは、ECMAScript 5.1に準拠していなければならないことを意味します。
ru: В стандартах CWL (версии 1.0 - 1.2) [указано](https://www.commonwl.org/v1.0/CommandLineTool.html#Expressions), что единственной версией JavaScript, допустимой в выражениях CWL, является [ECMAScript 5.1](https://262.ecma-international.org/5.1/). Это означает, что любой код, который вы включаете или пишете в документе CWL, должен соответствовать ECMAScript 5.1.
ta: CWL தரநிலைகள் (பதிப்புகள் 1.0 முதல் 1.2 வரை) CWL வெளிப்பாடுகளில் செல்லுபடியாகும் ஒரே ஜாவாஸ்கிரிப்ட் பதிப்பு [ECMAScript 5.1](https://262.ecma-international.org/5.1/) [என்று](https://www.commonwl.org/v1.0/CommandLineTool.html#Expressions) கூறுகிறது. சி.டபிள்யூ.எல். இதன் பொருள் உங்கள் சி.டபிள்யூ.எல் ஆவணத்தில் நீங்கள் உள்ளடக்கிய அல்லது எழுதும் எந்த குறியீடும் எக்மாச்கிரிப்ட் 5.1 உடன் இணக்கமாக இருக்க வேண்டும்.
zh_hans: 版本 1.0 到 1.2 的 CWL 标准中[写道](https://www.commonwl.org/v1.0/CommandLineTool.html#Expressions)，在 CWL 表达式中唯一有效的 JavaScript 版本是 [ECMAScript 5.1](https://262.ecma-international.org/5.1/) . 也就是说，在 CWL 文件中纳入或写入的所有 JS 代码都必须符合该版本。

source: For example, we can use `InlineJavascriptRequirement` and write a JavaScript function inline in `expressionLib`. That function can then be used in other parts of the CWL document:
ja: 例えば、`InlineJavascriptRequirement` を使って、`expressionLib` に JavaScript 関数をインラインで記述することができます。その関数は、CWL定義の他の部分で使用することができます：
ru: Например, мы можем использовать `InlineJavascriptRequirement` и записать функцию JavaScript в строку в `expressionLib`. Затем эта функция может быть использована в других частях документа CWL:
ta: எடுத்துக்காட்டாக, நாம் `inlinejavascriptrequirement` ஐப் பயன்படுத்தலாம் மற்றும்` எக்ச்பிரசன் லிப்` இல் சாவாச்கிரிப்ட் செயல்பாட்டை எழுதலாம். அந்த செயல்பாட்டை சி.டபிள்யூ.எல் ஆவணத்தின் பிற பகுதிகளில் பயன்படுத்தலாம்:
zh_hans: 例如，我们可以使用 `InlineJavascriptRequirements`, 在 `expressionLib` 下编写内联 JavaScript 函数，让它能在 CWL 文件其他部分调用：

source: `hello-world-expressionlib-inline.cwl`
ta: `அலோ-வேர்ல்ட்-எக்ச்பிரசன் லிப்-இன்லைன்.ச்விஎல்`

source: Running this CWL workflow will invoke the JavaScript function and result in the `echo` command printing the input message with capital initial letters:
ja: このCWLワークフローを実行すると、JavaScript関数が起動し、`echo` コマンドが入力メッセージの頭文字を大文字にして表示します：
ru: Запуск этого рабочего процесса CWL вызовет функцию JavaScript и приведет к тому, что команда `echo` напечатает входное сообщение с заглавными буквами:
ta: இந்த சி.டபிள்யூ.எல் பணிப்பாய்வுகளை இயக்குவது சாவாச்கிரிப்ட் செயல்பாட்டைக் கோரும், இதன் விளைவாக `எதிரொலி` கட்டளை மூலதன ஆரம்ப எழுத்துக்களுடன் உள்ளீட்டு செய்தியை அச்சிடுகிறது:
zh_hans: 运行此 CWL 工作流将调用这个 JavaScript 函数，使得 `echo` 命令以大写首字母排印输入的“报文”：

source: Running `hello-world-expressionlib-inline.cwl`.
ru: Запуск `hello-world-expressionlib-inline.cwl`.
ta: `அலோ-வேர்ல்ட்-எக்ச்பிரசன் லிப்-இன்லைன்.ச்விஎல்` இயக்குகிறது.
zh_hans: 运行 `hello-world-expressionlib-inline.cwl`.

source: Let's move the `capitalizeWords` function to an external file, `custom-functions.js`, and import it in our CWL document:
ja: `capitalizeWords` 関数を外部ファイル`custom-functions.js` に移動し、CWL 定義でインポートしてみましょう：
ru: Давайте перенесем функцию `capitalizeWords` во внешний файл, `custom-functions.js`, и импортируем ее в наш CWL-документ:
ta: `மூலதன சொற்கள்` செயல்பாட்டை வெளிப்புறக் கோப்பிற்கு,` தனிப்பயன்-செயல்பாடுகள். Js` க்கு நகர்த்துவோம், அதை எங்கள் CWL ஆவணத்தில் இறக்குமதி செய்வோம்:
zh_hans: 我们来将 `capitalizeWords` 函数移动到外部文件 `custom-functions.js`, 并将它导入我们的 CWL 文件：

source: `custom-functions.js`
ta: `தனிப்பயன்-செயல்பாடுகள். js`

source: `hello-world-expressionlib-external.cwl`
ta: `அலோ-வேர்ல்ட்-எக்ச்பிரசன் லிப்-எக்ச்டெர்னல்.ச்விஎல்`

source: The `custom-functions.js` file is included in the CWL document with the `$include: custom-functions.js` statement. That makes the functions and variables available to be used in other parts of the CWL document.
ja: `custom-functions.js` ファイルは、`$include: custom-functions.js` という記述でCWL定義に含まれます。これにより、関数と変数がCWL定義の他の部分で使用できるようになります。
ru: Файл `custom-functions.js` включается в документ CWL с помощью оператора `$include: custom-functions.js`. Это делает функции и переменные доступными для использования в других частях документа CWL.
ta: `Custom-functions.js` கோப்பு CWL ஆவணத்தில்` $ உடன் சேர்க்கப்பட்டுள்ளது: தனிப்பயன்-செயல்பாடுகள். JS` அறிக்கை. இது சி.டபிள்யூ.எல் ஆவணத்தின் பிற பகுதிகளில் பயன்படுத்த செயல்பாடுகள் மற்றும் மாறிகள் கிடைக்கச் செய்கிறது.
zh_hans: 文件 `custom-functions.js` 通过 `$include: custom-functions.js` 语句纳入到这个 CWL 文件里，使这个 JavaScript 文件中定义的函数和变量可在 CWL 文件其他部分使用。

source: Running `hello-world-expressionlib-external.cwl`.
ja: `hello-world-expressionlib-external.cwl`実行しています。
ru: Запускаем `hello-world-expressionlib-external.cwl`.
ta: இயங்கும் `அலோ-வேர்ல்ட்-எக்ச்பிரசன் லிப்-எக்ச்டெர்னல்.ச்விஎல்`.
zh_hans: 运行 `hello-world-expressionlib-external.cwl`.

source: Finally, note that you can have both inline and external JavaScript code in your CWL document. In this final example we have added another entry to the `expressionLib` attribute with the new function `createHelloWorldMessage`, that calls the `capitalizeWords` function from the external file `custom-functions.js`.
ja: 最後に、CWL定義にはインラインと外部JavaScriptコードの両方が存在できることに注意してください。この最後の例では、`expressionLib` 属性に、新しい関数`createHelloWorldMessage` を追加しました。この関数は、外部ファイル`custom-functions.js` から`capitalizeWords` 関数を呼び出しています。
ru: Наконец, обратите внимание, что в документе CWL может присутствовать как встроенный, так и внешний код JavaScript. В этом последнем примере мы добавили еще одну запись в атрибут `expressionLib` с новой функцией `createHelloWorldMessage`, которая вызывает функцию `capitalizeWords` из внешнего файла `custom-functions.js`.
ta: இறுதியாக, உங்கள் CWL ஆவணத்தில் இன்லைன் மற்றும் வெளிப்புற சாவாச்கிரிப்ட் குறியீடு இரண்டையும் வைத்திருக்க முடியும் என்பதை நினைவில் கொள்க. இந்த இறுதி எடுத்துக்காட்டில், `எக்ச்பிரசன் லிப்` பண்புக்கூறுக்கு புதிய செயல்பாடு` கிரியேட்டிவெல்லோஆர்ல்ட்மெசேச்` உடன் மற்றொரு நுழைவைச் சேர்த்துள்ளோம், இது வெளிப்புறக் கோப்பிலிருந்து `தனிப்பயன்-செயல்பாடுகள். சே.எச்.
zh_hans: 最后请注意，CWL 文件中可以同时运用内联和外部 JavaScript 代码。下面是最后一个例子，这里我们向 `expressionLib` 属性中加入新函数 `createHelloWorldMessage`, 调用外部文件 `custom-functions.js` 中的 `capitalizeWords` 函数。

source: `hello-world-expressionlib.cwl`
ta: `அலோ-வேர்ல்ட்-எக்ச்பிரசன் லிப்.ச்விஎல்`

source: Running `hello-world-expressionlib.cwl`.
ja: `hello-world-expressionlib.cwl`を実行する。
ru: Запуск `hello-world-expressionlib.cwl`.
ta: `அலோ-வேர்ல்ட்-எக்ச்பிரசன் லிப்.ச்விஎல்` இயங்கும்.
zh_hans: 运行 `hello-world-expressionlib.cwl`.

source: The `$include` statement can be used to include a file from the local disk or from a remote location. It works with both relative and absolute paths. Read the [text about `$include`](https://www.commonwl.org/v1.0/SchemaSalad.html#Include) from the CWL specification to learn more about it.
ja: `$include` ステートメントを使用すると、ローカルディスクまたはリモートロケーションからファイルをインクルードすることができます。相対パスと絶対パスの両方で動作します。CWL仕様の[`$include`について](https://www.commonwl.org/v1.0/SchemaSalad.html#Include)を読むと、より詳しく知ることができます。
ru: Оператор `$include` можно использовать для включения файла с локального диска или из удаленного места. Он работает как с относительными, так и с абсолютными путями. Прочитайте [текст о `$include`](https://www.commonwl.org/v1.0/SchemaSalad.html#Include) из спецификации CWL, чтобы узнать о нем больше.
ta: உள்ளக வட்டில் இருந்து அல்லது தொலைதூர இடத்திலிருந்து ஒரு கோப்பைச் சேர்க்க `$include` அறிக்கை பயன்படுத்தப்படலாம். இது உறவினர் மற்றும் முழுமையான பாதைகளுடன் செயல்படுகிறது. சி.டபிள்யூ.எல் விவரக்குறிப்பிலிருந்து அதைப் பற்றி மேலும் அறிய CWL விவரக்குறிப்பிலிருந்து [`$include` அடங்கும்](https://www.commonwl.org/v1.0/SchemaSalad.html#Include).
zh_hans: `$include` 语句可以用来添加位于本地或远程的文件，并且接受相对路径和绝对路径。详情请参见 CWL 规约中[关于 `$include`](https://www.commonwl.org/v1.0/SchemaSalad.html#Include) 的内容。

source: File Formats
ja: ファイルフォーマット
ru: Форматы файлов
ta: கோப்பு வடிவங்கள்
zh_hans: 文件格式

source: Tools and workflows can take `File` types as input and produce them as output. We also recommend indicating the format for `File` types. This helps document for others how to use your tool while allowing you to do some simple type-checking when creating parameter files.
ru: Инструменты и рабочие процессы могут принимать типы `File` на вход и выдавать их на выход. Мы также рекомендуем указывать формат типов `File`. Это поможет задокументировать другим, как использовать ваш инструмент, а вам позволит выполнить простую проверку типов при создании файлов параметров.
ta: கருவிகள் மற்றும் பணிப்பாய்வுகள் `கோப்பு` வகைகளை உள்ளீடாக எடுத்து அவற்றை வெளியீடாக உருவாக்கலாம். `கோப்பு` வகைகளுக்கான வடிவமைப்பைக் குறிக்க பரிந்துரைக்கிறோம். அளவுரு கோப்புகளை உருவாக்கும்போது சில எளிய வகை சரிபார்ப்பைச் செய்ய உங்களை அனுமதிக்கும் போது உங்கள் கருவியை எவ்வாறு பயன்படுத்துவது என்பது மற்றவர்களுக்கு ஆவணப்படுத்த உதவுகிறது.
zh_hans: `File` 类型既可作为工具和工作流的输入，也可以成为它们生成的输出。另外，我们建议指明 `File` 类型的格式，以便向他人说明您的工具如何使用，同时还能让您在创建参数文件时进行简单的类型检验。

source: For file formats, we recommend referencing existing ontologies (like EDAM in our example), reference a local ontology for your institution, or do not add a file format initially for quick development before sharing your tool with others. You can browse existing [IANA file format listings][IANA] and [EDAM file format listings][EDAM] on their websites.
ja: ファイルフォーマットについては、既存のオントロジーを参照すること（例ではEDAM）、所属機関のローカルオントロジーを参照すること、またはツールを他者と共有する前に迅速に開発するために最初はファイルフォーマットを追加しないことを推奨しています。既存の[IANAファイルフォーマット一覧][IANA]と[EDAMファイルフォーマット一覧][EDAM]は、それぞれのウェブサイトで参照することができます。
ru: В отношении форматов файлов мы рекомендуем ссылаться на существующие онтологии (например, EDAM в нашем примере), ссылаться на локальную онтологию вашего учреждения или не добавлять формат файла изначально, чтобы быстро разработать его, прежде чем предоставлять свой инструмент другим. Вы можете просмотреть существующие списки [IANA file format listings][IANA] и [EDAM file format listings][EDAM] на их веб-сайтах.
ta: கோப்பு வடிவங்களுக்கு, ஏற்கனவே உள்ள ஆன்டாலசிகளைக் குறிப்பிட பரிந்துரைக்கிறோம் (எங்கள் எடுத்துக்காட்டில் எடாம் போன்றவை), உங்கள் நிறுவனத்திற்கான உள்ளக ஆன்டாலசியைக் குறிப்பிடவும் அல்லது உங்கள் கருவியை மற்றவர்களுடன் பகிர்வதற்கு முன்பு விரைவான மேம்பாட்டிற்காக ஆரம்பத்தில் ஒரு கோப்பு வடிவமைப்பைச் சேர்க்க வேண்டாம். ஏற்கனவே உள்ள [IANA கோப்பு வடிவமைப்பு பட்டியல்கள்] [IANA] மற்றும் [EDAM கோப்பு வடிவமைப்பு] [EDAM] ஆகியவற்றை அவர்களின் வலைத்தளங்களில் உலாவலாம்.
zh_hans: 对于文件格式，我们建议参考现有本体（如示例中的 EDAM）或您所在机构内部使用的本体，不然，则在与他人共享工具之前不要先添加文件格式，以便快速开发。您可以通过网站浏览现有的 [IANA][IANA] 和 [EDAM 文件格式列表][EDAM]。

source: In the next tutorial, we explain the `$namespaces` and `$schemas` section of the document in greater detail, so don't worry about these for now.
ja: 次のチュートリアルで、`$namespaces` と`$schemas` の部分をより詳しく説明しますので、今は気にしないでください。
ru: В следующем уроке мы более подробно расскажем о разделах `$namespaces` и `$schemas`, так что пока не беспокойтесь об этом.
ta: அடுத்த டுடோரியலில், ஆவணத்தின் `$ பெயர்வெளிகள்` மற்றும்` $ ச்கேமாச்` பகுதியை இன்னும் விரிவாக விளக்குகிறோம், எனவே இப்போதைக்கு இதைப் பற்றி கவலைப்பட வேண்டாம்.
zh_hans: 我们将在下一篇教程中更详细地解释文件中的 `$namespaces` 和 `$schemas` 部分，眼下无需为此分心。

source: Note that for added value `cwltool` can do some basic reasoning based on file formats and warn you if there seem to be some obvious mismatches.
ja: なお、さらなる利点として`cwltool` は、ファイル形式に基づく基本的な推論を行い、明らかな不一致があるようであれば警告を発します。
ru: Обратите внимание, что для дополнительной пользы `cwltool` может выполнять некоторые базовые рассуждения на основе форматов файлов и предупреждать вас, если есть очевидные несоответствия.
ta: கூடுதல் மதிப்புக்கு `cwltool` கோப்பு வடிவங்களின் அடிப்படையில் சில அடிப்படை பகுத்தறிவுகளைச் செய்யலாம் மற்றும் சில வெளிப்படையான பொருந்தாத தன்மைகள் இருப்பதாகத் தோன்றினால் உங்களை எச்சரிக்கலாம்.
zh_hans: 请注意， `cwltool` 有一项附加功能，即依据文件格式做一些初步推断，一旦出现较明显的不匹配则发出警告。

source: The equivalent of this CWL description in command line format is:
ja: このCWL定義に相当するものをコマンドライン形式にすると:
ru: Эквивалентом этого описания CWL в формате командной строки является:
ta: கட்டளை வரி வடிவத்தில் இந்த சி.டபிள்யூ.எல் விளக்கத்திற்கு சமம்:
zh_hans: 这一 CWL 描述的等效命令行形式为：

source: Sample Parameter Files
ja: サンプルパラメーターファイル
ru: Образцы файлов параметров
ta: மாதிரி அளவுரு கோப்புகள்
zh_hans: 参数文件样本

source: Below is an example of a parameter file for the example above. We encourage checking in working examples of parameter files for your tool. This allows others to quickly work with your tool, starting from a "known good" parameterization.
ru: Ниже приведен пример файла параметров для приведенного выше примера. Мы рекомендуем присылать рабочие примеры файлов параметров для вашего инструмента. Это позволит другим быстро работать с вашим инструментом, начиная с "заведомо хорошей" параметризации.
ta: மேலே உள்ள எடுத்துக்காட்டுக்கு ஒரு அளவுரு கோப்பின் எடுத்துக்காட்டு கீழே. உங்கள் கருவிக்கான அளவுரு கோப்புகளின் வேலை எடுத்துக்காட்டுகளைச் சரிபார்க்க நாங்கள் ஊக்குவிக்கிறோம். இது "அறியப்பட்ட நல்ல" அளவுருவாக்கத்திலிருந்து தொடங்கி, உங்கள் கருவியுடன் விரைவாக வேலை செய்ய மற்றவர்கள் அனுமதிக்கிறது.
zh_hans: 以上例子的样本参数文件见下。我们提倡为您的工具加入经您测试可用的参数文件样例，这将帮助他人从做好的“合格品”参数文件入手，更快地上手操作您的工具。

source: `sample.yml`
ta: `மாதிரி.ஒய்எம்எல்`

source: ___Note:___ To follow the example below, you need to download the example input file, *file-formats.bam*. The file is available from <https://github.com/common-workflow-language/user_guide/raw/main/src/_includes/cwl/file-formats/file-formats.bam> and can be downloaded e.g. via `wget`:
ru: ___Примечание:___ Чтобы выполнить приведенный ниже пример, необходимо загрузить входной файл примера, *file-formats.bam*. Этот файл доступен по адресу <https://github.com/common-workflow-language/user_guide/raw/main/src/_includes/cwl/file-formats/file-formats.bam> и может быть загружен, например, с помощью `wget`:
ta: ___ குறிப்பு: ___ கீழே உள்ள எடுத்துக்காட்டைப் பின்பற்ற, நீங்கள் எடுத்துக்காட்டு உள்ளீட்டு கோப்பை பதிவிறக்கம் செய்ய வேண்டும், *கோப்பு-வடிவங்கள் .பாம் *. கோப்பு <https://github.com/common-workflow-language/user_guide/raw/main/src/_includes/cwl/file-formats/file-formats.bam> இலிருந்து கிடைக்கிறது, மேலும் பதிவிறக்கம் செய்யலாம் எ.கா. `wget` வழியாக:
zh_hans: ___注意：___ 按照下例演练前，您需要先下载示例输入文件 *file-formats.bam*. 该文件位于 <https://github.com/common-workflow-language/user_guide/raw/main/src/_includes/cwl/file-formats/file-formats.bam>, 可以用 `wget` 等工具下载：

source: Topics
ja: トピックス
ru: Темы
ta: தலைப்புகள்
zh_hans: 主题

source: Inputs
ru: Входы
ta: உள்ளீடுகள்
zh_hans: 输入 (inputs)

source: Essential Input Parameters
ja: 必須入力パラメータ
ru: Основные входные параметры
ta: அத்தியாவசிய உள்ளீட்டு அளவுருக்கள்
zh_hans: 基本输入参数

source: The `inputs` of a tool is a list of input parameters that control how to run the tool. Each parameter has an `id` for the name of parameter, and `type` describing what types of values are valid for that parameter.
ru: В `входах` инструмента содержится список входных параметров, которые определяют, как запустить инструмент. Каждый параметр имеет `id` для названия параметра и `type`, описывающий, какие типы значений допустимы для этого параметра.
ta: ஒரு கருவியின் `உள்ளீடுகள்` கருவியை எவ்வாறு இயக்குவது என்பதைக் கட்டுப்படுத்தும் உள்ளீட்டு அளவுருக்களின் பட்டியல். ஒவ்வொரு அளவுருவிலும் அளவுருவின் பெயருக்கு `ஐடி` உள்ளது, மேலும் அந்த அளவுருவுக்கு எந்த வகையான மதிப்புகள் செல்லுபடியாகும் என்பதை விவரிக்கிறது.
zh_hans: 工具的 `inputs`（输入）用于列出控制工具运行方式的输入参数。每个参数都包含 `id` 字段作为名称，以及 `type` 字段描述有效参数值的类型。

source: Available primitive types are *string*, *int*, *long*, *float*, *double*, and *null*; complex types are *array* and *record*; in addition there are special types *File*, *Directory* and *Any*.
ru: Доступные примитивные типы - *string*, *int*, *long*, *float*, *double* и *null*; сложные типы - *array* и *record*; кроме того, есть специальные типы *File*, *Directory* и *Any*.
ta: கிடைக்கக்கூடிய பழமையான வகைகள் *சரம் *, *எண்ணாக *, *நீண்ட *, *மிதவை *, *இரட்டை *, மற்றும் *பூச்ய *; சிக்கலான வகைகள் *வரிசை *மற்றும் *பதிவு *; கூடுதலாக சிறப்பு வகைகள் *கோப்பு *, *அடைவு *மற்றும் *ஏதேனும் *உள்ளன.
zh_hans: 可用的原始类型有 *string*（字符串）、 *int*（整型）、*long*（长整型）、 *float*（浮点数）、*double*（双精度浮点数）以及 *null*（空）等；复合类型指的是 *array*（数组）和 *record*（记录）；此外还有特殊类型 *File*（文件）、*Directory*（目录）以及 *Any*（任意）等。

source: The following example demonstrates some input parameters with different types and appearing on the command line in different ways.
ja: 次の例では、異なる型の入力パラメーターが、異なる方法でコマンドライン上に表示されることを示します。
ru: Следующий пример демонстрирует некоторые входные параметры, имеющие различные типы и по-разному отображающиеся в командной строке.
ta: பின்வரும் எடுத்துக்காட்டு வெவ்வேறு வகைகளுடன் சில உள்ளீட்டு அளவுருக்களை நிரூபிக்கிறது மற்றும் கட்டளை வரியில் வெவ்வேறு வழிகளில் தோன்றும்.
zh_hans: 下面的例子展示了一些类型各异、以不同方式出现在命令行上的输入参数。

source: First, create a file called `inp.cwl`, containing the following:
ja: まず、以下の内容を含む`inp.cwl` というファイルを作成します：
ru: Сначала создайте файл `inp.cwl`, содержащий следующее:
ta: முதலில், பின்வருவனவற்றைக் கொண்ட `inp.cwl` என்ற கோப்பை உருவாக்கவும்:
zh_hans: 首先，创建一个名为 `inp.cwl` 的文件，包含以下内容：

source: Create a file called `inp-job.yml`:
ja: `inp-job.yml` というファイルを作成します：
ru: Создайте файл с именем `inp-job.yml`:
ta: `Inp-job.yml` என்ற கோப்பை உருவாக்கவும்:
zh_hans: 创建名为 `inp-job.yml` 的文件：

source: You can use `cwltool` to create a template input object. That saves you from having to type all the input parameters in a input object file:
ru: Вы можете использовать `cwltool` для создания шаблонного объекта ввода. Это избавит вас от необходимости вводить все входные параметры в файл объекта ввода:
ta: வார்ப்புரு உள்ளீட்டு பொருளை உருவாக்க நீங்கள் `CWLTool` ஐப் பயன்படுத்தலாம். உள்ளீட்டு பொருள் கோப்பில் அனைத்து உள்ளீட்டு அளவுருக்களையும் தட்டச்சு செய்வதிலிருந்து உங்களை காப்பாற்றுகிறது:
zh_hans: 您可以用 `cwltool` 创建模板输入对象，以省去在输入对象文件中一一键入输入参数：

source: You can redirect the output to a file, i.e. `cwltool --make-template inp.cwl > inp-job.yml`, and then modify the default values with your desired input values.
ja: `cwltool --make-template inp.cwl > inp-job.yml` のように、出力をファイルにリダイレクトします。その後デフォルト値を希望の入力値で修正することができます。
ru: Вы можете перенаправить вывод в файл, например, `cwltool --make-template inp.cwl > inp-job.yml`, а затем изменить значения по умолчанию на нужные вам входные значения.
ta: நீங்கள் வெளியீட்டை ஒரு கோப்பிற்கு திருப்பி விடலாம், அதாவது `cwltool --make-template inp.cwl> inp-job.yml`, பின்னர் இயல்புநிலை மதிப்புகளை நீங்கள் விரும்பிய உள்ளீட்டு மதிப்புகளுடன் மாற்றலாம்.
zh_hans: 您可将输出重定向到一个文件：`cwltool --make-template inp.cwl &gt; inp-job.yml`，然后将生成的默认值改为您想要的输入值。
