Repository: common-workflow-language/user_guide
Catalog: locales/*/LC_MESSAGES/user_guide.po
Languages: ja, ru, ta, zh_hans

source: In tool descriptions, include a list of version(s) of the tool that are known to work with this description under [`SoftwareRequirement`](https://w3id.org/cwl/CommandLineTool.html#SoftwareRequirement).
ja: ツール定義では、[`SoftwareRequirement`](https://w3id.org/cwl/CommandLineTool.html#SoftwareRequirement)の下に、このツール定義で動作することが確認されているツールのバージョンのリストを書きます。

source: Each [`CommandLineTool`](https://w3id.org/cwl/CommandLineTool.html#CommandLineTool) description should focus on a single operation only, even if the (sub)command is capable of more. Don't overcomplicate your tool descriptions with options that you don't need or use.
ja: 各[`CommandLineTool`](https://w3id.org/cwl/CommandLineTool.html#CommandLineTool) の定義は、たとえ（サブ）コマンドがそれ以上の機能を備えていたとしても、一つの使用方法のみに焦点を当てるべきです。必要ないまたは、使用しないオプションでツールの定義を複雑にし過ぎないようにしましょう。

source: This indicates whether a process requires outgoing IPv4/IPv6 network access. Starting with CWL v1.1, programs are not granted network access by default, so you must include the requirement for network access in the specification of your tool.
ja: これは、プロセスが送信先としてIPv4/IPv6ネットワーク・アクセスを必要とするかどうかを示します。 CWL v1.1以降、プログラムにはデフォルトでネットワーク・アクセス権が付与されないため、ツール定義にネットワーク・アクセスの要件を含める必要があります。

source: Note also that the author of this CWL description has also included [`ResourceRequirement`](https://w3id.org/cwl/CommandLineTool.html#ResourceRequirement)s, specifying the minimum amount of RAM and number of cores required for the tool to run successfully, as well as details of the version of the software that the description was written for and other useful metadata. These features are discussed further in other chapters of this user guide.
ja: また、この CWL 定義には、[`ResourceRequirement`](https://w3id.org/cwl/CommandLineTool.html#ResourceRequirement)も含まれていることに注意してください。これは、ツールが正常に動作するために必要な最小限の RAM の量とコアの数、さらにその定義に書かれたソフトウェアのバージョンの詳細やその他の有用なメタデータを指定するものです。これらの機能については、このユーザーガイドの他の章で詳しく説明します。

source: Similar to the command-line tool it requires `inputs` and `outputs`. But instead of `baseCommand`, it requires an [`expression`](https://w3id.org/cwl/CommandLineTool.html#Expressions_(Optional)) attribute.
ja: CommandLinetToolと同様に、`inputs` と`outputs` が必要です。しかし、`baseCommand` の代わりに、[`expression`](https://w3id.org/cwl/CommandLineTool.html#Expressions_(Optional)) 属性を必要とします。

source: We had to use an [`InlineJavascriptRequirement`](https://w3id.org/cwl/CommandLineTool.html#InlineJavascriptRequirement) as our expression contains a JavaScript call in `.toUpperCase()`. This means to tools using the expression tool that JavaScript is a requirement.
ja: この式には`.toUpperCase()` で JavaScript の呼び出しが含まれているため、 [`InlineJavascriptRequirement`](https://w3id.org/cwl/CommandLineTool.html#InlineJavascriptRequirement) を使用する必要があります。これは、ExpressionToolを使用するツールにとって、JavaScriptが必要であることを意味します。

source: If you need to manipulate input parameters, include the requirement [`InlineJavascriptRequirement`](https://w3id.org/cwl/CommandLineTool.html#InlineJavascriptRequirement) and then anywhere a parameter reference is legal you can provide a fragment of Javascript that will be evaluated by the CWL runner.
ja: 入力パラメータを操作する必要がある場合は、[`InlineJavascriptRequirement`](https://w3id.org/cwl/CommandLineTool.html#InlineJavascriptRequirement) を含めると、パラメータ参照が合法な場所であれば、CWL runnerによって評価されるJavascriptを使用できます。

source: From [`Workflow`](https://w3id.org/cwl/Workflow.html)
ja: [`Workflow`](https://w3id.org/cwl/Workflow.html)から

source: The requirement [`InlineJavascriptRequirement`](https://w3id.org/cwl/CommandLineTool.html#InlineJavascriptRequirement) supports an `expressionLib` attribute that allows users to load external JavaScript files, or to provide inline JavaScript code.
ja: [`InlineJavascriptRequirement`](https://w3id.org/cwl/CommandLineTool.html#InlineJavascriptRequirement)は、`expressionLib` 属性をサポートし、ユーザーが外部 JavaScript ファイルを読み込んだり、インライン JavaScript コードを提供したりできるようにします。

source: Tools and workflows can take [`File`](https://w3id.org/cwl/CommandLineTool.html#File) types as input and produce them as output. We also recommend indicating the format for [`File`](https://w3id.org/cwl/CommandLineTool.html#File) types. This helps document for others how to use your tool while allowing you to do some simple type-checking when creating parameter files.
ja: ToolsやWorkflowsは、[`File`](https://w3id.org/cwl/CommandLineTool.html#File) 型を入力として受け取り、出力として生成することができます。また、[`File`](https://w3id.org/cwl/CommandLineTool.html#File) タイプのフォーマットを示すことをお勧めします。これにより、ツールの使用方法を他の人に示すことができ、また、パラメータファイルを作成する際に簡単な型チェックを行うことができるようになります。

source: Available primitive types are *string*, *boolean*, *int*, *long*, *float*, *double*, and *null*; complex types are *array* and *record*; in addition there are special types *File*, *Directory* and *Any*.
ja: 利用可能なプリミティブ型は*string*,*int*,*long*,*float*,*double*, *null*; 複合型は*array*と*record*; さらに特殊型*File*,*Directory* ,*Any* があります。

source: You can use `cwltool` to create a template input object. That saves you from having to type all the input parameters in an input object file:
ja: `cwltool` を使って、テンプレートとなる入力オブジェクトを作成することができます。これにより、入力オブジェクトファイルにすべての入力パラメータを入力する手間を省くことができます：

source: If you use exclusive input parameters and reference them in expressions, you need to be aware that the `inputs` JavaScript object will contain one of the possible, mutually-exclusive input values. Because the types of these exclusive values may differ, you may need to check which type is in use when you reference the properties of the `input` object.
ja: 排他的入力パラメータを式と組み合わせて使用する場合、JavaScript オブジェクトの`inputs` に排他的入力値のいずれかが含まれることを意識する必要があります。つまり、**or** のブーリアン演算子を使用して、`inputs`にどの値が存在するかをチェックする必要がある場合があります。

source: Note how the JavaScript expression uses the value of the exclusive input parameter without taking into consideration a `null` value. If you provide a valid value, such as `fasta` (one of the possible values of the enum), your command should execute successfully:
ja: JavaScriptの式では、`null` の値を考慮せずに、排他的入力パラメータの値を使用していることに注意してください。`fasta`（enumの値の1つ）のような有効な値を指定すると、コマンドは正常に実行されるはずです：

source: Here, the boolean “or” operator `||` in JavaScript is used for its _short-circuiting_ property. If `inputs.file_format` is “true” in a boolean context (e.g. a valid non-empty string from the enum), the evaluation of the expression stops at the first operand of `||`; it “short-circuits”. If however `inputs.file_format` is `null`, the whole expression’s value becomes that of the second operand, which is why a reasonable default can be provided there.
ja: ここでは、JavaScriptのブール値 "or"、 "演算子 `||` は、その_short-circuiting_プロパティに使用されます。`inputs.file_format`がブール値の "true"である場合（例えば、列挙された有効な空でない文字列）、式の評価は `||`の最初のオペランドで停止します。しかし、 `inputs.file_format`が`null`の場合、式全体の値は2番目のオペランドの値になります。これにより合理的なデフォルト値を提供します。

source: The `uppercase` step of the workflow is an operation. It can appear where a command line tool or an expression is expected. You can also plot it with the CWL Viewer or `cwltool`:
ja: ワークフローの`uppercase` ステップは Operation です。CommandLineToolやExpressionToolのように使用することができます。また、CWL Viewerや`cwltool` を使って可視化することもできます：

source: The output of the command above can be rendered with a Graphviz renderer. The following image is rendered with the Sphinx `{graphviz}` directive (this user guide is built with Sphinx):
ja: 上記のコマンドの出力は、Graphvizを使ってレンダリングすることができます。以下の画像は、SphinxのGraphvizディレクティブでレンダリングしたものです（このユーザーガイドはSphinxで構築されています）：

source: The operation file will fail to run with `cwltool` because `cwltool` lacks the necessary information to execute it:
ja: operation ファイルを `cwltool` で実行しようとすると、`cwltool` が実行に必要な情報を持っていないため、失敗します：

source: In previous examples, the `baseCommand` was just a string, with any arguments passed as CWL inputs. Instead of a single string, we can use an _array of strings_ as the value of `baseCommand`. The first element of the array is the command to run, and any subsequent elements are mandatory command line arguments
ja: これまでの例では、`baseCommand` は単なる文字列で、引数はCWL入力として渡していました。単一の文字列の代わりに、_文字列の配列_ を使用することができます。 配列の最初の要素は実行するコマンドで、それ以降の要素は必須のコマンドライン引数です

source: The field [`outputBinding`](https://w3id.org/cwl/CommandLineTool.html#CommandOutputBinding) describes how to set the value of each output parameter.
ja: [`outputBinding`](https://w3id.org/cwl/CommandLineTool.html#CommandOutputBinding) フィールドには、各出力パラメータの値の設定方法が記述されています。

source: The [`glob`](https://w3id.org/cwl/CommandLineTool.html#CommandOutputBinding) field consists of the pattern to match file names in the output directory. This can simply be the file's exact name. But if you don't know the name of the file in advance, you can use a wildcard pattern like `glob: '*.txt'`.
ja: [`glob`](https://w3id.org/cwl/CommandLineTool.html#CommandOutputBinding) フィールドは、出力ディレクトリ内のファイル名で構成されます。前もって出力ファイル名が分からない場合は、`glob: '*.txt'` のようにワイルドカードパターンを使用することができます。

source: Before we run this, let's just break it down and see what some bits do. Most of this has been explained in previous sections, the only part that is really new is the [`dockerRequirement`](https://w3id.org/cwl/CommandLineTool.html#DockerRequirement) section.
ja: これを実行する前に、これを分解して、いくつか細かく何をするのかを見てみましょう。 この大部分は以前のセクションで説明したもので、本当に新しいのは[`dockerRequirement`](https://w3id.org/cwl/CommandLineTool.html#DockerRequirement) の部分だけです。
