Repository: common-workflow-language/user_guide
Catalog: locales/*/LC_MESSAGES/user_guide.po
Languages: ja, ru, ta, zh_hans

source: This two-step workflow starts with the `create-tar` step which is connected to the `compile` step in orange; `compile` is another workflow, diagrammed on the right. In purple we see the fixed string `"Hello.java"` being supplied as the `name_of_file_to_extract`.
ja: この2ステップのワークフローは、`create-tar` ステップから始まり、オレンジ色の`compile` ステップに接続されています。`compile` は、右図にある別のワークフローです。紫色では、固定文字列`"Hello.java"` が`name_of_file_to_extract` として与えられているのがわかります。
ru: Этот двухэтапный рабочий процесс начинается с шага `create-tar`, который связан с шагом `compile` оранжевым цветом; `compile` - это другой рабочий процесс, показанный на диаграмме справа. В фиолетовом цвете мы видим фиксированную строку `"Hello.java"`, предоставляемую в качестве `имени_файла_для_извлечения`.
ta: இந்த இரண்டு-படி பணிப்பாய்வு `கிரியேட்-டார்` படியுடன் தொடங்குகிறது, இது ஆரஞ்சில்` தொகுத்தல்` படியுடன் இணைக்கப்பட்டுள்ளது; `தொகுத்தல்` என்பது மற்றொரு பணிப்பாய்வு, வலதுபுறத்தில் வரைபடமாக்கப்படுகிறது. ஊதா நிறத்தில் `" அலோ.சாவா "` `Name_of_file_to_extract` என வழங்கப்படுவதைக் காண்கிறோம்.

source: <a href="https://view.commonwl.org/workflows/github.com/common-workflow-language/user_guide/blob/main/_includes/cwl/workflows/nestedworkflows.cwl"><img src="https://view.commonwl.org/graph/svg/github.com/common-workflow-language/user_guide/blob/main/_includes/cwl/workflows/nestedworkflows.cwl" alt="Visualization of nestedworkflows.cwl" /></a> <a href="https://view.commonwl.org/workflows/github.com/common-workflow-language/user_guide/blob/main/_includes/cwl/workflows/1st-workflow.cwl"><img src="https://view.commonwl.org/graph/svg/github.com/common-workflow-language/user_guide/blob/main/_includes/cwl/workflows/1st-workflow.cwl" alt="Visualization of 1st-workflow.cwl" /></a>
ru: <a href="https://view.commonwl.org/workflows/github.com/common-workflow-language/user_guide/blob/main/_includes/cwl/workflows/nestedworkflows.cwl"><img src="https://view.commonwl.org/graph/svg/github.com/common-workflow-language/user_guide/blob/main/_includes/cwl/workflows/nestedworkflows.cwl" alt="Визуализация вложенных рабочих процессов.cwl" /></a> <a href="https://view.commonwl.org/workflows/github.com/common-workflow-language/user_guide/blob/main/_includes/cwl/workflows/1st-workflow.cwl"><img src="https://view.commonwl.org/graph/svg/github.com/common-workflow-language/user_guide/blob/main/_includes/cwl/workflows/1st-workflow.cwl" alt="Визуализация 1-го рабочего процесса.cwl" /></a>
ta: <a href="https://view.commonwl.org/workflows/github.com/common-workflow-language/user_guide/blob/main/_includes/cwl/workflows/nestedworkflows.cwl"><img src="https://view.commonwl.org/graph/svg/github.com/common-workflow-language/user_guide/blob/main/_includes/cwl/workflows/nestedworkflows.cwl" alt="nestedworkflows.cwl காட்சிப்படுத்தல்" /></a> <a href="https://view.commonwl.org/workflows/github.com/common-workflow-language/user_guide/blob/main/_includes/cwl/workflows/1st-workflow.cwl"><img src="https://view.commonwl.org/graph/svg/github.com/common-workflow-language/user_guide/blob/main/_includes/cwl/workflows/1st-workflow.cwl" alt="1st-workflow.cwl காட்சிப்படுத்தல்" /></a>

source: A CWL `Workflow` can be used as a `step` just like a `CommandLineTool`, its CWL file is included with `run`. The workflow inputs (`tarball` and `name_of_file_to_extract`) and outputs (`compiled_class`) then can be mapped to become the step's input/outputs.
ru: CWL `Workflow` может быть использован в качестве `шага`, как и `CommandLineTool`, его CWL-файл включается в `run`. Входы рабочего процесса (`tarball` и `name_of_file_to_extract`) и выходы (`compiled_class`) затем могут быть сопоставлены, чтобы стать входами/выходами шага.
ta: ஒரு சி.டபிள்யூ.எல் `பணிப்பாய்வு` ஒரு` கட்டமாக 'ஒரு `கட்டமாக' போலவே, அதன் சி.டபிள்யூ.எல் கோப்பு` ரன்` உடன் சேர்க்கப்பட்டுள்ளது. பணிப்பாய்வு உள்ளீடுகள் (`தர்பால்` மற்றும்` name_of_file_to_extract`) மற்றும் வெளியீடுகள் (`தொகுக்கப்பட்ட_ கிளாச்`) பின்னர் படிநிலையின் உள்ளீடு/வெளியீடுகளாக மாறலாம்.

source: Our `1st-workflow.cwl` was parameterized with workflow inputs, so when running it we had to provide a job file to denote the tar file and `*.java` filename. This is generally best-practice, as it means it can be reused in multiple parent workflows, or even in multiple steps within the same workflow.
ru: Наш `1st-workflow.cwl` был параметризован входами рабочего процесса, поэтому при его запуске мы должны были указать файл задания, чтобы обозначить tar-файл и имя файла `*.java`. Это, как правило, лучшая практика, так как это означает, что его можно повторно использовать в нескольких родительских рабочих процессах или даже в нескольких шагах в рамках одного рабочего процесса.
ta: எங்கள் `1 வது-வொர்க்ஃப்ளோ.க்விஎல்` பணிப்பாய்வு உள்ளீடுகளுடன் அளவுருவாக்கப்பட்டது, எனவே அதை இயக்கும் போது தார் கோப்பு மற்றும்`*.சாவா` கோப்பு பெயர் ஆகியவற்றைக் குறிக்க வேலை கோப்பை வழங்க வேண்டியிருந்தது. இது பொதுவாக சிறந்த நடைமுறையாகும், ஏனெனில் இது பல பெற்றோர் பணிப்பாய்வுகளில் அல்லது ஒரே பணிப்பாய்வுகளுக்குள் பல படிகளில் கூட மீண்டும் பயன்படுத்தப்படலாம்.

source: Here we use `default:` to hard-code `"Hello.java"` as the `name_of_file_to_extract` input, however our workflow also requires a tar file at `tarball`, which we will prepare in the `create-tar` step. At this point it is probably a good idea to refactor `1st-workflow.cwl` to have more specific input/output names, as those also appear in its usage as a tool.
ru: Здесь мы используем `default:` для жесткого кодирования `"Hello.java"` в качестве входного `имени_файла_к_извлечению`, однако наш рабочий процесс также требует tar-файл в `tarball`, который мы подготовим на шаге `create-tar`. На данном этапе, вероятно, стоит рефакторить `1st-workflow.cwl`, чтобы иметь более конкретные имена входов/выходов, так как они также появляются при его использовании в качестве инструмента.
ta: இங்கே நாம் `இயல்புநிலை:` ஆர்ட்-குறியீடு `" அலோ.சாவா "` `பெயர்_எஃப்_ஃபைல்_எக்டேக்சன்` உள்ளீட்டைப் பயன்படுத்துகிறோம், இருப்பினும் எங்கள் பணிப்பாய்வுக்கு` தர்பால்` இல் ஒரு தார் கோப்பு தேவைப்படுகிறது, அதை `படைப்பு-தார் படிநிலையில் நாங்கள் ஆயத்தம் செய்வோம் . இந்த கட்டத்தில், `1 வது-வொர்க்ஃப்ளோ.ச்விஎல்` ஐ மறுசீரமைப்பது நல்ல யோசனையாகும், மேலும் குறிப்பிட்ட உள்ளீடு/வெளியீட்டு பெயர்களைக் கொண்டிருப்பது, ஏனெனில் அவை ஒரு கருவியாக அதன் பயன்பாட்டில் தோன்றும்.

source: It is also possible to do a less generic approach and avoid external dependencies in the job file. So in this workflow we can generate a hard-coded `Hello.java` file using the previously mentioned `InitialWorkDirRequirement` requirement, before adding it to a tar file.
ru: Также можно использовать менее общий подход и избежать внешних зависимостей в файле задания. Так, в этом рабочем процессе мы можем сгенерировать жестко закодированный файл `Hello.java`, используя ранее упомянутое требование `InitialWorkDirRequirement`, прежде чем добавить его в tar-файл.
ta: குறைவான பொதுவான அணுகுமுறையைச் செய்யவும், வேலை கோப்பில் வெளிப்புற சார்புகளைத் தவிர்க்கவும் முடியும். எனவே இந்த பணிப்பாய்வுகளில், முன்னர் குறிப்பிடப்பட்ட `தொடக்கப்பொர்க் டிஐஆர்ரெக்விரெமென்ட்` தேவையைப் பயன்படுத்தி, ஒரு தார் கோப்பில் சேர்ப்பதற்கு முன், கடின குறியிடப்பட்ட` அலோ.சாவா` கோப்பை உருவாக்கலாம்.

source: In this case our step can assume `Hello.java` rather than be parameterized, so we can use hardcoded values `hello.tar` and `Hello.java` in a `baseCommand` and the resulting `outputs`:
ru: В этом случае наш шаг может предполагать `Hello.java`, а не быть параметризованным, поэтому мы можем использовать жестко заданные значения `hello.tar` и `Hello.java` в `baseCommand` и получаемых `выводах`:
ta: இந்த விசயத்தில் எங்கள் படி அளவுருவாக்கப்படுவதை விட `அலோ.சாவா` என்று கருதலாம், எனவே ஆர்ட்கோட் செய்யப்பட்ட மதிப்புகள்` அலோ.டார்` மற்றும் `அலோ.சாவா` ஆகியவற்றை ஒரு` பேச்கோமாண்ட்` இல் பயன்படுத்தலாம், இதன் விளைவாக `வெளியீடுகள்`:

source: Did you notice that we didn't split out the `tar --create` tool to a separate file, but rather embedded it within the CWL Workflow file? This is generally not best practice, as the tool then can't be reused. The reason for doing it in this case is because the command line is hard-coded with filenames that only make sense within this workflow.
ru: Вы заметили, что мы не выделили инструмент `tar --create` в отдельный файл, а встроили его в файл CWL Workflow? Как правило, это не лучшая практика, поскольку инструмент нельзя использовать повторно. В данном случае причина в том, что в командной строке жестко заданы имена файлов, которые имеют смысл только в рамках данного рабочего процесса.
ta: `தார் -கிரேட்` கருவியை ஒரு தனி கோப்பில் நாங்கள் பிரிக்கவில்லை என்பதை நீங்கள் கவனித்தீர்களா, மாறாக சி.டபிள்யூ.எல் பணிப்பாய்வு கோப்பில் அதை உட்பொதித்தீர்களா? இது பொதுவாக சிறந்த நடைமுறை அல்ல, ஏனெனில் கருவியை மீண்டும் பயன்படுத்த முடியாது. இந்த விசயத்தில் அதைச் செய்வதற்கான காரணம் என்னவென்றால், கட்டளை வரி கோப்பு பெயர்களால் கடின குறியிடப்பட்டிருப்பதால், இந்த பணிப்பாய்வுக்குள் மட்டுமே அர்த்தமுள்ளதாக இருக்கும்.

source: In this example we had to prepare a tar file outside, but only because our inner workflow was designed to take that as an input. A better refactoring of the inner workflow would be to take a list of Java files to compile, which would simplify its usage as a tool step in other workflows.
ja: この例では、外部にtarファイルを用意する必要がありました。これは内部ワークフローがそれを入力として受け取るように設計されているためです。内部ワークフローのリファクタリングとしては、コンパイルするjavaファイルのリストを受け取るようにすれば、他のワークフローにおいてもツールステップとしての使い方が簡単になります。
ru: В этом примере мы должны были подготовить tar-файл снаружи, но только потому, что наш внутренний рабочий процесс был разработан так, чтобы принимать его в качестве входных данных. Лучшим рефакторингом внутреннего рабочего процесса было бы получение списка Java-файлов для компиляции, что упростило бы его использование в качестве инструментального шага в других рабочих процессах.
ta: இந்த எடுத்துக்காட்டில் நாங்கள் ஒரு தார் கோப்பை வெளியே தயாரிக்க வேண்டியிருந்தது, ஆனால் எங்கள் உள் பணிப்பாய்வு அதை உள்ளீட்டாக எடுக்க வடிவமைக்கப்பட்டதால் மட்டுமே. உட்புற பணிப்பாய்வுகளின் சிறந்த மறுசீரமைப்பு என்பது சாவா கோப்புகளின் பட்டியலை தொகுக்க வேண்டும், இது மற்ற பணிப்பாய்வுகளில் ஒரு கருவி படியாக அதன் பயன்பாட்டை எளிதாக்கும்.

source: Nested workflows can be a powerful feature to generate higher-level functional and reusable workflow units - but just like for creating a CWL Tool description, care must be taken to improve its usability in multiple workflows.
ja: ネストされたワークフローは、より高機能で再利用可能なワークフローユニットを生成する強力な機能ですが、CWLツール定義の作成と同様に、複数のワークフローでの使い勝手を向上させるための配慮が必要です。
ru: Вложенные рабочие процессы могут быть мощной функцией для создания функциональных и многократно используемых единиц рабочего процесса более высокого уровня - но, как и при создании описания инструмента CWL, необходимо позаботиться о том, чтобы повысить удобство его использования в нескольких рабочих процессах.
ta: உயர் மட்ட செயல்பாட்டு மற்றும் மறுபயன்பாட்டு பணிப்பாய்வு அலகுகளை உருவாக்குவதற்கு உள்ளமைக்கப்பட்ட பணிப்பாய்வுகள் ஒரு சக்திவாய்ந்த அம்சமாக இருக்கலாம் - ஆனால் ஒரு சி.டபிள்யூ.எல் கருவி விளக்கத்தை உருவாக்குவதைப் போலவே, பல பணிப்பாய்வுகளில் அதன் பயன்பாட்டினை மேம்படுத்த கவனமாக இருக்க வேண்டும்.

source: Scattering Steps
ja: Scatter ステップ
ru: Шаги рассеивания
ta: சிதறல் படிகள்

source: Now that we know how to write workflows, we can start utilizing the `ScatterFeatureRequirement`. This feature tells the runner that you wish to run a tool or workflow multiple times over a list of inputs. The workflow then takes the input(s) as an array and will run the specified step(s) on each element of the array as if it were a single input. This allows you to run the same workflow on multiple inputs without having to generate many different commands or input yaml files.
ru: Теперь, когда мы знаем, как писать рабочие процессы, мы можем начать использовать `ScatterFeatureRequirement`. Эта функция сообщает исполнителю, что вы хотите запустить инструмент или рабочий процесс несколько раз над списком входных данных. Тогда рабочий процесс принимает входные данные в виде массива и выполняет указанные шаги на каждом элементе массива, как если бы это был один вход. Это позволяет запускать один и тот же рабочий процесс на нескольких входах без необходимости генерировать множество различных команд или входных yaml-файлов.
ta: இப்போது பணிப்பாய்வுகளை எழுதுவது எப்படி என்று எங்களுக்குத் தெரியும், `சிதறல்ஃபீட்டர்ரெக்யூமென்ட்` ஐப் பயன்படுத்தத் தொடங்கலாம். உள்ளீடுகளின் பட்டியலில் ஒரு கருவி அல்லது பணிப்பாய்வுகளை பல முறை இயக்க விரும்புகிறீர்கள் என்று இந்த நற்பொருத்தம் ரன்னரிடம் கூறுகிறது. பணிப்பாய்வு பின்னர் உள்ளீட்டை (களை) ஒரு வரிசையாக எடுத்து, வரிசையின் ஒவ்வொரு உறுப்பிலும் குறிப்பிட்ட படி (களை) ஒரு உள்ளீடு போல இயக்கும். பல கட்டளைகளை அல்லது உள்ளீட்டு YAML கோப்புகளை உருவாக்காமல் பல உள்ளீடுகளில் ஒரே பணிப்பாய்வுகளை இயக்க இது உங்களை அனுமதிக்கிறது.

source: The most common reason a new user might want to use scatter is to perform the same analysis on different samples. Let's start with a simple workflow that calls our first example (`hello_world.cwl`) and takes an array of strings as input to the workflow:
ja: 新規ユーザーがscatterを使いたいと思う最も一般的な理由は、異なるサンプルに対して同じ分析を実行することです。最初の例（`hello_world.cwl` ）を呼び出し、ワークフローへの入力として文字列の配列を受け取る、簡単なワークフローから始めましょう：
ru: Наиболее распространенная причина, по которой новый пользователь может захотеть использовать scatter, - это проведение одного и того же анализа для разных образцов. Давайте начнем с простого рабочего процесса, который вызывает наш первый пример (`hello_world.cwl`) и принимает массив строк в качестве входных данных для рабочего процесса:
ta: ஒரு புதிய பயனர் சிதறலைப் பயன்படுத்த விரும்புவதற்கான பொதுவான காரணம் வெவ்வேறு மாதிரிகளில் ஒரே பகுப்பாய்வைச் செய்வதாகும். எங்கள் முதல் உதாரணத்தை (`hello_world.cwl`) அழைக்கும் எளிய பணிப்பாய்வுகளுடன் ஆரம்பிக்கலாம் மற்றும் பணிப்பாய்வுக்கு உள்ளீடாக சரங்களின் வரிசையை எடுத்துக்கொள்வோம்:

source: `scatter-workflow.cwl`
ta: `சிதறல்-வொர்க்ஃப்ளோ.சிடபிள்யூஎல்`

source: Aside from the `requirements` section including `ScatterFeatureRequirement`, what is going on here?
ja: `requirements` セクションの`ScatterFeatureRequirement` などを含めて、ここはどうなっているのでしょうか？
ru: Помимо раздела `requirements`, включающего `ScatterFeatureRequirement`, что здесь происходит?
ta: `SPATTERFEATUREREQUIREMENT` உட்பட` தேவைகள்` பிரிவைத் தவிர, இங்கே என்ன நடக்கிறது?

source: First of all, notice that the main workflow level input here requires an array of strings.
ja: まず、ここでのメインワークフローの入力には、文字列の配列が必要であることに注目してください。
ru: Прежде всего, обратите внимание, что для ввода основного уровня рабочего процесса здесь требуется массив строк.
ta: முதலாவதாக, இங்குள்ள முக்கிய பணிப்பாய்வு நிலை உள்ளீட்டிற்கு சரங்களின் வரிசை தேவை என்பதைக் கவனியுங்கள்.

source: Here we've added a new field to the step `echo` called `scatter`. This field tells the runner that we'd like to scatter over this input for this particular step. Note that the input name listed after scatter is the one of the step's input, not a workflow level input.
ja: ここでは、ステップ`echo` に、`scatter` という新しいフィールドを追加しました。このフィールドは、CWLランナーに、このステップの入力を分散して実行したいことを伝えます。scatterの後に記載されている入力名は、ワークフローレベルの入力名ではなく、ステップの入力名であることに注意してください。
ru: Здесь мы добавили новое поле в шаг `echo` под названием `scatter`. Это поле сообщает бегуну, что мы хотим разбросать данные по входу для этого конкретного шага. Обратите внимание, что имя входа, указанное после scatter, - это имя входа шага, а не входа уровня рабочего процесса.
ta: `சிதறல்` எனப்படும்` எதிரொலி` படியில் ஒரு புதிய புலத்தை இங்கே சேர்த்துள்ளோம். இந்த குறிப்பிட்ட படிக்கு இந்த உள்ளீட்டை சிதறடிக்க விரும்புகிறோம் என்று இந்த புலம் ரன்னரிடம் கூறுகிறது. சிதறிக்குப் பிறகு பட்டியலிடப்பட்ட உள்ளீட்டுப் பெயர் படிநிலையின் உள்ளீட்டில் ஒன்றாகும், பணிப்பாய்வு நிலை உள்ளீடு அல்ல என்பதை நினைவில் கொள்க.

source: For our first scatter, it's as simple as that! Since our tool doesn't collect any outputs, we still use `outputs: []` in our workflow, but if you expect that the final output of your workflow will now have multiple outputs to collect, be sure to update that to an array type as well!
ru: Для нашего первого скаттера все просто! Поскольку наш инструмент не собирает никаких выходов, мы по-прежнему используем `outputs: []` в нашем рабочем процессе, но если вы ожидаете, что конечный результат вашего рабочего процесса теперь будет иметь несколько выходов для сбора, не забудьте обновить этот тип до массива!
ta: எங்கள் முதல் சிதறலுக்கு, அது அவ்வளவு எளிது! எங்கள் கருவி எந்த வெளியீடுகளையும் சேகரிக்கவில்லை என்பதால், நாங்கள் இன்னும் `வெளியீடுகளைப் பயன்படுத்துகிறோம்: []` எங்கள் பணிப்பாய்வுகளில், ஆனால் உங்கள் பணிப்பாய்வுகளின் இறுதி வெளியீடு இப்போது சேகரிக்க பல வெளியீடுகள் இருக்கும் என்று நீங்கள் எதிர்பார்க்கிறீர்கள் என்றால், அதை ஒரு வரிசைக்கு புதுப்பிக்க மறக்காதீர்கள் தட்டச்சு செய்க!

source: Using the following input file:
ja: 以下の入力ファイルを使用します：
ru: Используя следующий входной файл:
ta: பின்வரும் உள்ளீட்டு கோப்பைப் பயன்படுத்துதல்:

source: `scatter-job.yml`
ta: `சிதறல்-job.yml`

source: As a reminder, [`hello_world.cwl`](../introduction/quick-start.md) simply calls the command `echo` on a message. If we invoke `cwltool scatter-workflow.cwl scatter-job.yml` on the command line:
ja: 注意点として、[`hello_world.cwl`](../introduction/quick-start.md) は単にメッセージに対して`echo` というコマンドを呼び出します。コマンドラインで `cwltool scatter-workflow.cwl scatter-job.yml` を呼び出します：
ru: Напомним, что [`hello_world.cwl`](../introduction/quick-start.md) просто вызывает команду `echo` для сообщения. Если мы вызовем `cwltool scatter-workflow.cwl scatter-job.yml` в командной строке:
ta: நினைவூட்டலாக, [`hello_world.cwl`](../introduction/quick-start.md) என்பது ஒரு செய்தியில் `echo` என்ற கட்டளையை மட்டுமே அழைக்கிறது. கட்டளை வரியில் `cwltool scatter-workflow.cwl scatter-job.yml` ஐ செயல்படுத்தினால்:

source: You can see that the workflow calls echo multiple times on each element of our `message_array`. Ok, so how about if we want to scatter over two steps in a workflow?
ja: ワークフローは、`message_array` の各要素毎に、echo を呼び出していることがわかります。では、ワークフローの2つのステップに分散させたい場合はどうでしょうか？
ru: Вы видите, что рабочий процесс вызывает echo несколько раз для каждого элемента нашего `message_array`. Хорошо, а как быть, если мы хотим разбросать данные по двум шагам рабочего процесса?
ta: எங்கள் `Message_Array` இன் ஒவ்வொரு உறுப்பிலும் பணிப்பாய்வு அழைப்புகள் பல முறை எதிரொலிப்பதை நீங்கள் காணலாம். சரி, ஒரு பணிப்பாய்வுகளில் இரண்டு படிகளில் சிதற விரும்பினால் எப்படி?

source: Let's perform a simple echo like above, but capturing `stdout` by adding the following lines instead of `outputs: []`
ja: 上記のような簡単なエコーを実行します、`outputs: []`の代わりに次の行を追加して`stdout` をキャプチャしてみましょう
ru: Давайте выполним простое эхо, как описано выше, но перехватим `stdout`, добавив следующие строки вместо `outputs: []`
ta: மேலே உள்ளதைப் போல ஒரு எளிய எதிரொலியைச் செய்வோம், ஆனால் `வெளியீடுகளுக்கு பதிலாக பின்வரும் வரிகளைச் சேர்ப்பதன் மூலம்` stdout` ஐப் பிடிப்போம்: [] `

source: `hello_world_to_stdout.cwl`
ta: `அலோ_போர்ட்_டோ_ச்டூட்.ச்விஎல்`

source: And add a second step that uses `wc` to count the characters in each file. See the tool below:
ja: そして、`wc` を使って各ファイルの文字数をカウントする第2ステップを追加します。以下のツールを見てください：
ru: И добавьте второй шаг, который использует `wc` для подсчета символов в каждом файле. Смотрите инструмент ниже:
ta: ஒவ்வொரு கோப்பிலும் உள்ள எழுத்துக்களை எண்ண `wc` ஐப் பயன்படுத்தும் இரண்டாவது படியைச் சேர்க்கவும். கீழே உள்ள கருவியைக் காண்க:

source: Now, how do we incorporate scatter? Remember the scatter field is under each step:
ru: Итак, как нам включить рассеивание? Помните, что поле разброса находится под каждым шагом:
ta: இப்போது, சிதறலை எவ்வாறு இணைப்பது? சிதறல் புலம் ஒவ்வொரு அடியிலும் உள்ளது என்பதை நினைவில் கொள்ளுங்கள்:

source: `scatter-two-steps.cwl`
ta: `சிதறல்-இரண்டு-படி. cwl`

source: Here we have placed the scatter field under each step. This is fine for this example since it runs quickly, but if you're running many samples for a more complex workflow, you may wish to consider an alternative. Here we are running scatter on each step independently, but since the second step is not dependent on the first step completing all languages, we aren't using the scatter functionality efficiently. The second step expects an array as input from the first step, so it will wait until everything in step one is finished before doing anything. Pretend that `echo Hello World!` takes 1 minute to perform, `wc -c` on the output takes 3 minutes and that `echo Hallo welt!` takes 5 minutes to perform, and `wc` on that output takes 3 minutes. Even though `echo Hello World!` could finish in 4 minutes, it will actually finish in 8 minutes because the first step must wait on `echo Hallo welt!`. You can see how this might not scale well.
ru: Здесь мы поместили поле разброса под каждым шагом. Это подходит для данного примера, поскольку он выполняется быстро, но если вы выполняете много образцов для более сложного рабочего процесса, возможно, вам стоит рассмотреть альтернативный вариант. Здесь мы запускаем scatter на каждом шаге независимо, но поскольку второй шаг не зависит от первого, заполняя все языки, мы не используем функциональность scatter эффективно. Второй шаг ожидает массив в качестве входных данных от первого шага, поэтому он будет ждать, пока все на первом шаге не будет завершено, прежде чем что-то делать. Представьте, что выполнение `echo Hello World!` занимает 1 минуту, а вывод `wc -c` - 3 минуты, а выполнение `echo Hallo welt!` занимает 5 минут, а вывод `wc` - 3 минуты. Даже если `echo Hello World!` может завершиться за 4 минуты, на самом деле он завершится за 8 минут, потому что первый шаг должен ждать `echo Hallo welt!`. Вы можете видеть, как это может не очень хорошо масштабироваться.
ta: இங்கே நாம் ஒவ்வொரு அடியிலும் சிதறல் புலத்தை வைத்திருக்கிறோம். இந்த எடுத்துக்காட்டு விரைவாக இயங்குவதால் இது நல்லது, ஆனால் நீங்கள் மிகவும் சிக்கலான பணிப்பாய்வுக்காக பல மாதிரிகளை இயக்குகிறீர்கள் என்றால், நீங்கள் ஒரு மாற்றீட்டைக் கருத்தில் கொள்ள விரும்பலாம். இங்கே நாம் ஒவ்வொரு அடியிலும் சுயாதீனமாக சிதறலை இயக்குகிறோம், ஆனால் இரண்டாவது படி அனைத்து மொழிகளையும் நிறைவு செய்யும் முதல் படியைப் பொறுத்தது அல்ல என்பதால், நாங்கள் சிதறல் செயல்பாட்டை திறமையாகப் பயன்படுத்தவில்லை. இரண்டாவது படி ஒரு வரிசையை முதல் படியிலிருந்து உள்ளீடாக எதிர்பார்க்கிறது, எனவே ஒரு படி ஒன்றில் உள்ள அனைத்தும் எதையும் செய்வதற்கு முன் அது முடிவடையும் வரை காத்திருக்கும். `எக்கோ அலோ வேர்ல்ட்!` செய்ய 1 மணித்துளி ஆகும் என்று பாசாங்கு செய்யுங்கள், `wc -c` வெளியீட்டில் 3 நிமிடங்கள் ஆகும், மேலும்` எதிரொலி ஆலோ வெல்ட்! `செய்ய 5 நிமிடங்கள் ஆகும், மேலும் அந்த வெளியீட்டில்` wc` 3 நிமிடங்கள் ஆகும். `எக்கோ அலோ வேர்ல்ட்!` 4 நிமிடங்களில் முடிக்க முடியும் என்றாலும், அது உண்மையில் 8 நிமிடங்களில் முடிவடையும், ஏனெனில் முதல் படி `எக்கோ ஆலோ வெல்ட்!` இல் காத்திருக்க வேண்டும். இது எவ்வாறு சரியாக அளவிடப்படாது என்பதை நீங்கள் காணலாம்.

source: Ok, so how do we scatter on steps that can proceed independent of other samples? Remember from [Nested Workflows](#nested-workflows), that we can make an entire workflow a single step in another workflow! Convert our two-step workflow to a single step subworkflow:
ja: では、他のサンプルと独立して進行できるステップを分散させるにはどうすればいいのでしょうか？[Nested Workflows](#nested-workflows)で、ワークフロー全体を別のワークフローの1ステップにすることができることを思い出しましょう！2ステップのワークフローを1ステップのサブワークフローに変換してみましょう：
ru: Итак, как нам разбросать шаги, которые могут выполняться независимо от других проб? Помните из [Nested Workflows](#nested-workflows), что мы можем сделать весь рабочий процесс одним шагом в другом рабочем процессе! Преобразуйте наш двухэтапный рабочий процесс в одноэтапный подпроцесс:
ta: சரி, எனவே மற்ற மாதிரிகளிலிருந்து சுயாதீனமாக தொடரக்கூடிய படிகளில் நாம் எவ்வாறு சிதறடிப்பது? [உள்ளமைக்கப்பட்ட பணிப்பாய்வுகளிலிருந்து](#nested-workflows) நினைவில் கொள்ளுங்கள், ஒரு முழு பணிப்பாய்வுகளையும் மற்றொரு பணிப்பாய்வுகளில் ஒரு படி செய்ய முடியும் என்பதை நினைவில் கொள்க! எங்கள் இரண்டு-படி பணிப்பாய்வுகளை ஒற்றை படி அடைப்பகுதிக்கு மாற்றவும்:

source: `scatter-nested-workflow.cwl`
ta: `சிதறல்-நெச்டட்-வொர்க்ஃப்ளோ.ச்விஎல்`
