Repository: common-workflow-language/user_guide
Catalog: locales/*/LC_MESSAGES/user_guide.po
Languages: ja, ru, ta, zh_hans

source: In tool descriptions, list dependencies using short name(s) under `SoftwareRequirement`.
ru: В описаниях инструментов перечисляйте зависимости, используя краткое название (названия) в разделе `SoftwareRequirement`.
ta: கருவி விளக்கங்களில், `சாப்ட்வேர் ரெகுரிகேமென்ட்` இன் கீழ் குறுகிய பெயர் (களை) பயன்படுத்தி சார்புகளை பட்டியலிடுங்கள்.
zh_hans: 在工具描述中，将所依赖的软件在 `SoftwareRequirement` 下以简短的名称列出。

source: Include [SciCrunch][scicrunch] identifiers for dependencies in `https://identifiers.org/rrid/RRID:SCR_NNNNNN` format.
ja: `https://identifiers.org/rrid/RRID:SCR_NNNNNN` 形式で依存関係のための [SciCrunch][scicrunch] 識別子を書きます。
ru: Включите идентификаторы [SciCrunch][scicrunch] для зависимостей в формате `https://identifiers.org/rrid/RRID:SCR_NNNNNN`.
ta: `https://identifiers.org/rrid/rrid:scr_nnnnnn` வடிவத்தில் சார்புகளுக்கான [SciCrunch][scicrunch] அடையாளங்காட்டிகளைச் சேர்.
zh_hans: 为依赖关系添加 [SciCrunch][scicrunch] 标识符。其格式形如 `https://identifiers.org/rrid/RRID:SCR_NNNNNN`.

source: All `input` and `output` identifiers should reflect their conceptual identity. Use informative names like `unaligned_sequences`, `reference_genome`, `phylogeny`, or `aligned_sequences` instead of `foo_input`, `foo_file`, `result`, `input`, `output`, and so forth.
ja: `input` および`output` の識別子はすべて、その概念的同一性を反映する必要があります。`foo_input`,`foo_file`,`result`,`input`,`output`, などの代わりに`unaligned_sequences`,`reference_genome`,`phylogeny`, または`aligned_sequences` などの情報量の多い名称を使ってください。
ru: Все идентификаторы `ввода` и `вывода` должны отражать их концептуальную идентичность. Используйте информативные имена типа `unaligned_sequences`, `reference_genome`, `phylogeny` или `aligned_sequences` вместо `foo_input`, `foo_file`, `result`, `input`, `output` и так далее.
ta: அனைத்து `உள்ளீடு` மற்றும்` வெளியீடு` அடையாளங்காட்டிகள் அவற்றின் கருத்தியல் அடையாளத்தை பிரதிபலிக்க வேண்டும். `Foo_Input`,` foo_file`, `முடிவு`,` உள்ளீடு`, `வெளியீடு` மற்றும் பலவற்றிற்கு பதிலாக` Knaligned_uckences`, `resopt_genome`,` பைலோசெனி`, `சீரமைக்கப்பட்ட_ வரிசைமுறைகள்` போன்ற தகவலறிந்த பெயர்களைப் பயன்படுத்தவும்.
zh_hans: 一切 `input`（输入）和 `output`（输出）标识符均应体现其概念上的特质。请使用类似 `unaligned_sequences`、`reference_genome`、 `phylogeny`、或 `aligned_sequences` 这样望文知义的变量名，而非 `foo_input`、`foo_file`、`result`、`input`、`output` 等缺乏明确内涵的名称。

source: In tool descriptions, include a list of version(s) of the tool that are known to work with this description under `SoftwareRequirement`.
ru: В описаниях инструментов в разделе `SoftwareRequirement` указывайте список версий инструмента, которые, как известно, работают с данным описанием.
ta: கருவி விளக்கங்களில், `சாப்ட்வேர் ரெக்வைமென்ட்` இன் கீழ் இந்த விளக்கத்துடன் வேலை செய்ய அறியப்பட்ட கருவியின் பதிப்பு (கள்) பட்டியலைச் சேர்க்கவும்.
zh_hans: 在工具描述中 `SoftwareRequirement` 下，请列出已知能与该描述兼容的工具版本。

source: `format` should be specified for all input and output `File`s. Bioinformatics tools should use format identifiers from [EDAM][edam-example]. See also `iana:text/plain`, `iana:text/tab-separated-values` with `$namespaces: { iana: "https://www.iana.org/assignments/media-types/" }`. [Full IANA media type list][iana-types] (also known as MIME types). For non-bioinformatics tools, use or build an appropriate ontology/controlled vocabulary in the same way. Please edit this page to let us know about it.
ru: `Формат` должен быть указан для всех входных и выходных `файлов`. Инструменты биоинформатики должны использовать идентификаторы формата из [EDAM][edam-example]. См. также `iana:text/plain`, `iana:text/tab-separated-values` с `$namespaces: { iana: "https://www.iana.org/assignments/media-types/" }`. [Полный список медиатипов IANA][iana-types] (также известные как типы MIME). Для инструментов, не относящихся к биоинформатике, используйте или создайте соответствующую онтологию/контролируемый словарь таким же образом. Пожалуйста, отредактируйте эту страницу, чтобы сообщить нам об этом.
ta: அனைத்து உள்ளீடு மற்றும் வெளியீடு `கோப்பு'க்கு` வடிவமைப்பு` குறிப்பிடப்பட வேண்டும். பயோ-இன்ஃபர்மேடிக்ச் கருவிகள் [EDAM][edam-example]] இருந்து வடிவமைப்பு அடையாளங்காட்டிகளைப் பயன்படுத்த வேண்டும். `iana:text/plain`,`iana:text/tab-separated-values` `$namespaces: { iana: "https://www.iana.org/assignments/media-types/" }`. [முழு ஐஏஎன்ஏ மீடியா வகை பட்டியல்][iana-types] (மைம் வகைகள் என்றும் அழைக்கப்படுகிறது). பயோஇன்ஃபர்மேடிக்ச் அல்லாத கருவிகளுக்கு, அதே வழியில் பொருத்தமான ஆன்டாலசி/கட்டுப்படுத்தப்பட்ட சொற்களஞ்சியத்தைப் பயன்படுத்தவும் அல்லது உருவாக்கவும். இதைப் பற்றி எங்களுக்குத் தெரியப்படுத்த இந்தப் பக்கத்தைத் திருத்தவும்.
zh_hans: 所有输入和输出 `File`（文件）都需要指明 `format`（格式）。生物信息学工具应使用来自 [EDAM][edam-example] 的格式标识符。另请参考 `iana:text/plain`、`iana:text/tab-separated-values` 等在 `$namespaces: { iana: "https://www.iana.org/assignments/media-types/" } 下使用的格式名，以及[IANA 媒体类型][iana-types]（又称 MIME 类型）的完整列表。对于非生物信息学工具，请同样运用或创建合适的本体或受控词表 (controlled vocabulary). 如果您对此有经验，请编辑此页面，以告知我们。

source: Mark all input and output `File`s that are read from or written to in a streaming compatible way (only once, no random-access), as `streamable: true`.
ja: `File`の入出力のうち、ストリーミング互換の方法（一度だけ利用されて、ランダムアクセスなし、訳注標準入出力のイメージ）で読み書きされるものを、`streamable: true` としてマークします。
ru: Пометьте все входные и выходные `файлы`, которые считываются или записываются совместимым с потоковой передачей способом (только один раз, без случайного доступа), как `streamable: true`.
ta: ச்ட்ரீமிங் இணக்கமான வழியில் (ஒரு முறை மட்டுமே, சீரற்ற-அணுகல் இல்லை), `ச்ட்ரீம் செய்யக்கூடியது: உண்மை` போன்ற அனைத்து உள்ளீடு மற்றும் வெளியீட்டைக் குறிக்கவும்.
zh_hans: 将所有能作为流读写（即单次、非随机访问）的输入和输出 `File`（文件）标记为 `streamable: true`.

source: Each `CommandLineTool` description should focus on a single operation only, even if the (sub)command is capable of more. Don't overcomplicate your tool descriptions with options that you don't need or use.
ru: Описание каждого инструмента `CommandLineTool` должно быть сфокусировано только на одной операции, даже если (под)команда способна на большее. Не усложняйте описание инструментов опциями, которые вам не нужны или не используются.
ta: (துணை) கட்டளை அதிக திறன் கொண்டிருந்தாலும், ஒவ்வொரு `கட்டளை லைனெட்டூல்` விளக்கமும் ஒரு செயல்பாட்டில் மட்டுமே கவனம் செலுத்த வேண்டும். உங்களுக்குத் தேவையில்லாத அல்லது பயன்படுத்தாத விருப்பங்களுடன் உங்கள் கருவி விளக்கங்களை மிகைப்படுத்த வேண்டாம்.
zh_hans: 即使某个命令或其子命令能够执行更多操作，每个 `CommandLineTool`（命令行工具）描述也应侧重于单个操作。请勿添加非必需或用不到的选项，以免工作描述过于复杂。

source: Custom types should be defined with one external YAML per type definition for re-use.
ja: カスタム型は、型定義ごとに1つの外部YAMLで定義すると再利用しやすくなります。
ru: Пользовательские типы должны быть определены с помощью одного внешнего YAML для каждого определения типа для повторного использования.
ta: தனிப்பயன் வகைகள் மறு பயன்பாட்டிற்கான ஒரு வகை வரையறைக்கு ஒரு வெளிப்புற YAML உடன் வரையறுக்கப்பட வேண்டும்.
zh_hans: 关于自定义类型，每个外部 YAML 文件应与单个类型定义一一对应，以便重复使用。

source: Include a top-level short `label` summarising the tool/workflow.
ja: ツール/ワークフローを要約したトップレベルの短い`label` を含めます。
ru: Включите краткую `метку` верхнего уровня, кратко описывающую инструмент/рабочий процесс.
ta: கருவி/பணிப்பாய்வுகளை சுருக்கமாகக் கூறி ஒரு உயர்மட்ட குறுகிய `லேபிள்` சேர்க்கவும்.
zh_hans: 请使用位于顶级的简短 `label`（标签）对工具或工作流加以概括。

source: If useful, include a top-level `doc` as well. This should provide a longer, more detailed description than was provided in the top-level `label` (see above).
ja: 有用であれば、トップレベル`doc` も含めてください。これは、トップレベル`label` （上記参照）で提供されたものより長く詳細な説明を記述します。
ru: Если это полезно, включите также верхнеуровневый `doc`. Он должен содержать более длинное и подробное описание, чем то, которое было представлено в `label` верхнего уровня (см. выше).
ta: பயனுள்ளதாக இருந்தால், ஒரு உயர்மட்ட `டாக் 'ஐயும் சேர்க்கவும். இது உயர்மட்ட `லேபிளில் 'வழங்கப்பட்டதை விட நீண்ட, விரிவான விளக்கத்தை வழங்க வேண்டும் (மேலே காண்க).
zh_hans: 在用得到的时候，还应添加顶级 `doc`. 相比上述顶级 `label`, 此处应提供更长、更详细的描述。

source: Use `type: enum` instead of `type: string` for elements with a fixed list of valid values.
ja: 有効な値のリストが決まっている要素には、`type: string` の代わりに、`type: enum` を使用してください。
ru: Используйте `type: enum` вместо `type: string` для элементов с фиксированным списком допустимых значений.
ta: செல்லுபடியாகும் மதிப்புகளின் நிலையான பட்டியலைக் கொண்ட உறுப்புகளுக்கு `வகை: சரம்` க்கு பதிலாக` வகை: enum` ஐப் பயன்படுத்தவும்.
zh_hans: 对于有效取值为若干固定值的元素，应使用 `type: enum` 而非 `type: string`.

source: Evaluate all use of JavaScript for possible elimination or replacement. One common example: manipulating `File` names and paths? Consider whether one of the [built in `File` properties][file-prop] like `basename`, `nameroot`, `nameext`, etc., could be used instead.
ru: Проанализируйте все случаи использования JavaScript на предмет возможного исключения или замены. Один из распространенных примеров: манипулирование именами и путями к `файлам`? Подумайте, можно ли вместо этого использовать одно из [встроенных свойств `File`][file-prop], например `basename`, `nameroot`, `nameext` и т. д.
ta: சாத்தியமான நீக்குதல் அல்லது மாற்றுவதற்கு சாவாச்கிரிப்டின் அனைத்து பயன்பாடுகளையும் மதிப்பீடு செய்யுங்கள். ஒரு பொதுவான எடுத்துக்காட்டு: `File` பெயர்கள் மற்றும் பாதைகளை கையாளுகிறீர்களா? [`File` பண்புகள்][file-prop] `basename`, `nameroot`,`nameext` போன்றவற்றில் ஒன்றைப் பயன்படுத்த முடியுமா என்பதைக் கவனியுங்கள்.
zh_hans: 所有用到 JavaScript 之处都应进行评估，考虑是否能将它去除或替代。经常遇到的一例，是处理 `File` （文件）名称和路径。这时应考虑是否能用 [`File` 的内置属性][file-prop]（如`basename`、`nameroot` 和 `nameext` 等）取代 JavaScript.

source: Give the tool description to a colleague (preferably at a different institution) to test and provide feedback.
ja: ツール定義を同僚（できれば別の機関の人）に渡し、テストしてもらい、フィードバックをもらいましょう。
ru: Дайте описание инструмента коллеге (желательно в другом учреждении), чтобы он протестировал его и предоставил отзывы.
ta: கருவி விளக்கத்தை ஒரு தம ஊழியருக்கு (முன்னுரிமை வேறு நிறுவனத்தில்) சோதிக்கவும் கருத்துக்களை வழங்கவும் கொடுங்கள்.
zh_hans: 写好工具描述后， 把它交给同行（最好来自其他机构）进行测试并获取反馈。

source: Complex workflows with individual components which can be abstracted should utilise the [`SubworkflowFeatureRequirement`][subworkflow] to make their workflow modular and allow sections of them to be easily reused.
ja: 抽象化できる個々のコンポーネントを持つ複雑なワークフローは、ワークフローをモジュール化し、その一部を容易に再利用できるようにするために、[`SubworkflowFeatureRequirement`][subworkflow]を利用します。
ru: Сложные рабочие процессы с отдельными компонентами, которые могут быть абстрагированы, должны использовать [`SubworkflowFeatureRequirement`][subworkflow], чтобы сделать их модульными и позволить легко использовать их части повторно.
ta: சுருக்கமாக இருக்கக்கூடிய தனிப்பட்ட கூறுகளைக் கொண்ட சிக்கலான பணிப்பாய்வுகள் [`subworkflowfeaturerequirement`] [subworkflow] ஐப் பயன்படுத்த வேண்டும், அவற்றின் பணிப்பாய்வுகளை மட்டுப்படுத்தவும், அவற்றின் பிரிவுகளை எளிதில் மீண்டும் பயன்படுத்த அனுமதிக்கவும்.
zh_hans: 若复杂的工作流中包含可以抽象出来的单独组件，应利用 [`SubworkflowFeatureRequirement`][subworkflow] 将工作流模块化，以便重复使用其组成部分。

source: Software containers should be made to be conformant to the ["Recommendations for the packaging and containerizing of bioinformatics software"][containers] (also useful to other disciplines).
ru: Контейнеры для программного обеспечения должны соответствовать ["Рекомендациям по упаковке и контейнеризации программного обеспечения для биоинформатики"][контейнеры] (также полезны для других дисциплин).
ta: மென்பொருள் கொள்கலன்கள் ["பயோ -இன்ஃபர்மேடிக்ச் மென்பொருளை பேக்கேசிங் மற்றும் கொள்கலனுக்கான பரிந்துரைகளுக்கு"][containers] இணக்கமாக இருக்க வேண்டும் (பிற துறைகளுக்கும் பயனுள்ளதாக இருக்கும்).
zh_hans: 应使软件容器 (container) 符合 [Recommendations for the packaging and containerizing of bioinformatics software][containers]（《生物信息学软件封装与容器化建议》）一文提出的标准。该文对其他学科也有参考价值。

source: Command Line Tool
ja: コマンドラインツール
ru: Инструмент командной строки
ta: கட்டளை வரி கருவி
zh_hans: 命令行工具

source: A command-line tool is a type of Process object that can be run by itself or as a Workflow step. It is a wrapper for a command like `ls`, `echo`, `tar`, etc. The command-line tool is defined in the `baseCommand` attribute of the command-line tool CWL document.
ja: CommandLineToolは、Processオブジェクトの一種であり、それ自体またはワークフローのステップとして実行することができます。`ls`,`echo`,`tar` などの実行したいコマンドのラッパーです。実行したいコマンドは、CommandLineToolについてのCWL定義の`baseCommand` 属性で定義されています。
ru: Инструмент командной строки - это тип объекта Process, который можно запускать самостоятельно или в качестве шага Workflow. Он представляет собой обертку для таких команд, как `ls`, `echo`, `tar` и т. д. Инструмент командной строки определяется в атрибуте `baseCommand` документа CWL инструмента командной строки.
ta: ஒரு கட்டளை-வரி கருவி என்பது ஒரு வகை செயல்முறை பொருளாகும், இது தானாகவே அல்லது பணிப்பாய்வு படியாக இயக்கப்படலாம். இது `ls`,` எதிரொலி`, `தார்` போன்ற ஒரு கட்டளைக்கான ஒரு ரேப்பர் ஆகும். கட்டளை-வரி கருவி CWL ஆவணத்தின்` பேச் கமாண்ட்` பண்புக்கூறில் கட்டளை-வரி கருவி வரையறுக்கப்பட்டுள்ளது.
zh_hans: 命令行工具是可以单独运行或作为工作流步骤运行的一类流程 (process) 对象。它是诸如 `ls`、`echo`、`tar` 等命令的包装器，由相应的 CWL 文件中 `baseCommand` 这一属性定义。

source: A CWL command-line tool must also have `inputs` and `outputs`. The following example contains a minimal example of a CWL command-line tool for the `echo` Linux command, using inputs and outputs.
ja: CWLコマンドラインツールは、`inputs` と`outputs` も持っていなければなりません。次の例は、Linuxコマンド `echo` のためのCWLコマンドラインツールの最小限の例で、inputsとoutputsを使用します。
ru: Инструмент командной строки CWL также должен иметь `входы` и `выходы`. Следующий пример содержит минимальный пример инструмента командной строки CWL для команды `echo` Linux, использующий входы и выходы.
ta: ஒரு சி.டபிள்யூ.எல் கட்டளை-வரி கருவி `உள்ளீடுகள்` மற்றும்` வெளியீடுகள்` கொண்டிருக்க வேண்டும். உள்ளீடுகள் மற்றும் வெளியீடுகளைப் பயன்படுத்தி `எதிரொலி` லினக்ச் கட்டளைக்கான CWL கட்டளை-வரி கருவியின் குறைந்தபட்ச எடுத்துக்காட்டு பின்வரும் எடுத்துக்காட்டில் உள்ளது.
zh_hans: CWL 命令行工具还必具有 `inputs`（输入）和 `outputs`（输出）。以下是一个 CWL 命令行工具的极简示例，用 Linux 下的 `echo` 命令演示输入和输出。

source: CWL command-line tool.
ja: CWLコマンドラインツール。
ru: Инструмент командной строки CWL.
ta: CWL கட்டளை-வரி கருவி.
zh_hans: CWL 命令行工具。

source: The example above uses a simplified form to define inputs and outputs. You will learn more about in the [Inputs](../topics/inputs.md) and in the [Outputs](../topics/outputs.md) sections.
ja: 上記の例では、簡略化した形で入力と出力を定義しています。[Inputs](../topics/inputs.md)と[Outputs](../topics/outputs.md)のセクションで、より詳しく説明する予定です。
ru: В приведенном примере используется упрощенная форма для определения входов и выходов. Подробнее об этом вы узнаете в разделах [Inputs](../topics/inputs.md) и [Outputs](../topics/outputs.md).
ta: உள்ளீடுகள் மற்றும் வெளியீடுகளை வரையறுக்க மேலே உள்ள எடுத்துக்காட்டு எளிமையான படிவத்தைப் பயன்படுத்துகிறது. [உள்ளீடுகள்](../topics/inputs.md) மற்றும் [வெளியீடுகள்](../topics/outputs.md) பிரிவுகளில் நீங்கள் மேலும் அறிந்து கொள்வீர்கள்.
zh_hans: 上例以简化的形式定义了输入和输出。在[《输入》](../topics/inputs.md)和[《输出》](../topics/outputs.md) 章节中，您将进一步学习。

source: Network Access
ja: ネットワークアクセス
ru: Доступ к сети
ta: பிணைய அணுகல்
zh_hans: 网络访问 (Network Access)

source: This indicates whether a process requires outgoing IPv4/IPv6 network access. If a command-line tool is written manually in CWL v1.1+, there is a need to specify when network access is required.
ru: Указывает, требуется ли процессу исходящий доступ к сети IPv4/IPv6. Если инструмент командной строки написан вручную в CWL v1.1+, необходимо указать, когда требуется доступ к сети.
ta: ஒரு செயல்முறைக்கு வெளிச்செல்லும் ஐபிவி 4/ஐபிவி 6 பிணைய அணுகல் தேவையா என்பதை இது குறிக்கிறது. CWL V1.1+இல் ஒரு கட்டளை-வரி கருவி கைமுறையாக எழுதப்பட்டிருந்தால், பிணைய அணுகல் தேவைப்படும்போது குறிப்பிட வேண்டிய தேவை உள்ளது.
zh_hans: 这指的是流程是否需要发起 IPv4/IPv6 网络访问。如果命令行工具是基于 CWL v1.1+ 版本新编写的，则有必要明文指定何时需要访问网络。

source: CWL v1.0 command-line tools that are upgraded to v1.1 or v1.2 get Network Access automatically.
ru: Инструменты командной строки CWL v1.0, обновленные до v1.1 или v1.2, получают доступ к сети автоматически.
ta: CWL V1.0 கட்டளை-வரி கருவிகள் V1.1 அல்லது V1.2 க்கு மேம்படுத்தப்படுகின்றன. பிணைய அணுகலை தானாகவே பெறுங்கள்.
zh_hans: 从 CWL v1.0 版本升级到 1.1 或 1.2 版的命令行工具将自动获取网络访问权限。

source: Creating Files at Runtime
ja: 実行時にファイルを作成する
ru: Создание файлов во время выполнения
ta: இயக்க நேரத்தில் கோப்புகளை உருவாக்குதல்
zh_hans: 在运行时创建文件

source: Sometimes you need to create a file on the fly from input parameters, such as tools that expect to read their input configuration from a file rather than the command line parameters, or need a small wrapper shell script.
ru: Иногда требуется создать файл на лету из входных параметров, например, для инструментов, которые ожидают, что их входная конфигурация будет считана из файла, а не из параметров командной строки, или для небольших сценариев оболочки-обертки.
ta: சில நேரங்களில் நீங்கள் உள்ளீட்டு அளவுருக்களிலிருந்து பறக்க ஒரு கோப்பை உருவாக்க வேண்டும், அதாவது கட்டளை வரி அளவுருக்களைக் காட்டிலும் ஒரு கோப்பிலிருந்து அவற்றின் உள்ளீட்டு உள்ளமைவைப் படிக்க எதிர்பார்க்கும் கருவிகள் அல்லது சிறிய ரேப்பர் செல் ச்கிரிப்ட் தேவை.
zh_hans: 有些情况下，您需要根据输入参数动态创建文件。例如有的工具需要通过文件（而非命令行参数）读取输入配置，还有的需要小型 shell 脚本作为包装器 (wrapper).

source: To generate such files, we can use the `InitialWorkDirRequirement`.
ru: Для генерации таких файлов мы можем использовать `InitialWorkDirRequirement`.
ta: அத்தகைய கோப்புகளை உருவாக்க, நாம் `SiteritWorkDirRequirement` ஐப் பயன்படுத்தலாம்.
zh_hans: 要生成此类文件，我们可以使用 `InitialWorkDirRequirements`.

source: `createfile.cwl`
ta: `criatefile.cwl`

source: Any [expressions](../topics/expressions.md) like `$(inputs.message)` are expanded by the CWL engine before creating the file. Here, insert the value at the input `message`.
ja: `$(inputs.message)` のような [Expressions](../topics/expressions.md)は、ファイルを作成する前にCWL実行エンジンによって展開されます。ここでは、入力パラメータ`message` に値を挿入します。
ru: Любые [выражения](../topics/expressions.md) типа `$(inputs.message)` расширяются движком CWL перед созданием файла. Здесь вставьте значение во входной `message`.
ta: `$(inputs.message)` போன்ற எந்த [வெளிப்பாடுகள்](../topics/expressions.md). இங்கே, `message` உள்ளீட்டில் மதிப்பை செருகவும்.
zh_hans: 在创建文件之前，CWL引擎将扩展所有形如 `$(inputs.message)` 的[表达式](../topics/expressions.md)。此处将插入输入项`message` 实际的值。

source: The _CWL expressions_ are independent of any _shell variables_ used later during command line tool invocation. That means that any genuine need for the character `$` must be **escaped** with `\`. For instance, `\${PREFIX}` above is expanded to `${PREFIX}` in the generated file to be evaluated by the shell script instead of the CWL engine.
ru: Выражения _CWL_ не зависят от переменных оболочки, используемых в дальнейшем при вызове инструментов командной строки. Это означает, что любая реальная потребность в символе `$` должна быть **эскейпирована** с помощью `\`. Например, `\${PREFIX}` выше расширено до `${PREFIX}` в сгенерированном файле, чтобы быть оцененным сценарием оболочки, а не движком CWL.
ta: _CWL வெளிப்பாடுகள்_ கட்டளை வரி கருவி அழைப்பின் போது பின்னர் பயன்படுத்தப்படும் எந்த _shell மாறிகள்_ இலிருந்து சுயாதீனமாக உள்ளன. அதாவது `$` கதாபாத்திரத்தின் உண்மையான தேவையும் `\` உடன் ** தப்பிக்க வேண்டும் **. உதாரணமாக, மேலே உள்ள `\ $ {PREFIX}` சி.டபிள்யூ.எல் எஞ்சினுக்கு பதிலாக செல் ச்கிரிப்ட் மூலம் மதிப்பீடு செய்ய உருவாக்கப்பட்ட கோப்பில் `$ {PREFIX}` என விரிவுபடுத்தப்படுகிறது.
zh_hans: _CWL 表达式 _ 与后期在命令行工具调用时用到的任何 _shell 变量 _ 是相互独立的。这意味着，所有（后期）实际用到字符 `$` 的地方必须由 `\` （斜线）字符加以** 转义 **。例如，上例中的 `\${PREFIX}` 在生成的文件中扩展为 `${PREFIX}`，以供 shell 脚本（而非 CWL 引擎）计算其值。

source: To test the above CWL tool, use this job to provide the input value `message`:
ja: 上記のCWLツールをテストするために、このジョブを使用して、入力値`message` を与えます：
ru: Чтобы протестировать вышеупомянутый инструмент CWL, используйте это задание для предоставления входного значения `message`:
ta: மேலே உள்ள CWL கருவியைச் சோதிக்க, உள்ளீட்டு மதிப்பை `செய்தி` வழங்க இந்த வேலையைப் பயன்படுத்தவும்:
zh_hans: 测试上述 CWL 工具时，请使用此作业提供输入项 `message` 的值：

source: Before we run this, let us look at each step in a little more detail. The base command `baseCommand: ["sh", "example.sh"]` will execute the command `sh example.sh`. This will run the file we create in the shell.
ja: これを実行する前に、各ステップをもう少し詳しく見てみましょう。ベースコマンド`baseCommand: ["sh", "example.sh"]` は、`sh example.sh` というコマンドを実行します。これで、作成したファイルがシェルで実行されます。
ru: Прежде чем приступить к выполнению, давайте рассмотрим каждый шаг немного подробнее. Базовая команда `baseCommand: ["sh", "example.sh"]` выполнит команду `sh example.sh`. Это приведет к запуску файла, который мы создали в оболочке.
ta: இதை இயக்குவதற்கு முன், ஒவ்வொரு அடியையும் இன்னும் கொஞ்சம் விரிவாகப் பார்ப்போம். அடிப்படை கட்டளை `baseCommand: ["sh", "example.sh"]`என்ற கட்டளையை இயக்கும் `sh example.sh`. இது செல்லில் நாம் உருவாக்கும் கோப்பை இயக்கும்.
zh_hans: 运行前，我们来细看一下每个步骤。基础命令 `baseCommand: ["sh", "example.sh"]` 将执行的命令是 `sh example.sh`. 这将在 shell 中运行我们创建的文件。

source: `InitialWorkDirRequirement` requires a `listing`. As the `listing` is a YAML array, we need a `-` on the first line of each element of the array, in this case we have just one element. `entryname:` can have any value, but it must match what was specified in the `baseCommand`. The final part is `entry:`, this is followed by `|-` which is YAML quoting syntax, and means that you are using a multiline string (without it, we would need to write the whole script on one line).
ru: Для `InitialWorkDirRequirement` требуется `список`. Поскольку `список` - это массив YAML, нам нужен `-` в первой строке каждого элемента массива, в данном случае у нас только один элемент. `Имя входа:` может иметь любое значение, но оно должно совпадать с тем, что было указано в `базовой команде`. Последняя часть - `entry:`, за ней следует `|-`, что является синтаксисом кавычек YAML и означает, что вы используете многострочную строку (без этого нам пришлось бы писать весь скрипт в одну строку).
ta: `SiturtWorkDirRequirement க்கு` பட்டியல்` தேவை. `பட்டியல்` ஒரு YAML வரிசை என்பதால், வரிசையின் ஒவ்வொரு உறுப்பின் முதல் வரியில் எங்களுக்கு`-'தேவை, இந்த விசயத்தில் எங்களிடம் ஒரு உறுப்பு மட்டுமே உள்ளது. `நுழைவு பெயர்:` எந்த மதிப்பும் இருக்க முடியும், ஆனால் அது `பேச் கமாண்டில்` குறிப்பிடப்பட்டவற்றுடன் பொருந்த வேண்டும். இறுதி பகுதி `நுழைவு:`, இதைத் தொடர்ந்து `| --` இது யேம்ல் தொடரியல் மேற்கோள் காட்டுகிறது, மேலும் நீங்கள் ஒரு மல்டிலைன் சரம் பயன்படுத்துகிறீர்கள் என்று பொருள் (அது இல்லாமல், முழு ச்கிரிப்டையும் ஒரு வரியில் எழுத வேண்டும்).
zh_hans: `InitialWorkDirRequirements` 需要一个 `listing`。由于 `listing` 是个 YAML 数组，我们需要在数组每个元素的首行添加一个 `-` 字符，不过本示例中只有一个元素。`entryname:` 可以取任何值，但它必须与 `baseCommand` 中指定的值相匹配。最后的部分是 `entry:`，后面跟着 `|-`，这是 YAML 中表示引用的语法，意味着此处使用的是多行字符串（要是没有它，我们就得将整个脚本写在同一行之内）。

source: See the [YAML Guide](../topics/yaml-guide.md#maps) for more about the formatting.
ja: フォーマットについては、[YAMLガイド](../topics/yaml-guide.md#maps)を参照してください。
ru: Подробнее о форматировании см. в [Руководстве по YAML](../topics/yaml-guide.md#maps).
ta: வடிவமைப்பைப் பற்றி மேலும் அறிய [YAML வழிகாட்டி](../topics/yaml-guide.md#maps) ஐப் பார்க்கவும்.
zh_hans: 请参阅[《YAML 指南》 ](../topics/yaml-guide.md#maps) ，进一步了解代码格式。

source: Now invoke `cwltool` with the tool description and the input object on the command line:
ja: ここで、コマンドラインにツール定義と入力オブジェクトを指定して、`cwltool` を起動します：
ru: Теперь вызовите `cwltool` с описанием инструмента и входным объектом в командной строке:
ta: இப்போது கருவி விளக்கம் மற்றும் கட்டளை வரியில் உள்ளீட்டு பொருளுடன் `CWLTool` ஐ அழைக்கவும்:
zh_hans: 现在，在命令行上以工具描述和输入对象为参数调用 `cwltool`:

source: Custom Types
ja: カスタムタイプ
ru: Пользовательские типы
ta: தனிப்பயன் வகைகள்
zh_hans: 自定义类型
