Repository: common-workflow-language/user_guide
Catalog: locales/*/LC_MESSAGES/user_guide.po
Languages: ja, ru, ta, zh_hans

source: From [CommandInputParameter](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandInputParameter)
ja: [CommandInputParameter](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandInputParameter) から
ru: Из [CommandInputParameter](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandInputParameter)
ta: [CommandInputParameter](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandInputParameter) இலிருந்து
zh_hans: 来自 [CommandInputParameter](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandInputParameter)

source: From [`inputBinding`](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandLineBinding)
ja: [`inputBinding`](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandLineBinding) から
ru: Из [`inputBinding`](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandLineBinding)
ta: [`inputBinding`](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandLineBinding) இலிருந்து
zh_hans: 来自 [`inputBinding`](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandLineBinding)

source: From [CommandOutputParamater](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandOutputParameter)
ja: [CommandOutputParamater](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandOutputParameter) から
ru: Из [CommandOutputParamater](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandOutputParameter)
ta: [CommandOutputParamater](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandOutputParameter) இலிருந்து
zh_hans: 来自 [CommandOutputParamater](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandOutputParameter)

source: From [CommandOutputBinding](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandOutputBinding)
ja: [CommandOutputBinding](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandOutputBinding) から
ru: Из [CommandOutputBinding](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandOutputBinding)
ta: [CommandOutputBinding](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandOutputBinding) இலிருந்து
zh_hans: 来自 [CommandOutputBinding](http://www.commonwl.org/v1.0/CommandLineTool.html#CommandOutputBinding)

source: From [InputParameter](http://www.commonwl.org/v1.0/Workflow.html#InputParameter) and [WorkflowOutputParameter](http://www.commonwl.org/v1.0/Workflow.html#WorkflowOutputParameter)
ja: [InputParameter](http://www.commonwl.org/v1.0/Workflow.html#InputParameter) と [WorkflowOutputParameter](http://www.commonwl.org/v1.0/Workflow.html#WorkflowOutputParameter) から
ru: Из [InputParameter](http://www.commonwl.org/v1.0/Workflow.html#InputParameter) и [WorkflowOutputParameter](http://www.commonwl.org/v1.0/Workflow.html#WorkflowOutputParameter)
ta: இருந்து [InputParameter](http://www.commonwl.org/v1.0/Workflow.html#InputParameter) and [WorkflowOutputParameter](http://www.commonwl.org/v1.0/Workflow.html#WorkflowOutputParameter)
zh_hans: 来自[InputParameter](http://www.commonwl.org/v1.0/Workflow.html#InputParameter) 和 [WorkflowOutputParameter](http://www.commonwl.org/v1.0/Workflow.html#WorkflowOutputParameter)

source: From [WorkflowStepInput](http://www.commonwl.org/v1.0/Workflow.html#WorkflowStepInput)
ja: [WorkflowStepInput](http://www.commonwl.org/v1.0/Workflow.html#WorkflowStepInput) から
ru: Из [WorkflowStepInput](http://www.commonwl.org/v1.0/Workflow.html#WorkflowStepInput)
ta: [WorkflowStepInput](http://www.commonwl.org/v1.0/Workflow.html#WorkflowStepInput) இலிருந்து
zh_hans: 来自 [WorkflowStepInput](http://www.commonwl.org/v1.0/Workflow.html#WorkflowStepInput)

source: From [InputParameter](http://www.commonwl.org/v1.0/Workflow.html#InputParameter) and [ExpressionToolOutputParameter](http://www.commonwl.org/v1.0/Workflow.html#ExpressionToolOutputParameter)
ja: [InputParameter](http://www.commonwl.org/v1.0/Workflow.html#InputParameter) と [ExpressionToolOutputParameter](http://www.commonwl.org/v1.0/Workflow.html#ExpressionToolOutputParameter) から
ru: Из [InputParameter](http://www.commonwl.org/v1.0/Workflow.html#InputParameter) и [ExpressionToolOutputParameter](http://www.commonwl.org/v1.0/Workflow.html#ExpressionToolOutputParameter)
ta: இருந்து [InputParameter](http://www.commonwl.org/v1.0/Workflow.html#InputParameter) and [ExpressionToolOutputParameter](http://www.commonwl.org/v1.0/Workflow.html#ExpressionToolOutputParameter)
zh_hans: 来自 [InputParameter](http://www.commonwl.org/v1.0/Workflow.html#InputParameter) 和 [ExpressionToolOutputParameter](http://www.commonwl.org/v1.0/Workflow.html#ExpressionToolOutputParameter)

source: From [`ResourceRequirement`](http://www.commonwl.org/v1.0/CommandLineTool.html#ResourceRequirement)
ja: [`ResourceRequirement`](http://www.commonwl.org/v1.0/CommandLineTool.html#ResourceRequirement) から
ru: Из [`ResourceRequirement`](http://www.commonwl.org/v1.0/CommandLineTool.html#ResourceRequirement)
ta: [`ResourceRequirement`](http://www.commonwl.org/v1.0/CommandLineTool.html#ResourceRequirement) இலிருந்து
zh_hans: 来自 [`ResourceRequirement`](http://www.commonwl.org/v1.0/CommandLineTool.html#ResourceRequirement)

source: From [`InitialWorkDirRequirement`](http://www.commonwl.org/v1.0/CommandLineTool.html#InitialWorkDirRequirement)
ja: [`InitialWorkDirRequirement`](http://www.commonwl.org/v1.0/CommandLineTool.html#InitialWorkDirRequirement) から
ru: Из [`InitialWorkDirRequirement`](http://www.commonwl.org/v1.0/CommandLineTool.html#InitialWorkDirRequirement)
ta: [`InitialWorkDirRequirement`](http://www.commonwl.org/v1.0/CommandLineTool.html#InitialWorkDirRequirement) இலிருந்து
zh_hans: 来自 [`InitialWorkDirRequirement`](http://www.commonwl.org/v1.0/CommandLineTool.html#InitialWorkDirRequirement)

source: in [Dirent](http://www.commonwl.org/v1.0/CommandLineTool.html#Dirent)
ja: [Dirent](http://www.commonwl.org/v1.0/CommandLineTool.html#Dirent) の中に
ru: в [Dirent](http://www.commonwl.org/v1.0/CommandLineTool.html#Dirent)
ta: [Dirent](http://www.commonwl.org/v1.0/CommandLineTool.html#Dirent) இல்
zh_hans: [Dirent](http://www.commonwl.org/v1.0/CommandLineTool.html#Dirent) 对象中

source: From [EnvironmentDef](http://www.commonwl.org/v1.0/CommandLineTool.html#EnvironmentDef)
ja: [EnvironmentDef](http://www.commonwl.org/v1.0/CommandLineTool.html#EnvironmentDef) から
ru: Из [EnvironmentDef](http://www.commonwl.org/v1.0/CommandLineTool.html#EnvironmentDef)
ta: [EnvironmentDef](http://www.commonwl.org/v1.0/CommandLineTool.html#EnvironmentDef) இலிருந்து
zh_hans: 来自 [EnvironmentDef](http://www.commonwl.org/v1.0/CommandLineTool.html#EnvironmentDef)

source: Requirements and Hints
ja: Requirements と Hints
ru: Требования и советы
ta: தேவைகள் மற்றும் குறிப்புகள்
zh_hans: 需求和提示

source: Specifying Software Requirements
ja: ソフトウェア要求事項の指定
ru: Определение требований к программному обеспечению
ta: மென்பொருள் தேவைகளைக் குறிப்பிடுகிறது
zh_hans: 指定软件需求

source: Often, tool descriptions will be written for a specific version of a software. To make it easier for others to use your descriptions, you can include a `SoftwareRequirement` field in the `hints` section. This may also help to avoid confusion about which version of a tool the description was written for.
ru: Часто описания инструментов пишутся для определенной версии программного обеспечения. Чтобы другим было проще использовать ваши описания, вы можете включить поле `SoftwareRequirement` в раздел `hints`. Это также поможет избежать путаницы в вопросе о том, для какой версии инструмента было написано описание.
ta: பெரும்பாலும், ஒரு மென்பொருளின் குறிப்பிட்ட பதிப்பிற்கு கருவி விளக்கங்கள் எழுதப்படும். உங்கள் விளக்கங்களைப் பயன்படுத்துவதை மற்றவர்களுக்கு எளிதாக்குவதற்கு, `குறிப்புகள்` பிரிவில்` சாப்ட்வேர் ரெக்யூமென்ட்` புலத்தை சேர்க்கலாம். விளக்கம் ஒரு கருவியின் எந்த பதிப்பில் எழுதப்பட்டது என்பது குறித்த குழப்பத்தைத் தவிர்க்க இது உதவக்கூடும்.
zh_hans: 工具描述往往是针对特定版本的软件而编写。为了方便他人使用您的工具描述，您可以在 `hints` 部分添加`SoftwareRequirement` 字段，用来指明该描述适用于哪些版本的工具。

source: In this example, the software requirement being described is InterProScan version 5.21-60.
ja: この例では、定義されるソフトウェア要件はInterProScanバージョン5.21-60です。
ru: В данном примере описываемое программное обеспечение - это InterProScan версии 5.21-60.
ta: இந்த எடுத்துக்காட்டில், விவரிக்கப்படும் மென்பொருள் தேவை இன்டர்ரோச்கான் பதிப்பு 5.21-60 ஆகும்.
zh_hans: 本例中描述的软件要求为 5.21-60 版本的 InterProScan.

source: Depending on your CWL runner, these hints may be used to check that the required software is installed and available before the job is run. To enable these checks with the reference implementation, use the [dependency resolvers configuration][dependencies].
ja: CWLランナーによっては、これらのヒントを使用して、ジョブの実行前に必要なソフトウェアがインストールされ、利用可能であることをチェックすることができます。リファレンス実装でこれらのチェックを有効にするには、[依存性解決のための設定][dependencies] を使用します。
ru: В зависимости от используемой программы запуска CWL, эти подсказки могут использоваться для проверки того, что необходимое программное обеспечение установлено и доступно до запуска задания. Чтобы включить эти проверки в эталонной реализации, воспользуйтесь параметром [dependency resolvers configuration][dependencies].
ta: உங்கள் சி.டபிள்யூ.எல் ரன்னரைப் பொறுத்து, தேவையான மென்பொருள் நிறுவப்பட்டுள்ளதா என்பதைச் சரிபார்க்க இந்த குறிப்புகள் பயன்படுத்தப்படலாம் மற்றும் வேலை இயங்குவதற்கு முன்பு கிடைக்கிறது. குறிப்பு செயல்படுத்தலுடன் இந்த காசோலைகளை இயக்க, [சார்பு தீர்வுகள் உள்ளமைவு][dependencies] ஐப் பயன்படுத்தவும்.
zh_hans: 您的 CWL 运行程序有可能支持在运行作业之前，根据提示检查所需软件是否已安装就绪。如果要让参考实现启用这些检查，请使用[依赖项解析配置][dependencies]。

source: As well as a version number, a unique resource identifier (URI) for the tool is given in the form of an [RRID][rrid]. Resources with RRIDs can be looked up in the [SciCrunch][scicrunch] registry, which provides a portal for finding, tracking, and referring to scientific resources consistently. If you want to specify a tool as a `SoftwareRequirement`, search for the tool on SciCrunch and use the RRID that it has been assigned in the registry. (Follow this [Adding a Resource Tutorial][scicrunch-add-tool] to add a tool to SciCrunch). You can use this RRID to refer to the tool (via [identifiers.org][identifiers]) in the `specs` field of your requirement description. Other good choices, in order of preference, are to include the DOI for the main tool citation and the URL to the tool.
ru: Помимо номера версии, для инструмента указывается уникальный идентификатор ресурса (URI) в виде [RRID][rrid]. Ресурсы с RRID могут быть найдены в реестре [SciCrunch][scicrunch], который предоставляет портал для поиска, отслеживания и последовательного обращения к научным ресурсам. Если вы хотите указать инструмент в качестве `SoftwareRequirement`, найдите его на SciCrunch и используйте RRID, присвоенный ему в реестре. (Следуйте этому [Adding a Resource Tutorial][scicrunch-add-tool], чтобы добавить инструмент в SciCrunch). Вы можете использовать этот RRID для ссылки на инструмент (через [identifiers.org][identifiers]) в поле `specs` вашего описания требований. Другими хорошими вариантами, в порядке предпочтения, являются включение DOI для основного цитирования инструмента и URL-адреса инструмента.
ta: ஒரு பதிப்பு எண், கருவிக்கான தனித்துவமான வள அடையாளங்காட்டி (URI) ஒரு [RRID][rrid] வடிவத்தில் கொடுக்கப்பட்டுள்ளது. RRIDS உடனான வளங்களை [SciCrunch][scicrunch] பதிவேட்டில் பார்க்கலாம், இது விஞ்ஞான வளங்களைக் கண்டறிதல், கண்காணித்தல் மற்றும் குறிப்பிடுவதற்கான ஒரு போர்ட்டலை வழங்குகிறது. நீங்கள் ஒரு கருவியை `SoftwareRequirement` எனக் குறிப்பிட விரும்பினால், ச்கைசஞ்ச் மீது கருவியைத் தேடுங்கள் மற்றும் பதிவேட்டில் ஒதுக்கப்பட்டுள்ள RRID ஐப் பயன்படுத்தவும். உங்கள் தேவை விளக்கத்தின் `specs` புலத்தில் உள்ள கருவியைக் ([அடையாளங்காட்டிகள்.ஆர்ச்][scicrunch-add-tool] வழியாக) குறிப்பிட இந்த RRID ஐப் பயன்படுத்தலாம். பிற நல்ல தேர்வுகள், விருப்பத்தின் வரிசையில், முக்கிய கருவி மேற்கோளுக்கான DOI மற்றும் கருவிக்கு முகவரி ஐ சேர்க்க வேண்டும்.
zh_hans: 除了版本号之外，该工具的唯一资源标识符 (URI) 以 [RRID][rrid] 的形式给出。可以在 [SciCrunch][scicrunch] 注册表中查找具有 RRID 的资源，该注册表提供了一个用于查找、跟踪和一致引用科学资源的门户。如果要将工具指定为 `SoftwareRequirement`，请在 SciCrunch 上搜索该工具并使用在注册表中分配的 RRID。 （按照 [添加资源教程][scicrunch-add-tool] 将工具添加到 SciCrunch）。您可以使用此 RRID 在需求描述的 `specs` 字段中引用该工具（通过 [identifiers.org][identifiers]）。其他不错的选择（按优先顺序）包括主要工具引用的 DOI 和工具的 URL。

source: Staging Input Files
ja: 入力ファイルのステージング
ru: Постановка входных файлов
ta: உள்ளீட்டு கோப்புகளை நடத்துதல்
zh_hans: 暂存输入文件

source: Normally, input files are located in a read-only directory separate from the output directory. This causes problems if the underlying tool expects to write its output files alongside the input file in the same directory. You use `InitialWorkDirRequirement` to stage input files into the output directory. In this example, we use a JavaScript expression to extract the base name of the input file from its leading directory path.
ru: Обычно входные файлы располагаются в каталоге, доступном только для чтения, отдельно от выходного каталога. Это приводит к проблемам, если базовый инструмент ожидает записи своих выходных файлов рядом с входным файлом в том же каталоге. Вы используете `InitialWorkDirRequirement`, чтобы поместить входные файлы в выходной каталог. В этом примере мы используем выражение JavaScript для извлечения базового имени входного файла из его ведущего пути к каталогу.
ta: பொதுவாக, உள்ளீட்டு கோப்புகள் வெளியீட்டு கோப்பகத்திலிருந்து தனித்தனியாக வாசிப்பு மட்டும் கோப்பகத்தில் அமைந்துள்ளன. அதே கோப்பகத்தில் உள்ளீட்டு கோப்போடு அதன் வெளியீட்டு கோப்புகளை எழுத அடிப்படை கருவி எதிர்பார்க்கிறது என்றால் இது சிக்கல்களை ஏற்படுத்துகிறது. வெளியீட்டு கோப்பகத்தில் உள்ளீட்டு கோப்புகளை நிலைநிறுத்த நீங்கள் `SiturtWorkWorkDirRequirement` ஐப் பயன்படுத்துகிறீர்கள். இந்த எடுத்துக்காட்டில், உள்ளீட்டுக் கோப்பின் அடிப்படை பெயரை அதன் முன்னணி அடைவு பாதையில் இருந்து பிரித்தெடுக்க சாவாச்கிரிப்ட் வெளிப்பாட்டைப் பயன்படுத்துகிறோம்.
zh_hans: 通常，输入文件位于独立于输出目录的只读目录中。 如果基础工具希望将其输出文件与输入文件一起写入同一目录中，则会导致问题。 使用 `InitialWorkDirRequirement` 将输入文件暂存到输出目录中。在此示例中，我们使用 JavaScript 表达式从输入文件的前导目录路径中提取该文件的基本名称。

source: Troubleshooting
ja: トラブルシューティング
ru: Устранение неполадок
ta: சரிசெய்தல்
zh_hans: 疑难解答

source: In this section you will find ways to troubleshoot when you have problems executing CWL. We focus on `cwltool` here but some of these techniques may apply to other CWL Runners.
ja: このセクションでは、CWLの実行に問題がある場合にトラブルシューティングを行う方法を説明します。ここでは、`cwltool` に焦点を当てますが、これらのテクニックのいくつかは他のCWLランナーにも適用されるかもしれません。
ru: В этом разделе вы найдете способы устранения неполадок, когда возникают проблемы при выполнении CWL. Здесь мы сосредоточимся на `cwltool`, но некоторые из этих методов могут быть применимы и к другим CWL Runners.
ta: இந்த பிரிவில் சி.டபிள்யூ.எல் செயல்படுத்துவதில் சிக்கல் இருக்கும்போது சரிசெய்ய வழிகளைக் காண்பீர்கள். நாங்கள் இங்கே `cwltool` இல் கவனம் செலுத்துகிறோம், ஆனால் இந்த நுட்பங்களில் சில பிற CWL ஓட்டப்பந்தய வீரர்களுக்கு பொருந்தும்.

source: Run `cwltool` with `cachedir`
ja: `cwltool` を`cachedir` で実行する
ru: Запустите `cwltool` с `cachedir`
ta: `கேசெடிர்` உடன்` cwltool` ஐ இயக்கவும்

source: You can use the `--cachedir` option when running a workflow to tell `cwltool` to cache intermediate files (files that are not input nor output files, but created while your workflow is running). By default, these files are created in a temporary directory but writing them to a separate directory makes accessing them easier.
ja: ワークフロー実行時に`--cachedir` オプションを使用すると、`cwltool` に中間ファイル（入力ファイルでも出力ファイルでもないが、ワークフロー実行中に作成されるファイル）をキャッシュするよう指示することができます。デフォルトでは、これらのファイルは一時ディレクトリに作成されますが、別のディレクトリに書き込むことでアクセスが容易になります。
ru: Вы можете использовать опцию `--cachedir` при запуске рабочего процесса, чтобы указать `cwltool` кэшировать промежуточные файлы (файлы, которые не являются ни входными, ни выходными, но создаются во время выполнения рабочего процесса). По умолчанию эти файлы создаются во временном каталоге, но их запись в отдельный каталог упрощает доступ к ним.
ta: இடைநிலை கோப்புகளை கேச் செய்ய `cwltool` என்று சொல்ல ஒரு பணிப்பாய்வுகளை இயக்கும் போது நீங்கள்`--cachedir` விருப்பத்தைப் பயன்படுத்தலாம் (உள்ளீடு அல்லது வெளியீட்டு கோப்புகள் அல்ல, ஆனால் உங்கள் பணிப்பாய்வு இயங்கும் போது உருவாக்கப்பட்டது). இயல்பாக, இந்த கோப்புகள் ஒரு தற்காலிக கோப்பகத்தில் உருவாக்கப்படுகின்றன, ஆனால் அவற்றை ஒரு தனி கோப்பகத்திற்கு எழுதுவது அவற்றை அணுகுவதை எளிதாக்குகிறது.

source: In the following example `troubleshooting-wf1.cwl` we have two steps, `step_a` and `step_b`. The workflow is equivalent to `echo "Hello World" | rev`, which would print the message "Hello World" reversed, i.e. "dlroW olleH". However, the second step, `step_b`, **has a typo**, where instead of executing the `rev` command it tries to execute `revv`, which fails.
ja: 次の例では、`troubleshooting-wf1.cwl` ` step_a` と`step_b` という2つのステップを用意しています。このワークフローは、`echo "Hello World" | rev` と同等で、"Hello World" というメッセージを反転して、すなわち "dlroW olleH" と表示します。しかし、2番目のステップである`step_b`,**にはタイプミス** があり、`rev` コマンドを実行する代わりに`revv` を実行しようとし、失敗しています。
ru: В следующем примере `troubleshooting-wf1.cwl` у нас есть два шага, `step_a` и `step_b`. Этот шаг эквивалентен команде `echo "Hello World" | rev`, которая выведет сообщение "Hello World" в обратном порядке, т. е. "dlroW olleH". Однако второй шаг, `step_b`, **содержит опечатку**, когда вместо команды `rev` он пытается выполнить `revv`, что не удается.
ta: பின்வரும் எடுத்துக்காட்டில் `சரிசெய்தல்-wf1.cwl` எங்களுக்கு இரண்டு படிகள் உள்ளன,` step_a` மற்றும் `step_b`. பணிப்பாய்வு `எதிரொலி" அலோ வேர்ல்ட் "| க்கு சமம் ரெவ்`, இது "அலோ வேர்ல்ட்" என்ற செய்தியை அச்சிடும், அதாவது "டி.எல்ரோ ஓலே". இருப்பினும், இரண்டாவது படி, `Step_b`, ** ஒரு எழுத்துப்பிழை ** உள்ளது, அங்கு` ரெவ்` கட்டளையை இயக்குவதற்கு பதிலாக, அது தோல்வியுற்ற `ரெவ்.வி` ஐ இயக்க முயற்சிக்கிறது.

source: `troubleshooting-wf1.cwl`
ta: `சரிசெய்தல்-wf1.cwl`

source: Let's execute this workflow with `/tmp/cachedir/` as the `--cachedir` value (`cwltool` will create the directory for you if it does not exist already):
ru: Давайте выполним этот рабочий процесс с `/tmp/cachedir/` в качестве значения `--cachedir` (`cwltool` создаст каталог, если он еще не существует):
ta: இந்த பணிப்பாய்வுகளை `/tmp/cachedir/` உடன் `--cachedir` மதிப்பு (` cwltool` இது ஏற்கனவே இல்லையென்றால் உங்களுக்காக கோப்பகத்தை உருவாக்கும்):

source: The workflow is in the `permanentFail` status due to `step_b` failing to execute the non-existent `revv` command. The `step_a` was executed successfully and its output has been cached in your `cachedir` location. You can inspect the intermediate files created:
ja: `step_b` が存在しない `revv` コマンドの実行に失敗したため、ワークフローは `permanentFail` ステータスになっています。`step_a` は正常に実行され、その出力は `cachedir` にキャッシュされました。作成された中間ファイルを確認することができます：
ru: Рабочий процесс находится в состоянии `постоянного отказа` из-за того, что `шаг_b` не смог выполнить несуществующую команду `revv`. Шаг `step_a` был выполнен успешно, и его результаты были кэшированы в вашем расположении `cachedir`. Вы можете просмотреть созданные промежуточные файлы:
ta: `STEP_B` இல்லாத` ரெவ்.வி` கட்டளையை இயக்கத் தவறியதால் பணிப்பாய்வு `நிரந்தர வால்` நிலையில் உள்ளது. `STEP_A` வெற்றிகரமாக செயல்படுத்தப்பட்டது மற்றும் அதன் வெளியீடு உங்கள்` கேசெடிர்` இடத்தில் தற்காலிகமாக சேமிக்கப்பட்டுள்ளது. உருவாக்கப்பட்ட இடைநிலை கோப்புகளை நீங்கள் ஆய்வு செய்யலாம்:

source: Each workflow step has received a unique ID (the long value that looks like a hash). The `${HASH}.status` files display the status of each step executed by the workflow. And the `step_a` output file `stdout.txt` is visible in the output of the command above.
ru: Каждый шаг рабочего процесса получил уникальный ID (длинное значение, похожее на хэш). Файлы `${HASH}.status` отображают статус каждого шага, выполняемого рабочим процессом. А выходной файл `stdout.txt` шага `step_a` виден в выводе команды выше.
ta: ஒவ்வொரு பணிப்பாய்வு படி ஒரு தனித்துவமான ஐடியைப் பெற்றுள்ளது (ஒரு ஆச் போல தோற்றமளிக்கும் நீண்ட மதிப்பு). `$ {HASH} .ச்டேட்டச்` கோப்புகள் பணிப்பாய்வுகளால் செயல்படுத்தப்படும் ஒவ்வொரு அடியின் நிலையையும் காண்பிக்கும். `STEP_A` வெளியீட்டு கோப்பு` stdout.txt` மேலே உள்ள கட்டளையின் வெளியீட்டில் தெரியும்.

source: Now fix the typo so `step_b` executes `rev` (i.e. replace `revv` by `rev` in the `step_b`). After fixing the typo, when you execute `cwltool` with the same arguments as the previous time, note that now `cwltool` output contains information about pre-cached outputs for `step_a`, and about a new cache entry for the output of `step_b`. Also note that the status of `step_b` is now of success.
ja: `step_b` が`rev` を実行するように、タイプミスを修正します（すなわち、`step_b` の`revv` を`rev` で置き換えます）。タイプミスを修正した後、前回と同じ引数で`cwltool` を実行すると、`cwltool` の出力に、`step_a` の出力が事前にキャッシュされていることと、`step_b` の出力の新しいキャッシュ・エントリーがあることがわかります。また、`step_b` のステータスは、今度は、成功であることに注目してください。
ru: Теперь исправьте опечатку, чтобы `step_b` выполнял `rev` (т.е. замените `revv` на `rev` в `step_b`). После исправления опечатки, когда вы выполните `cwltool` с теми же аргументами, что и в предыдущий раз, обратите внимание, что теперь вывод `cwltool` содержит информацию о предварительно кэшированных выводах для `step_a`, а также о новой записи в кэше для вывода `step_b`. Также обратите внимание, что статус `step_b` теперь успешный.
ta: இப்போது எழுத்துப்பிழையை சரிசெய்யவும், எனவே `step_b` செயல்படுத்துகிறது` rev` (அதாவது `revv` ஆல்` rev` ஆல் `step_b`). எழுத்துப்பிழையை சரிசெய்த பிறகு, முந்தைய நேரத்தின் அதே வாதங்களுடன் `cwltool` ஐ இயக்கும்போது, இப்போது` cwltool` வெளியீட்டில் `Step_a` க்கான முன்-தற்காலிக வெளியீடுகள் பற்றிய தகவல்கள் உள்ளன, மேலும்` step_b`. `STEP_B` இன் நிலை இப்போது வெற்றிபெறுகிறது என்பதையும் நினைவில் கொள்க.

source: In this example the workflow step `step_a` was not re-evaluated as it had been cached, and there was no change in its execution or output. Furthermore, `cwltool` was able to recognize when it had to re-evaluate `step_b` after we fixed the executable name. This technique is useful for troubleshooting your CWL documents and also as a way to prevent `cwltool` to re-evaluate steps unnecessarily.
ja: この例では、ワークフローのステップ`step_a` はキャッシュされていたため再実行されず、その実行や出力に変化はありませんでした。さらに、`cwltool` は、実行したいコマンド名を修正した後、`step_b` を再実行する必要があることがわかりました。このテクニックは、CWL文書のトラブルシューティングに役立つだけでなく、`cwltool` が不必要にステップを再実行するのを防ぐ方法としても有効です。
ru: В этом примере шаг рабочего процесса `step_a` не был переоценен, поскольку он был кэширован, и никаких изменений в его выполнении или выходе не произошло. Более того, `cwltool` смог распознать, когда ему нужно было повторно оценить `step_b` после того, как мы исправили имя исполняемого файла. Эта техника полезна для устранения неполадок в документах CWL, а также как способ предотвратить ненужную переоценку шагов программой `cwltool`.
ta: இந்த எடுத்துக்காட்டில், பணிப்பாய்வு படி `STEP_A` இது தற்காலிக சேமிப்பு செய்யப்பட்டதால் மீண்டும் மதிப்பீடு செய்யப்படவில்லை, மேலும் அதன் சாவுஒறுப்பு அல்லது வெளியீட்டில் எந்த மாற்றமும் இல்லை. மேலும், நாங்கள் இயங்கக்கூடிய பெயரை சரிசெய்த பிறகு `Step_b` ஐ மறு மதிப்பீடு செய்ய வேண்டியிருந்தபோது` cwltool` அடையாளம் காண முடிந்தது. இந்த நுட்பம் உங்கள் சி.டபிள்யூ.எல் ஆவணங்களை சரிசெய்ய பயனுள்ளதாக இருக்கும், மேலும் `cwltool` ஐ தேவையில்லாமல் மறு மதிப்பீடு செய்வதைத் தடுப்பதற்கான ஒரு வழியாகும்.

source: Using Containers
ja: コンテナの使用
ru: Использование контейнеров
ta: கொள்கலன்களைப் பயன்படுத்துதல்

source: Running Tools Inside Docker
ja: Dockerの内部でツールを実行する
ru: Запуск инструментов внутри Docker
ta: டோக்கருக்குள் இயங்கும் கருவிகள்
