Repository: common-workflow-language/user_guide
Catalog: locales/*/LC_MESSAGES/user_guide.po
Languages: ja, ru, ta, zh_hans

source: If installing the cwltool using the pip command doesn't work for you, the [prerequisites](prerequisites.md) section contains other ways to install `cwltool` and a more detailed list of software and libraries used for following the rest of this user guide.
ja: pipコマンドを使用してcwltoolをインストールしてもうまくいかない場合は、[前提条件](prerequisites.md)セクションに、`cwltool` をインストールする他の方法と、このユーザーガイドの残りの部分を追うために使用するソフトウェアとライブラリのより詳細なリストがあります。
ru: Если установка cwltool с помощью команды pip вам не подходит, в разделе [prerequisites](prerequisites.md) приведены другие способы установки `cwltool` и более подробный список программного обеспечения и библиотек, используемых в остальной части этого руководства пользователя.
ta: PIP கட்டளையைப் பயன்படுத்தி CWLTool ஐ நிறுவுவது உங்களுக்காக வேலை செய்யாது என்றால், [முன்நிபந்தனைகள்](prerequisites.md) பிரிவில் `cwltool` ஐ நிறுவ பிற வழிகள் உள்ளன, மேலும் இந்த பயனரின் மீதமுள்ளவற்றை பின்பற்ற பயன்படுத்தப்படும் மென்பொருள் மற்றும் நூலகங்களின் விரிவான பட்டியலையும் கொண்டுள்ளது வழிகாட்டி.
zh_hans: 如果您无法用 pip 命令安装 cwltool，请参阅[《学习前的准备》](prerequisites.md) 一节，了解安装 `cwltool` 的其他方法，以及继续学习《用户指南》所需软件和库的详细列表。

source: Running "Hello World"
ja: "Hello World"を実行する
ru: Запуск "Hello World"
ta: "அலோ வேர்ல்ட்"
zh_hans: 运行“Hello World”

source: The usage of the `cwltool` command-line executable is basically `cwltool [OPTIONS] <CWL_DOCUMENT> [INPUTS_OBJECT]`. You can run the `hello_world.cwl` workflow without specifying any option:
ru: Исполняемый модуль командной строки `cwltool` используется в основном как `cwltool [OPTIONS] <CWL_DOCUMENT> [INPUTS_OBJECT]`. Вы можете запустить рабочий процесс `hello_world.cwl`, не указывая никаких опций:
ta: `Cwltool` கட்டளை-வரி இயங்கக்கூடிய பயன்பாடு அடிப்படையில்` cwltool [விருப்பங்கள்] <cwl_document> [inputs_object] `. எந்தவொரு விருப்பத்தையும் குறிப்பிடாமல் `Hello_world.cwl` பணிப்பாய்வுகளை இயக்கலாம்:
zh_hans: `cwltool` 命令行程序的基本用法是 `cwltool [选项] &lt;CWL 文件名&gt; [输入对象]`. 您可以不指定任何选项，直接运行 `hello_world.cwl` 工作流：

source: Running `hello_world.cwl` with `cwltool`.
ja: `hello_world.cwl` を `cwltool` で実行します。
ru: Запуск `hello_world.cwl` с помощью `cwltool`.
ta: `Cwltool` உடன்` Hello_world.cwl` ஐ இயக்குகிறது.
zh_hans: 使用 `cwltool` 运行 `hello_world.cwl`.

source: Or you can override the default value of the input parameter `message`, similar to how you would change the argument of the `echo` base command:
ja: また、`echo` base コマンドの引数を変更するのと同様に、入力パラメータ`message` のデフォルト値を上書きすることもできます：
ru: Или вы можете переопределить значение по умолчанию входного параметра `message`, подобно тому, как вы изменяете аргумент базовой команды `echo`:
ta: அல்லது `எதிரொலி` அடிப்படை கட்டளையின் வாதத்தை நீங்கள் எவ்வாறு மாற்றுவீர்கள் என்பதைப் போலவே, உள்ளீட்டு அளவுருவின் இயல்புநிலை மதிப்பை` செய்தியின் 'மேலெழுதலாம்:
zh_hans: 您还可以撤销输入参数 `message` 的默认值，有如更改 `echo` 基本命令的参数：

source: Running `hello_world.cwl` with `cwltool` passing an input parameter.
ja: `hello_world.cwl` を`cwltool` で入力パラメータを渡して実行する。
ru: Запуск `hello_world.cwl` с помощью `cwltool` с передачей входного параметра.
ta: `Cwltool` உடன் உள்ளீட்டு அளவுருவைக் கடந்து` hello_world.cwl` ஐ இயக்குகிறது.
zh_hans: 向 `cwltool` 传递输入参数值运行 `hello_world.cwl`.

source: Another way of passing values to your workflow input parameters is via an *Inputs Object*. This is a file containing the input fields with their corresponding values. The Inputs Objects file can be written in JSON or YAML. For example:
ja: ワークフロー入力パラメータに値を渡すもう一つの方法は、*Inputs Object* を介する方法です。これは、入力フィールドとその対応する値を含むファイルです。Inputs Objects ファイルは、JSON または YAML で記述することができます。例えば、以下のようになります：
ru: Другой способ передачи значений входным параметрам рабочего процесса - через объект *Inputs Object*. Это файл, содержащий поля ввода с соответствующими значениями. Файл Inputs Objects может быть записан в формате JSON или YAML. Например:
ta: உங்கள் பணிப்பாய்வு உள்ளீட்டு அளவுருக்களுக்கு மதிப்புகளை அனுப்ப மற்றொரு வழி *உள்ளீடுகள் பொருள் *வழியாகும். இது உள்ளீட்டு புலங்களைக் கொண்ட ஒரு கோப்பு, அவற்றின் தொடர்புடைய மதிப்புகளுடன். உள்ளீட்டு பொருள்கள் கோப்பை சாதொபொகு அல்லது YAML இல் எழுதலாம். உதாரணமாக:
zh_hans: 将值传递给工作流输入参数的另一种方法是利用*输入对象* (Inputs Object)。它是由输入字段及其相应值构成的文件，可使用 JSON 或 YAML 格式编写。例如：

source: You can use this Inputs Object file now to execute the “Hello World” workflow:
ja: このInputs Objectファイルを使用して、「Hello World」ワークフローを実行することができるようになりました：
ru: Теперь вы можете использовать этот файл Inputs Object для выполнения рабочего процесса "Hello World":
ta: “அலோ வேர்ல்ட்” பணிப்பாய்வுகளை இயக்க இந்த உள்ளீடுகள் பொருள் கோப்பை இப்போது பயன்படுத்தலாம்:
zh_hans: 这样就可以在执行“Hello World”工作流时使用此输入对象文件：

source: Passing an Inputs Object file to `cwltool`.
ja: `cwltool` に Inputs Object ファイルをします。
ru: Передача файла Inputs Object в `cwltool`.
ta: உள்ளீட்டு பொருள் கோப்பை `cwltool` க்கு அனுப்புகிறது.
zh_hans: 将输入对象文件传递给 `cwltool`.

source: We used a similar file name for the workflow and for the Inputs Object files. The *-job.json* suffix is very common in Inputs Object files, but it is not a requirement. You can choose any name for your workflows and Inputs Object files.
ja: ワークフローとInputs Objectファイルには、同様のファイル名を使用しました。*-job.json* という接尾辞は、Inputs Object ファイルでは非常に一般的ですが必須ではありません。ワークフローとInputs Objectファイルには、任意の名前を付けることができます。
ru: Мы использовали одинаковые имена файлов для рабочего процесса и для файлов объектов ввода. Суффикс *-job.json* очень часто встречается в файлах Inputs Object, но это не обязательное условие. Вы можете выбрать любое имя для своих рабочих процессов и файлов Inputs Object.
ta: பணிப்பாய்வு மற்றும் உள்ளீடுகள் பொருள் கோப்புகளுக்கு இதே போன்ற கோப்பு பெயரைப் பயன்படுத்தினோம். உள்ளீடுகள் பொருள் கோப்புகளில் * -job.json * பின்னொட்டு மிகவும் பொதுவானது, ஆனால் அது தேவையில்லை. உங்கள் பணிப்பாய்வு மற்றும் உள்ளீடுகள் பொருள் கோப்புகளுக்கான எந்த பெயரையும் நீங்கள் தேர்வு செய்யலாம்.
zh_hans: 我们为工作流和输入对象文件起了类似的文件名。输入对象文件名中的 *-job.json* 后缀是很常见的，但并非规定。工作流和输入对象文件的命名方式可由您任意选择。

source: Continue reading the next sections of this User Guide!
ja: このユーザーガイドの次のセクションを読み進めてください！
ru: Продолжайте читать следующие разделы этого руководства пользователя!
ta: இந்த பயனர் வழிகாட்டியின் அடுத்த பகுதிகளைப் படிக்கவும்!
zh_hans: 请继续阅读《用户指南》后续部分！

source: [List of CWL Implementations](https://www.commonwl.org/implementations).
ja: [CWL 実装一覧](https://www.commonwl.org/implementations)。
ru: [Список реализаций CWL](https://www.commonwl.org/implementations).
ta: [CWL செயல்படுத்தலின் பட்டியல்](https://www.commonwl.org/implementations).
zh_hans: [ 各种 CWL 实现汇总](https://www.commonwl.org/implementations)。

source: The [`common-workflow-language` organization](https://github.com/common-workflow-language) at GitHub.
ja: GitHubの[`common-workflow-language` organization](https://github.com/common-workflow-language)です。
ru: Организация [`common-workflow-language`](https://github.com/common-workflow-language) на GitHub.
ta: கிதுபில் [`பொதுவான-வேலை-மொழி-மொழி` அமைப்பு](https://github.com/common-workflow-language).
zh_hans: GitHub上的 [`common-workflow-language` 组织](https://github.com/common-workflow-language)。

source: [Common Workflow Language at Wikipedia](https://en.wikipedia.org/wiki/Common_Workflow_Language).
ja: [Wikipedia上のCommon Workflow Language](https://en.wikipedia.org/wiki/Common_Workflow_Language)。
ta: [Common Workflow மொழி at Wikipedia](https://en.wikipedia.org/wiki/Common_Workflow_Language).
zh_hans: [英文维基百科中的 Common Workflow Language 条目](https://en.wikipedia.org/wiki/Common_Workflow_Language)。

source: [YAML.org](http://yaml.org/) and [YAML at Wikipedia](https://en.wikipedia.org/wiki/YAML).
ja: [YAML.org](http://yaml.org/) と [WikipediaにあるYAML](https://en.wikipedia.org/wiki/YAML) です。
ru: [YAML.org](http://yaml.org/) и [YAML at Wikipedia](https://en.wikipedia.org/wiki/YAML).
ta: [YAML.org](http://yaml.org/) மற்றும் [விக்கியில் YAML](https://en.wikipedia.org/wiki/YAML).
zh_hans: [YAML.org](http://yaml.org/) 网站，以及[维基百科中的 YAML 条目](https://en.wikipedia.org/wiki/YAML)。

source: The {{'[CWL Specification VERSION](https://www.commonwl.org/VERSION)'.replace('VERSION', cwl_version_text) }}.
ja: {{'[CWL 仕様 VERSION](https://www.commonwl.org/VERSION)'.replace('VERSION', cwl_version_text) }} のことです。
ru: В качестве источника информации используется {{'[ВЕРСИЯ спецификации CWL](https://www.commonwl.org/VERSION)'.replace('ВЕРСИЯ', cwl_version_text)}}.
ta: {{'[CWL விவரக்குறிப்பு VERSION](https://www.commonwl.org/VERSION)' .replace ('VERSION', cwl_version_text)}}.
zh_hans: {{'[CWL 规约 VERSION 版](https://www.commonwl.org/VERSION)'.replace('VERSION', cwl_version_text) }}.

source: [Workflow management system at Wikipedia](https://en.wikipedia.org/wiki/Workflow_management_system).
ja: [Wikipediaの項目としてのワークフロー管理システム](https://en.wikipedia.org/wiki/Workflow_management_system)。
ru: [Система управления рабочими процессами в Википедии](https://en.wikipedia.org/wiki/Workflow_management_system).
ta: [Workflow management மண்டலம் at Wikipedia](https://en.wikipedia.org/wiki/Workflow_management_system).
zh_hans: [Wikipedia 条目 Workflow Management System ](https://en.wikipedia.org/wiki/Workflow_management_system).

source: This page is out-of-date and was kept here to preserve the links of the old User Guide. The information on this page has been migrated to the [FAQ](/faq.md) section of the new user guide.
ja: このページは古いもので、旧ユーザーガイドのリンクを保存するためにここに残されていました。このページの情報は、新しいユーザーガイドの [FAQ](/faq.md) セクションに移行されました。
ru: Эта страница устарела и была оставлена здесь, чтобы сохранить ссылки на старое руководство пользователя. Информация на этой странице была перенесена в раздел [FAQ](/faq.md) нового руководства пользователя.
ta: இந்த பக்கம் காலாவதியானது மற்றும் பழைய பயனர் வழிகாட்டியின் இணைப்புகளைப் பாதுகாக்க இங்கே வைக்கப்பட்டது. இந்த பக்கத்தில் உள்ள தகவல்கள் புதிய பயனர் வழிகாட்டியின் [கேள்விகள்](/faq.md) பகுதிக்கு இடம்பெயர்ந்துள்ளன.
zh_hans: 此页面已过时，存留在此仅用于保留旧《用户指南》链接。此页面上的内容已迁移到新《用户指南》的[《常见问题》](/faq.md)一节。

source: Additional Arguments and Parameters
ja: 追加の引数とパラメータ
ru: Дополнительные аргументы и параметры
ta: கூடுதல் வாதங்கள் மற்றும் அளவுருக்கள்
zh_hans: 附加参数

source: Sometimes tools require additional command line options that don't correspond exactly to input parameters.
ja: ツールには、入力パラメータに正確に対応しない追加のコマンドラインオプションが必要な場合があります。
ru: Иногда инструменты требуют дополнительных опций командной строки, которые не совсем соответствуют входным параметрам.
ta: சில நேரங்களில் கருவிகளுக்கு கூடுதல் கட்டளை வரி விருப்பங்கள் தேவைப்படுகின்றன, அவை உள்ளீட்டு அளவுருக்களுடன் சரியாக ஒத்துப்போகின்றன.
zh_hans: 有时，一些工具需要额外的命令行选项，但我们无法让它们与 (CWL) 输入参数一一对应。

source: In this example, we will wrap the Java compiler to compile a java source file to a class file. By default, "javac" will create the class files in the same directory as the source file. However, CWL input files (and the directories in which they appear) may be read-only, so we need to instruct "javac" to write the class file to the designated output directory instead.
ja: この例では、Javaコンパイラを使用して、javaソースファイルをclassファイルにコンパイルするようにラップします。 デフォルトでは、"javac "はjavaファイルと同じディレクトリにclassファイルを作成します。 しかし、CWLの入力ファイル（およびそのディレクトリ）は読み取り専用である場合があるので、代わりに指定された出力ディレクトリにclassファイルを書き込むように「javac」に指示する必要があります。
ru: В этом примере мы обернем компилятор Java, чтобы скомпилировать исходный файл java в файл класса. По умолчанию "javac" создаст файлы классов в том же каталоге, что и исходный файл. Однако входные файлы CWL (и каталоги, в которых они находятся) могут быть доступны только для чтения, поэтому нам нужно указать "javac" записать файл класса в указанный выходной каталог.
ta: இந்த எடுத்துக்காட்டில், சாவா மூல கோப்பை ஒரு வகுப்பு கோப்பில் தொகுக்க சாவா கம்பைலரை மடிக்கவும். இயல்பாக, "சாவாக்" வகுப்பு கோப்புகளை மூல கோப்பின் அதே கோப்பகத்தில் உருவாக்கும். இருப்பினும், சி.டபிள்யூ.எல் உள்ளீட்டு கோப்புகள் (மற்றும் அவை தோன்றும் கோப்பகங்கள்) படிக்க மட்டுமே இருக்கலாம், எனவே அதற்கு பதிலாக நியமிக்கப்பட்ட வெளியீட்டு கோப்பகத்திற்கு வகுப்பு கோப்பை எழுத "சாவாக்" அறிவுறுத்த வேண்டும்.
zh_hans: 本例中，我们将包装 Java 编译器，将 java 源文件编译为类 (class) 文件。 默认情况下，“javac” 将在源文件所在目录中创建类文件。 然而，CWL 输入文件（及其所在目录）可能是只读的，因此我们需要令 “javac” 将类文件写入指定的输出目录。

source: `arguments.cwl`
ta: `வாதங்கள். CWL`

source: `arguments-job.yml`
ta: `வாதங்கள்-job.yml`

source: Next, create a sample Java file to use with the command-line tool.
ja: 次に、CommandLineToolで使用するサンプルJavaファイルを作成します。
ru: Далее создайте пример Java-файла для использования с инструментом командной строки.
ta: அடுத்து, கட்டளை-வரி கருவியுடன் பயன்படுத்த மாதிரி சாவா கோப்பை உருவாக்கவும்.
zh_hans: 接下来，创建一个示例 Java 文件，用来让命令行工具处理它。

source: And now invoke `cwltool` providing the tool description and the input object on the command line:
ja: そして、コマンドラインでツール定義と入力オブジェクトを渡して`cwltool` を起動します：
ru: А теперь вызовите `cwltool`, указав в командной строке описание инструмента и объект ввода:
ta: இப்போது கட்டளை வரியில் கருவி விளக்கத்தையும் உள்ளீட்டு பொருளையும் வழங்கும் `cwltool` ஐ அழைக்கவும்:
zh_hans: 现在，将刚才创建的工具描述和输入对象通过命令行传递给 `cwltool` ：

source: Here we use the `arguments` field to add an additional argument to the command line that isn't tied to a specific input parameter.
ja: ここでは、`arguments` フィールドを使用して、特定の入力パラメータに結びつかない追加の引数をコマンドラインに追加しています。
ru: Здесь мы используем поле `arguments`, чтобы добавить в командную строку дополнительный аргумент, который не привязан к конкретному входному параметру.
ta: ஒரு குறிப்பிட்ட உள்ளீட்டு அளவுருவுடன் பிணைக்கப்படாத கட்டளை வரியில் கூடுதல் வாதத்தை சேர்க்க இங்கே `வாதங்கள்` புலத்தைப் பயன்படுத்துகிறோம்.
zh_hans: 此处我们使用 `arguments` 字段，给命令行添加一个与任何具体输入参数都无关的附加参数。

source: This example references a runtime parameter. Runtime parameters provide information about the hardware or software environment when the tool is actually executed. The `$(runtime.outdir)` parameter is the path to the designated output directory. Other parameters include `$(runtime.tmpdir)`, `$(runtime.ram)`, `$(runtime.cores)`, `$(runtime.outdirSize)`, and `$(runtime.tmpdirSize)`. See the [Runtime Environment][runtime] section of the CWL specification for details.
ja: この例では、runtimeパラメータを参照しています。 runtimeパラメータは、ツールが実際に実行されたときのハードウェアまたはソフトウェア環境に関する情報を提供します。 ` $(runtime.outdir)` パラメータは、指定された出力ディレクトリへのパスです。 その他、`$(runtime.tmpdir)`,`$(runtime.ram)`,`$(runtime.cores)`,`$(runtime.outdirSize)`,`$(runtime.tmpdirSize)` などがあります。 詳細はCWL仕様書の[Runtime Environment][runtime]の項を参照してください。
ru: Этот пример ссылается на параметр времени выполнения. Параметры времени выполнения предоставляют информацию об аппаратном или программном окружении, когда инструмент фактически выполняется. Параметр `$(runtime.outdir)` - это путь к указанному каталогу вывода. Другие параметры включают `$(runtime.tmpdir)`, `$(runtime.ram)`, `$(runtime.cores)`, `$(runtime.outdirSize)` и `$(runtime.tmpdirSize)`. Подробности см. в разделе [Runtime Environment][runtime] спецификации CWL.
ta: இந்த எடுத்துக்காட்டு ஒரு இயக்க நேர அளவுருவைக் குறிக்கிறது. கருவி உண்மையில் செயல்படுத்தப்படும்போது இயக்க நேர அளவுருக்கள் வன்பொருள் அல்லது மென்பொருள் சூழல் பற்றிய தகவல்களை வழங்குகின்றன. `$(runtime.outdir)` அளவுரு என்பது நியமிக்கப்பட்ட வெளியீட்டு கோப்பகத்திற்கான பாதை. பிற அளவுருக்களில் `$(runtime.tmpdir)`, `$(runtime.ram)`, `$(runtime.cores)`, `$(runtime.outdirSize)`, மற்றும் `$(runtime.tmpdirSize)`. விவரங்களுக்கு CWL விவரக்குறிப்பின் [இயக்க நேர சூழல்] [runtime] பகுதியைப் பார்க்கவும்.
zh_hans: 此示例用到了运行时 (runtime) 参数，它们提供的是工具实际执行时的硬件或软件环境信息。 `$(runtime.outdir)` 参数是指定输出目录的路径。其他运行时参数还有 `$(runtime.tmpdir)`、`$(runtime.ram)`、`$(runtime.cores)`、`$(runtime.outdirSize)`, 以及 `$(runtime.tmpdirSize)` 等，详见 CWL 规约的 [Runtime Environment][runtime]（运行环境）部分。

source: Best Practices
ja: ベストプラクティス
ru: Передовая практика
ta: சிறந்த நடைமுறைகள்
zh_hans: 优良习惯

source: The following are a set of recommended good practices to keep in mind when writing a Common Workflow Language description for a tool or workflow. These guidelines are presented for consideration on a scale of usefulness: although more is better, not all are required.
ja: 以下は、ツールやワークフローのCWL定義を書く際に留意すべき推奨グッドプラクティスのセットです。これらのガイドラインは、有用性の尺度で検討するために提示されています：多ければ多いほど良いが、すべてが必要なわけではありません。
ru: Ниже приведен набор рекомендуемых передовых методов, которые следует иметь в виду при написании описания инструмента или рабочего процесса на языке Common Workflow Language. Эти рекомендации представлены для рассмотрения по шкале полезности: хотя больше - значит лучше, не все из них обязательны.
ta: ஒரு கருவி அல்லது பணிப்பாய்வுக்கான பொதுவான பணிப்பாய்வு மொழி விளக்கத்தை எழுதும் போது மனதில் கொள்ள பரிந்துரைக்கப்பட்ட நல்ல நடைமுறைகளின் தொகுப்பாகும். இந்த வழிகாட்டுதல்கள் பயனற்ற அளவில் பரிசீலிக்க வழங்கப்படுகின்றன: மேலும் சிறந்தது என்றாலும், அனைத்தும் தேவையில்லை.
zh_hans: 本节列举一组值得留心的好习惯，推荐您在用 CWL 编写工具或工作流描述时参考。您只需结合实际尽量做到，无需求全。

source: No `type: string` parameters for names of input or reference files/directories; use `type: File` or `type: Directory` as appropriate.
ja: 入力または参照のファイルやディレクトリの名前に `type: string` を使用しません。 `type:File` または `type: Direcotry` を適宜使用します。
ru: Нет параметров `type: string` для имен входных или справочных файлов/директорий; используйте `type: File` или `type: Directory` в зависимости от ситуации.
ta: இல்லை `வகை: உள்ளீடு அல்லது குறிப்பு கோப்புகள்/கோப்பகங்களின் பெயர்களுக்கான சரம்` அளவுருக்கள்; `வகை: கோப்பு` அல்லது` வகை: அடைவு` பொருத்தமானதாகப் பயன்படுத்தவும்.
zh_hans: 不要将 `type: string` 参数用于输入或引用文件、目录的名称；请根据实际情况选用 `type: File` 或 `type: Directory`.

source: A CWL document (in conjunction with any external components like `Dockerfile`s) is software code. Workflow developers should be aware that the usual rules of software licensing apply to this document. For example, if the workflow is shared publicly, licensing terms must be clear so that a future user understands under what conditions they can run the workflow, modify it and/or combine it with other workflows. For this reason, please consider including a license field in the document. The authors of this guide urge you to choose a pre-existing license rather than trying to write your own (see the link below to learn more about choosing a license), and our recommended practice is to choose a license that allows for re-use by anyone, e.g. [Apache 2.0][apache-license].
ru: Документ CWL (в сочетании с любыми внешними компонентами, такими как `Dockerfile`) является программным кодом. Разработчики рабочих процессов должны знать, что к этому документу применяются обычные правила лицензирования программного обеспечения. Например, если рабочий процесс выкладывается в открытый доступ, условия лицензирования должны быть понятны, чтобы будущий пользователь понимал, при каких условиях он может запускать рабочий процесс, изменять его и/или комбинировать с другими рабочими процессами. По этой причине рассмотрите возможность включения в документ поля лицензии. Авторы этого руководства настоятельно рекомендуют вам выбрать уже существующую лицензию, а не пытаться написать свою собственную (см. ссылку ниже, чтобы узнать больше о выборе лицензии). Мы рекомендуем выбирать лицензию, которая позволяет повторное использование любым пользователем, например [Apache 2.0][apache-license].
ta: ஒரு சி.டபிள்யூ.எல் ஆவணம் (`டோக்கர்ஃபைல்`கள் போன்ற எந்தவொரு வெளிப்புற கூறுகளுடனும் இணைந்து) மென்பொருள் குறியீடு. மென்பொருள் உரிமத்தின் வழக்கமான விதிகள் இந்த ஆவணத்திற்கு பொருந்தும் என்பதை பணிப்பாய்வு உருவாக்குபவர்கள் அறிந்திருக்க வேண்டும். எடுத்துக்காட்டாக, பணிப்பாய்வு பகிரங்கமாகப் பகிரப்பட்டால், உரிம விதிமுறைகள் தெளிவாக இருக்க வேண்டும், இதனால் எதிர்கால பயனர் எந்த நிலைமைகளை அவர்கள் பணிப்பாய்வுகளை இயக்கலாம், அதை மாற்றலாம் மற்றும்/அல்லது பிற பணிப்பாய்வுகளுடன் இணைக்க முடியும் என்பதைப் புரிந்துகொள்கிறார். இந்தக் காரணத்திற்காக, ஆவணத்தில் உரிமம் புலத்தைச் சேர்ப்பதைக் கவனியுங்கள். இந்த வழிகாட்டியின் ஆசிரியர்கள் உங்கள் சொந்தமாக எழுத முயற்சிப்பதை விட முன்பே இருக்கும் உரிமத்தைத் தேர்வுசெய்யும்படி கேட்டுக்கொள்கிறார்கள் (உரிமத்தைத் தேர்ந்தெடுப்பது பற்றி மேலும் அறிய கீழேயுள்ள இணைப்பைக் காண்க), மேலும் எங்கள் பரிந்துரைக்கப்பட்ட நடைமுறை மீண்டும் பயன்படுத்த அனுமதிக்கும் உரிமத்தைத் தேர்ந்தெடுப்பதாகும் யாராலும், எ.கா. [அப்பாச்சி 2.0][apache-license].
zh_hans: CWL 文件（连同 `Dockerfile` 等外部组件）是一种软件代码。工作流开发人员应明白的是，关于软件许可的通用规则也同样适用于您编写的 CWL 文件。例如，如果您的工作流是公开共享的，则许可条款一定要明确，以便将来的用户了解在什么条件下可以将它运行、修改、或并入其他工作流。因此，请考虑在 CWL 文件中加入 license（许可协议）字段。笔者敦促您选用现成的许可协议，不要独辟蹊径（关于挑选许可协议请参见下文链接）。同时，建议您选取允许任何人重复使用的许可证，如 [Apache 2.0][apache-license].

source: If possible, the license should be specified with its corresponding [SPDX identifier][spdx]. Construct the metadata field for the license by providing a URL of the form `https://spdx.org/licenses/[SPDX-ID]` where `SPDX-ID` is taken from the list of identifiers linked above. See the example snippet below for guidance. For non-standard licenses without an SPDX identifier, provide a URL to the license.
ja: 可能であれば、ライセンスは対応する [SPDX 識別子][spdx] と共に指定されるべきです。`https://spdx.org/licenses/[SPDX-ID]` (`SPDX-ID` は、上記のリンク先の識別子のリストから選択) という形式の URL を指定して、ライセンスのメタデータフィールドを構築します。以下の例を参照してください。SPDX識別子のない非標準ライセンスの場合は、そのライセンスへのURLを指定します。
ru: Если возможно, лицензия должна быть указана с соответствующим [SPDX-идентификатором][spdx]. Создайте поле метаданных для лицензии, указав URL вида `https://spdx.org/licenses/[SPDX-ID]`, где `SPDX-ID` берется из списка идентификаторов, приведенного выше. См. пример фрагмента ниже. Для нестандартных лицензий без идентификатора SPDX укажите URL-адрес лицензии.
ta: முடிந்தால், உரிமம் அதனுடன் தொடர்புடைய [SPDX அடையாளங்காட்டி] [spdx] உடன் குறிப்பிடப்பட வேண்டும். `https://spdx.org/licenses/[SPDX-ID]` `SPDX-ID` படிவத்தின் முகவரி ஐ வழங்குவதன் மூலம் உரிமத்திற்கான மேனிலை தரவு புலத்தை உருவாக்குங்கள், அங்கு மேலே இணைக்கப்பட்ட அடையாளங்காட்டிகளின் பட்டியலிலிருந்து எடுக்கப்படுகிறது. வழிகாட்டுதலுக்கு கீழே உள்ள எடுத்துக்காட்டு துணுக்கைக் காண்க. SPDX அடையாளங்காட்டி இல்லாமல் தரமற்ற உரிமங்களுக்கு, உரிமத்திற்கு முகவரி ஐ வழங்கவும்.
zh_hans: 请尽可能使用 [SPDX 标识符][spdx] 指定许可协议。许可协议的元数据字段由形如 `https://spdx.org/licenses/[SPDX-ID]` 的 URL 构成，其中 `SPDX-ID` 取自前面链接提到的标识符列表，参见下例这段代码。对于没有 SPDX 标识符的非标准许可协议，请提供许可协议的 URL。

source: Useful reading: "[A Quick Guide to Software Licensing for the Scientist-Programmer][sci-license]"
ja: 参考文献："[科学者・プログラマーのためのソフトウェアライセンス クイックガイド][sci-license]"
ru: Полезное чтение: "[Краткое руководство по лицензированию программного обеспечения для ученого-программиста][sci-license]"
ta: பயனுள்ள வாசிப்பு: "[விஞ்ஞானி-புரோகிராமருக்கான மென்பொருள் உரிமத்திற்கான விரைவான வழிகாட்டி][sci-license]]"
zh_hans: 相关阅读：《[给科学界程序员的软件许可简明指南][sci-license]》

source: _Example of metadata field for license with SPDX identifier:_
ja: _SPDX 識別子を持つライセンスのメタデータフィールドの例：_
ru: _Пример поля метаданных для лицензии с идентификатором SPDX:_
ta: _எச்பி SPDX அடையாளங்காட்டியுடன் உரிமத்திற்கான மேனிலை தரவு புலத்தின் மாதிரி:_
zh_hans: _用 SPDX 标识符指定许可协议的元数据字段示例：_

source: For more examples of providing metadata within CWL descriptions, see [the Metadata and Authorship section of this User Guide](../topics/metadata-and-authorship.md).
ru: Другие примеры предоставления метаданных в описаниях CWL см. в [разделе "Метаданные и авторство" данного руководства пользователя](../topics/metadata-and-authorship.md).
ta: சி.டபிள்யூ.எல் விளக்கங்களுக்குள் மெட்டாடேட்டாவை வழங்குவதற்கான கூடுதல் எடுத்துக்காட்டுகளுக்கு, [இந்த பயனர் வழிகாட்டியின் மேனிலை தரவு மற்றும் எழுத்தாளர் பிரிவு](../topics/metadata-and-authorship.md) ஐப் பார்க்கவும்.
zh_hans: 关于在 CWL 描述中提供元数据的更多示例，请参见[《用户指南》的“元数据和著作权”一节](../topics/metadata-and-authorship.md)。

source: Include [attribution information][license-example] for the author(s) of the CWL tool or workflow description. Use unambiguous identifiers like [ORCID][orcid].
ja: CWLツールやワークフローの定義の著者の[帰属情報][license-example]を含みます。[ORCID][orcid]のような曖昧でない識別子を使用してください。
ru: Включите [информацию об авторстве][пример лицензии] для автора(ов) описания инструмента CWL или рабочего процесса. Используйте однозначные идентификаторы, например [ORCID][orcid].
ta: சி.டபிள்யூ.எல் கருவி அல்லது பணிப்பாய்வு விளக்கத்தின் ஆசிரியர் (கள்) க்கான [பண்புக்கூறு தகவல்][license-example] சேர்க்கவும். [ஆர்சிட்][orcid] போன்ற தெளிவற்ற அடையாளங்காட்டிகளைப் பயன்படுத்தவும்.
zh_hans: 为 CWL 工具或工作流描述的作者添加[署名信息][license-example]。请使用明确、独一无二的标识符，如[ORCID][orcid].
