Repository: common-workflow-language/user_guide
Catalog: locales/*/LC_MESSAGES/user_guide.po
Languages: ja, ru, ta, zh_hans

source: The `cwltool` command has an option to validate CWL tool and workflow descriptions. This option will parse the CWL document, look for syntax errors, and verify that the workflow descriptions are compliant with the CWL standards. However, these actions will be performed without running the document. To validate CWL workflows (or even a standalone command line tool description like the above) pass the `--validate` option to the `cwltool` command:
ja: `cwltool` コマンドには、CWL ツールおよびワークフロー定義を検証するオプションがあります。このオプションは、CWL文書を解析し、構文エラーを探し、ワークフロー記述がCWL標準に準拠しているかどうかを検証します。ただし、これらの操作は、ドキュメントを実行せずに行われます。CWLワークフロー（または上記のようなスタンドアロンコマンドラインツールの記述も）を検証するには、`cwltool` コマンドに`--validate` オプションを渡します：
ru: Команда `cwltool` имеет опцию для проверки описаний инструментов и рабочих процессов CWL. Эта опция будет разбирать документ CWL, искать синтаксические ошибки и проверять соответствие описаний рабочих процессов стандартам CWL. Однако эти действия будут выполнены без запуска документа. Чтобы проверить рабочие процессы CWL (или даже описание отдельного инструмента командной строки, как показано выше), передайте опцию `--validate` команде `cwltool`:
ta: சி.டபிள்யூ.எல் கருவி மற்றும் பணிப்பாய்வு விளக்கங்களை சரிபார்க்க `CWLTOOL` கட்டளைக்கு ஒரு விருப்பம் உள்ளது. இந்த விருப்பம் சி.டபிள்யூ.எல் ஆவணத்தை அலச, தொடரியல் பிழைகளைத் தேடும், மற்றும் பணிப்பாய்வு விளக்கங்கள் சி.டபிள்யூ.எல் தரங்களுக்கு இணங்குகின்றன என்பதை சரிபார்க்கவும். இருப்பினும், இந்த நடவடிக்கைகள் ஆவணத்தை இயக்காமல் செய்யப்படும். சி.டபிள்யூ.எல் பணிப்பாய்வுகளை சரிபார்க்க (அல்லது மேலே உள்ளதைப் போன்ற ஒரு முழுமையான கட்டளை வரி கருவி விளக்கம் கூட) `-வாலிடேட்` விருப்பத்தை` cwltool` கட்டளைக்கு அனுப்பவும்:
zh_hans: `cwltool` 命令有一个选项可用于“确认” (validate) 也就是检验 CWL 工具和工作流描述。使用该选项可以进行 CWL 文件语法分析，查找语法错误，并以 CWL 标准验证工作流描述的规范性。然而，进行这一系列操作并不会运行 CWL 文件。要确认 CWL 工作流（包括类似前例的独立命令行工具描述），请将 `--validate` 选项传递给 `cwltool` 命令：

source: Validating `true.cwl` with `cwltool`.
ja: `cwltool` を使って `true.cwl` を検証します。
ru: Проверка `true.cwl` с помощью `cwltool`.
ta: `Cwltool` உடன்` true.cwl` ஐ சரிபார்க்கிறது.
zh_hans: 用 `cwltool` 确认（即检验）`true.cwl`.

source: You can run the CWL tool description by omitting the `--validate` option:
ja: `--validate` オプションを省略することで、CWLツール定義を実行することができます：
ru: Вы можете запустить описание инструмента CWL, опустив опцию `--validate`:
ta: `-வாலிடேட்` விருப்பத்தைத் தவிர்ப்பதன் மூலம் நீங்கள் CWL கருவி விளக்கத்தை இயக்கலாம்:
zh_hans: 去掉 `--validate` 选项，才能运行 CWL 工具描述：

source: Running `true.cwl` with `cwltool`.
ja: `cwltool` を使って `true.cwl` を実行します。
ru: Запуск `true.cwl` с помощью `cwltool`.
ta: `Cwltool` உடன்` true.cwl` ஐ இயக்குகிறது.
zh_hans: 用 `cwltool` 运行 `true.cwl`.

source: Cwl-runner Python Module
ru: Модуль Cwl-runner Python
ta: கூல்-ரன்னர் பைதான் தொகுதி
zh_hans: Python 模块 cwl-runner

source: `cwl-runner` is an implementation-agnostic alias for any CWL compliant runner. This simply means that the `cwl-runner` alias command can be invoked independently, and is not reliant on a particular CWL runner program name. Users can invoke `cwl-runner` instead of invoking a CWL runner like `cwltool` directly. The `cwl-runner` is installed by a system administrator or user to point to the preferred CWL implementation. This is convenient for environments with multiple CWL runners.
ja: `cwl-runner` は、CWL準拠のランナーに対する、実装にとらわれないエイリアスです。これは、`cwl-runner` エイリアスコマンドを独立して呼び出すことができ、特定のCWLランナープログラム名に依存しないことを意味します。ユーザーは、`cwltool` のようなCWLランナーを直接呼び出す代わりに、`cwl-runner` を呼び出すことができます。`cwl-runner` は、システム管理者またはユーザーによってインストールされ、好みのCWL実装を指し示す。これは、複数のCWLランナーがある環境では便利です。
ru: `cwl-runner` - это псевдоним для любого CWL-совместимого бегуна, не зависящий от реализации. Это просто означает, что команда псевдонима `cwl-runner` может быть вызвана независимо и не зависит от имени конкретной программы CWL runner. Пользователи могут вызывать `cwl-runner` вместо того, чтобы напрямую вызывать CWL-бегунок, например `cwltool`. Программа `cwl-runner` устанавливается системным администратором или пользователем, чтобы указать на предпочтительную реализацию CWL. Это удобно для сред с несколькими CWL-бегунами.
ta: `சி.டபிள்யூ.எல்-ரன்னர்` என்பது எந்தவொரு சி.டபிள்யூ.எல் இணக்கமான ஓட்டப்பந்தய வீரருக்கும் ஒரு செயல்படுத்தல்-அஞ்ஞான மாற்றாகும். இதன் பொருள் என்னவென்றால், `சி.டபிள்யூ.எல்-ரன்னர்` மாற்று கட்டளை சுயாதீனமாக செயல்படுத்தப்படலாம், மேலும் ஒரு குறிப்பிட்ட சி.டபிள்யூ.எல் ரன்னர் நிரல் பெயரை நம்பவில்லை. `CWLTool` போன்ற CWL ரன்னரை நேரடியாகப் பயன்படுத்துவதற்குப் பதிலாக பயனர்கள்` CWL- ரன்னர்` ஐ அழைக்கலாம். விருப்பமான சி.டபிள்யூ.எல் செயல்படுத்தலை சுட்டிக்காட்ட கணினி நிர்வாகி அல்லது பயனரால் `சி.டபிள்யூ.எல்-ரன்னர்` நிறுவப்பட்டுள்ளது. பல சி.டபிள்யூ.எல் ஓட்டப்பந்தய வீரர்களைக் கொண்ட சூழல்களுக்கு இது வசதியானது.
zh_hans: `cwl-runner` 是任何符合标准的 CWL 运行程序“不分实现”的别名 (alias). 简言之，`cwl-runner` 这个别名命令可独立地启用，不依赖于 CWL 运行程序的具体名称。用户只需调用 `cwl-runner`, 而无需直接调用诸如 `cwltool` 这样的某个 CWL 运行程序。经系统管理员或用户安装后，`cwl-runner` 命令用来代指其首选的 CWL 实现。这样的安排更便利于多个 CWL 运行程序共存的环境。

source: The CWL community publishes a Python package with the name `cwlref-runner` that installs an alias for `cwltool` under the name `cwl-runner`
ru: Сообщество CWL публикует пакет Python с именем `cwlref-runner`, который устанавливает псевдоним для `cwltool` под именем `cwl-runner`
ta: சி.டபிள்யூ.எல் சமூகம் `cwlref- ரன்னர்` என்ற பெயருடன் ஒரு பைதான் தொகுப்பை வெளியிடுகிறது, இது` cwltool` க்கான மாற்றுப்பெயரை `CWL-RUNNER` என்ற பெயரில் நிறுவுகிறது
zh_hans: CWL 社群发布有名为 `cwlref-runner` 的 Python 包，以安装 `cwl-runner` 作为 `cwltool` 的别名

source: Installing `cwl-runner` alias for cwltool with `pip`.
ja: cwltool のエイリアス `cwl-runner` を `pip` でインストールします。
ru: Установка псевдонима `cwl-runner` для cwltool с помощью `pip`.
ta: Cwltool க்கு `பிப்` உடன்` சி.டபிள்யூ.எல்-ரன்னர்` மாற்றுப்பெயரை நிறுவுகிறது.
zh_hans: 用 `pip` 为 cwltool 安装别名 `cwl-runner`.

source: Now you can validate and run your workflow with the `cwl-runner` executable, which will invoke `cwltool`. You should have the same results and output as in the previous section.
ja: これで `cwl-runner` 実行ファイルを用いてワークフローを検証・実行し、`cwltool` を呼び出すことができるようになりました。前のセクションと同じ結果と出力が得られるはずです。
ru: Теперь вы можете проверить и запустить свой рабочий процесс с помощью исполняемого файла `cwl-runner`, который вызовет `cwltool`. Вы должны получить те же результаты и вывод, что и в предыдущем разделе.
ta: இப்போது நீங்கள் உங்கள் பணிப்பாய்வுகளை `சி.டபிள்யூ.எல்-ரன்னர்` இயங்கக்கூடியதாக சரிபார்த்து இயக்கலாம், இது` cwltool` ஐ அழைக்கும். முந்தைய பிரிவில் உள்ள அதே முடிவுகள் மற்றும் வெளியீட்டை நீங்கள் கொண்டிருக்க வேண்டும்.
zh_hans: 现在要检验或运行工作流就可以用 `cwl-runner` 这个命令了，它将为你调用 `cwltool`. 其运行结果和输出应当与上一节中相同。

source: Validating `true.cwl` with `cwl-runner`.
ja: 検証`true.cwl` with`cwl-runner`.
ru: Проверка `true.cwl` с помощью `cwl-runner`.
ta: `Cwl-runner` உடன்` true.cwl` ஐ சரிபார்க்கிறது.
zh_hans: 用 `cwl-runner` 检验 `true.cwl`.

source: Running `true.cwl` with `cwl-runner`.
ja: `true.cwl` を `cwl-runner` で実行します。
ru: Запуск `true.cwl` с помощью `cwl-runner`.
ta: `Cwl-runner` உடன்` true.cwl` ஐ இயக்குகிறது.
zh_hans: 用 `cwl-runner` 运行 `true.cwl`.

source: Another way to execute `cwl-runner` is by invoking the file directly. For that, the first thing you need to do is copy `true.cwl` workflow into a new file: `true_shebang.cwl`, and include a special first line, a *shebang*:
ja: `cwl-runner` を実行するもう一つの方法は、ファイルを直接起動することです。そのためには、まず`true.cwl` ワークフローを新しいファイル`true_shebang.cwl` にコピーし、特別な最初の行、*shebang* を含める必要があります：
ru: Другой способ выполнить `cwl-runner` - вызвать файл напрямую. Для этого вам нужно скопировать рабочий процесс `true.cwl` в новый файл: `true_shebang.cwl`, и включить в него специальную первую строку, *shebang*:
ta: `சி.டபிள்யூ.எல்-ரன்னர் 'ஐ இயக்க மற்றொரு வழி கோப்பை நேரடியாக அழைப்பதன் மூலம். அதற்காக, நீங்கள் செய்ய வேண்டிய முதல் சேதி `true.cwl` பணிப்பாய்வுகளை ஒரு புதிய கோப்பில் நகலெடுக்க வேண்டும்:` true_shebang.cwl`, மற்றும் ஒரு சிறப்பு முதல் வரியான ஒரு *செபாங் *:
zh_hans: 执行 `cwl-runner` 还有一种方法，即直接调用 CWL 文件。为此，首先将 `true.cwl` 工作流复制为新文件 `true_shebang.cwl`, 然后加入特定的 *shebang* (即 "hash-bang") 作为首行：

source: Now you can make the file `true_shebang.cwl` executable with `chmod u+x`.
ja: `chmod u+x` を実行することで、 `true_shebang.cwl` を実行可能なファイルにすることができます。
ru: Теперь вы можете сделать файл `true_shebang.cwl` исполняемым с помощью `chmod u+x`.
ta: இப்போது நீங்கள் `chmod u+x` உடன் இயங்கக்கூடிய கோப்பை உருவாக்கலாம்.
zh_hans: 现在，用 `chmod u+x` 命令将 `true_shebang.cwl` 设为可执行。

source: Making `true.cwl` executable.
ja: `true.cwl` 実行可能なものにする。
ru: Создание исполняемого файла `true.cwl`.
ta: `True.cwl` இயங்கக்கூடியது.
zh_hans: 令 `true.cwl` 可执行。

source: And finally, you can execute it directly in the command-line. On execution, the program specified in the shebang (`cwl-runner`) will be used to execute the rest of the file.
ja: そして最後に、コマンドラインで直接実行することができます。実行時には、shebangで指定されたプログラム(`cwl-runner`)が、ファイルの残りの部分を実行するために使用されます。
ru: И, наконец, вы можете выполнить его непосредственно в командной строке. При выполнении программа, указанная в shebang (`cwl-runner`), будет использована для выполнения остальной части файла.
ta: இறுதியாக, நீங்கள் அதை நேரடியாக கட்டளை வரிசையில் இயக்கலாம். செயல்படுத்தும்போது, செபாங்கில் குறிப்பிடப்பட்டுள்ள நிரல் (`சி.டபிள்யூ.எல்-ரன்னர்`) மீதமுள்ள கோப்பை இயக்க பயன்படுத்தப்படும்.
zh_hans: 到此，此 CWL 文件即可在命令行直接执行了。一旦下令执行这个文件，“shebang”所指定的程序 (即 `cwl-runner`) 将实际执行其余部分。

source: Running `true_shebang.cwl` with a shebang.
ja: `true_shebang.cwl` をシェバングで実行する。
ru: Запуск `true_shebang.cwl` с шебангом.
ta: ஒரு செபாங்குடன் `true_shebang.cwl` ஐ இயக்குகிறது.
zh_hans: 使用 shebang 运行 `true_shebang.cwl`.

source: The *shebang* is the two-character sequence `#!` at the beginning of a script. When the script is executable, the operating system will execute the script using the executable specified after the shebang. It is considered a good practice to use `/usr/bin/env <executable>` rather than using a hard-coded location, since `/usr/bin/env <executable>` looks for the `<executable>` program in the system `PATH`,
ru: *Шебанг* - это двухсимвольная последовательность `#!` в начале сценария. Если сценарий является исполняемым, операционная система выполнит его с помощью исполняемого файла, указанного после shebang. Считается хорошей практикой использовать `/usr/bin/env <executable>`, а не жестко заданное местоположение, поскольку `/usr/bin/env <executable>` ищет программу `<executable>` в системном `PATH`,
ta: * செபாங் * என்பது ஒரு ச்கிரிப்ட்டின் தொடக்கத்தில் `#!` என்பது இரண்டு-எழுத்து வரிசை. ச்கிரிப்ட் இயங்கக்கூடியதாக இருக்கும்போது, செபாங்குக்குப் பிறகு குறிப்பிடப்பட்ட இயங்கக்கூடியதைப் பயன்படுத்தி இயக்க முறைமை ச்கிரிப்டை இயக்கும். `/Usr/bin/env <acationable>` `<இயங்கக்கூடிய>` நிரலைத் தேடுவதால், கடினமான குறியிடப்பட்ட இருப்பிடத்தைப் பயன்படுத்துவதை விட `/usr/bin/env <இயங்கக்கூடிய>` பயன்படுத்துவது ஒரு நல்ல நடைமுறையாகக் கருதப்படுகிறது கணினி `பாதை`,
zh_hans: 所谓 *shebang* 是指脚本起始处的 `#!` 两个连续字符。如果脚本可执行，操作系统将用紧跟在 shebang 之后写明的可执行程序来执行此脚本。一个好习惯是用 `/usr/bin/env &lt;可执行程序名&gt;`， 而不是硬性编码其所在路径，理由是 `/usr/bin/env &lt;可执行程序名&gt;` 进行的，是在系统 `PATH`（命令路径环境变量）中查找 `&lt;可执行程序名&gt;` 的实际路径

source: Text Editor
ja: テキストエディタ
ru: Текстовый редактор
ta: உரை ஆசிரியர்
zh_hans: 文本编辑器

source: You can use any text editor with CWL, but for syntax highlighting we recommend an editor with YAML support. Popular editors are Visual Studio Code, Sublime, WebStorm, vim/neovim, and Emacs.
ja: CWLではどんなテキストエディタでも使えますが、シンタックスハイライトのために、YAMLをサポートするエディタをお勧めします。人気のあるエディタは、Visual Studio Code、Sublime、WebStorm、vim/neovim、そしてEmacsです。
ru: Вы можете использовать любой текстовый редактор с CWL, но для подсветки синтаксиса мы рекомендуем редактор с поддержкой YAML. Популярными редакторами являются Visual Studio Code, Sublime, WebStorm, vim/neovim и Emacs.
ta: நீங்கள் சி.டபிள்யூ.எல் உடன் எந்த உரை திருத்தியையும் பயன்படுத்தலாம், ஆனால் தொடரியல் சிறப்பம்சமாக நாங்கள் YAML ஆதரவுடன் ஒரு எடிட்டரை பரிந்துரைக்கிறோம். பிரபலமான ஆசிரியர்கள் விசுவல் ச்டுடியோ குறியீடு, கம்பீரமான, வெப்ச்டார்ம், விஐஎம்/நியோவிம் மற்றும் ஈமாக்ச்.
zh_hans: 任何文本编辑器都可以用于 CWL 编程。不过，我们建议使用支持显示 YAML 语法的编辑器。常用的编辑器包括 Visual Studio Code、Sublime、WebStorm、vim/neovim 以及 Emacs 等。

source: There are extensions for Visual Studio Code and WebStorm that provide integration with CWL, and features such as customized syntax highlighting and better auto-complete:
ja: Visual Studio CodeとWebStormには、CWLとの統合を実現する拡張機能があり、カスタマイズされたシンタックスハイライトやより優れた自動補完などの機能が用意されています：
ru: Существуют расширения для Visual Studio Code и WebStorm, обеспечивающие интеграцию с CWL, а также такие функции, как настраиваемая подсветка синтаксиса и улучшенное автозаполнение:
ta: சி.டபிள்யூ.எல் உடன் ஒருங்கிணைப்பை வழங்கும் விசுவல் ச்டுடியோ குறியீடு மற்றும் வெப்ச்டார்ம் ஆகியவற்றிற்கான நீட்டிப்புகள் உள்ளன, மேலும் தனிப்பயனாக்கப்பட்ட தொடரியல் சிறப்பம்சமாக மற்றும் சிறந்த ஆட்டோ-முழுமையானவை போன்ற நற்பொருத்தங்கள் உள்ளன:
zh_hans: 以下 Visual Studio Code 和 WebStorm 的扩展程序支持 CWL 集成，提供自定义语法显示、改进的自动补全等功能：

source: Visual Studio Code with the Benten (CWL) plugin - <https://github.com/rabix/benten#install-vs-code-extension>
ja: Benten(弁天)（CWL）プラグインを使ったVisual Studio Code -<https://github.com/rabix/benten#install-vs-code-extension>
ru: Visual Studio Code с плагином Benten (CWL) - <https://github.com/rabix/benten#install-vs-code-extension>
ta: பென்டென் (சி.டபிள்யூ.எல்) சொருகி கொண்ட விசுவல் ச்டுடியோ குறியீடு-<https://github.com/rabix/benten#install-vs-code-extension>
zh_hans: 带 Benten (CWL) 插件的 Visual Studio Code —— <https://github.com/rabix/benten#install-vs-code-extension>

source: cwl-plugin for IntelliJ - <https://plugins.jetbrains.com/plugin/10040-cwl-plugin>
ja: IntelliJ 用 cwl-plugin -<https://plugins.jetbrains.com/plugin/10040-cwl-plugin>
ru: cwl-плагин для IntelliJ - <https://plugins.jetbrains.com/plugin/10040-cwl-plugin>
ta: இன்டெல்லினுக்கான சி.டபிள்யூ.எல் சொருகி-<https://plugins.jetbrins.com/plugin/10040-cwl-plugin>
zh_hans: IntelliJ 的 cwl-plugin 插件 —— <https://plugins.jetbrains.com/plugin/10040-cwl-plugin>

source: The CWL community also maintains a list of editors and viewers: <https://www.commonwl.org/tools/#editors>
ja: CWLコミュニティでは、エディターやビューアーのリストも管理しています：<https://www.commonwl.org/tools/#editors>
ru: Сообщество CWL также поддерживает список редакторов и зрителей: <https://www.commonwl.org/tools/#editors>
ta: சி.டபிள்யூ.எல் சமூகம் ஆசிரியர்கள் மற்றும் பார்வையாளர்களின் பட்டியலையும் பராமரிக்கிறது: <https://www.commonwl.org/tools/#editors>
zh_hans: CWL 社群维护的编辑器和阅览器列表：<https://www.commonwl.org/tools/#editors>

source: Docker
ta: கப்பல்துறை

source: `cwltool` uses Docker to run tools, workflows, and workflow steps that specify a software container. Follow the instructions in the Docker documentation to install it for your operating system: <https://docs.docker.com/>.
ja: `cwltool` は、ツール、ワークフロー、およびワークフロー ステップで指定されたソフトウェアコンテナをDockerを使用して実行します。Docker ドキュメントの指示に従って、お使いのオペレーティングシステム用にインストールしてください：<https://docs.docker.com/>.
ru: `cwltool` использует Docker для запуска инструментов, рабочих процессов и шагов рабочего процесса, которые определяют программный контейнер. Следуйте инструкциям в документации Docker, чтобы установить его для вашей операционной системы: <https://docs.docker.com/>.
ta: `CWLTool` ஒரு மென்பொருள் கொள்கலனைக் குறிப்பிடும் கருவிகள், பணிப்பாய்வு மற்றும் பணிப்பாய்வு படிகளை இயக்க டோக்கரைப் பயன்படுத்துகிறது. உங்கள் இயக்க முறைமைக்கு அதை நிறுவ கப்பல்துறை ஆவணத்தில் உள்ள வழிமுறைகளைப் பின்பற்றவும்: <https://docs.docker.com/>.
zh_hans: `cwltool` 使用 Docker 运行指定了软件容器的工具、工作流及工作流步骤。请按照 Docker 文档在您的操作系统中安装 Docker: <https://docs.docker.com/>。

source: You do not need to know how to write and build Docker containers. In the rest of the user guide, we will use existing Docker images for running examples, and to clarify the differences between the execution models with and without containers.
ja: Dockerコンテナの書き方や構築方法を知っておく必要はありません。このユーザーガイドの残りの部分では、実行例として既存のDockerイメージを使用し、コンテナのある実行モデルとない実行モデルの違いを明確にすることにします。
ru: Вам не нужно знать, как писать и собирать контейнеры Docker. В остальной части руководства мы будем использовать существующие образы Docker для запуска примеров, а также для пояснения различий между моделями выполнения с контейнерами и без них.
ta: கப்பல்துறை கொள்கலன்களை எவ்வாறு எழுதுவது மற்றும் உருவாக்குவது என்பதை நீங்கள் அறிய தேவையில்லை. மீதமுள்ள பயனர் வழிகாட்டியில், இயங்கும் எடுத்துக்காட்டுகளுக்கு ஏற்கனவே இருக்கும் கப்பல்துறை படங்களைப் பயன்படுத்துவோம், மேலும் கொள்கலன்களுடன் மற்றும் இல்லாமல் செயல்பாட்டு மாதிரிகள் இடையிலான வேறுபாடுகளை தெளிவுபடுத்துவோம்.
zh_hans: 您无需掌握如何编写和构建 Docker 容器。在接下来的部分里，我们将用现成的 Docker 映像来运行范例，并阐明有无容器的执行模型之间有何不同。

source: `cwltool` supports running containers with Docker, Podman, udocker, and Singularity. You can also use alternative container registries for pulling images.
ja: `cwltool` は、Docker、Podman、udocker、Singularityによるコンテナの実行をサポートしています。また、コンテナイメージを取得するために代替のコンテナレジストリを使用することもできます。
ru: `cwltool` поддерживает запуск контейнеров с помощью Docker, Podman, udocker и Singularity. Вы также можете использовать альтернативные реестры контейнеров для получения образов.
ta: `Cwltool` கப்பல்துறை, போட்மேன், உடோக்கர் மற்றும் ஒருமைப்பாட்டுடன் இயங்கும் கொள்கலன்களை ஆதரிக்கிறது. படங்களை இழுக்க மாற்று கொள்கலன் பதிவுகளையும் பயன்படுத்தலாம்.
zh_hans: `cwltool` 支持使用 Docker、Podman、udocker 和 Singularity 运行容器，并支持从非官方容器仓库拉取映像。

source: The [Implementations](basic-concepts.md#implementations) topic in the next section, Basic Concepts.
ja: 次項の「基本コンセプト」の[実装](basic-concepts.md#implementations)のトピックを参照してください。
ru: Тема [Реализации](basic-concepts.md#implementations) в следующем разделе, Основные концепции.
ta: [செயலாக்கங்கள்](basic-concepts.md#implementations) தலைப்பு அடுத்த பிரிவில், அடிப்படை கருத்துக்கள்.
zh_hans: 下一节《基本概念》之[“实现”](basic-concepts.md#implementations)主题。

source: The Python `venv` module: <https://docs.python.org/3/library/venv.html>
ja: Python`venv` モジュール:<https://docs.python.org/3/library/venv.html>
ru: Модуль Python `venv`: <https://docs.python.org/3/library/venv.html>
ta: பைதான் `வெர்வ்` தொகுதி: <https://docs.python.org/3/library/venv.html>
zh_hans: Python `venv` 模块：<https://docs.python.org/3/library/venv.html>

source: Quick Start
ja: クイックスタート
ru: Быстрый старт
ta: விரைவான தொடக்க
zh_hans: 快速入门

source: This section will show you a brief overview of what CWL is, and where you can learn more about it. No previous knowledge of CWL is required, but you must be comfortable following instructions for the command-line.
ja: このセクションでは、CWLとは何か、またCWLについてもっと詳しく知ることができる場所について、簡単に紹介します。CWLに関する予備知識は必要ありませんが、コマンドラインを使用することに慣れていると良いです。
ru: В этом разделе вы найдете краткий обзор того, что такое CWL, и узнаете, где можно узнать о нем больше. Никаких предварительных знаний о CWL не требуется, но вам должно быть удобно выполнять инструкции для командной строки.
ta: இந்த பிரிவு சி.டபிள்யூ.எல் என்றால் என்ன என்பதற்கான சுருக்கமான கண்ணோட்டத்தைக் காண்பிக்கும், மேலும் அதைப் பற்றி மேலும் அறியலாம். சி.டபிள்யூ.எல் பற்றிய முந்தைய அறிவு தேவையில்லை, ஆனால் கட்டளை-வரிக்கான வழிமுறைகளைப் பின்பற்றி நீங்கள் வசதியாக இருக்க வேண்டும்.
zh_hans: 本节将为您概述 CWL 是什么，以及在何处可以进一步学习。您不需要有 CWL 知识储备，但要能较为自如地按照文中指示操作命令行。

source: “Hello World”
ru: "Здравствуй, мир"
ta: “அலோ வேர்ல்ட்”
zh_hans: “Hello World”（“世界您好”程序）

source: CWL documents are written in [YAML](../topics/index.md) (and/or JSON). The example below shows a simple CWL “Hello World” workflow annotated with comments. Note that comments start with `#`:
ja: CWLドキュメントは[YAML](../topics/index.md)(および/またはJSON)で書かれています。以下の例は、コメントで注釈されたシンプルなCWL "Hello World" ワークフローを示しています。コメントは`#` で始まることに注意してください：
ru: Документы CWL записываются в формате [YAML](../topics/index.md) (и/или JSON). В примере ниже показан простой CWL-документ "Hello World", снабженный комментариями. Обратите внимание, что комментарии начинаются с `#`:
ta: சி.டபிள்யூ.எல் ஆவணங்கள் [YAML](../topics/index.md) (மற்றும்/அல்லது JSON) இல் எழுதப்பட்டுள்ளன. கீழேயுள்ள எடுத்துக்காட்டு கருத்துகளுடன் சிறுகுறிப்பு செய்யப்பட்ட ஒரு எளிய சி.டபிள்யூ.எல் “அலோ வேர்ல்ட்” பணிப்பாய்வுகளைக் காட்டுகிறது. கருத்துகள் `#` உடன் தொடங்குகின்றன என்பதை நினைவில் கொள்க:
zh_hans: CWL 文件按照 [YAML](../topics/index.md) 或者 JSON 格式编写的。下例演示了一个简单的 CWL 工作流“Hello World”，并且标有注释，即 `#` 符号后面的文字：

source: The example above is just a wrapper for the `echo` command-line tool. Running the workflow above with the default input values will produce the same result as the command-line `echo "Hello World"`.
ja: 上記の例は、`echo` のCommandLineToolのラッパーに過ぎません。デフォルトの入力値で上記のワークフローを実行すると、コマンドラインと同じ結果が得られます`echo "Hello World"`.
ru: Приведенный выше пример - это просто обертка для инструмента командной строки `echo`. Запуск приведенного выше рабочего процесса с входными значениями по умолчанию даст тот же результат, что и командная строка `echo "Hello World"`.
ta: மேலே உள்ள எடுத்துக்காட்டு `எதிரொலி` கட்டளை-வரி கருவிக்கான ஒரு ரேப்பர் மட்டுமே. இயல்புநிலை உள்ளீட்டு மதிப்புகளுடன் மேலே உள்ள பணிப்பாய்வுகளை இயக்குவது கட்டளை-வரி `எதிரொலி" அலோ வேர்ல்ட் "` போன்ற அதே முடிவை உருவாக்கும்.
zh_hans: 上面的示例不过是 `echo` 命令行工具的包装器 (wrapper). 使用默认输入值运行上述工作流，产生的结果会和命令 `echo "Hello World"` 别无二致。

source: In CWL, there is a distinction between a command-line tool and a workflow. But for the sake of simplicity, we are using the term “workflow” here. You will learn more about this in the [basic concepts](basic-concepts.md) section.
ja: CWLでは、CommandLineToolとWorkflowは区別されています。しかし、ここでは簡略化のため、「ワークフロー」という用語を使用しています。これについては、[基本概念](basic-concepts.md)のセクションで詳しく説明します。
ru: В CWL существует различие между инструментом командной строки и рабочим процессом. Но для простоты мы используем здесь термин "рабочий процесс". Подробнее об этом вы узнаете в разделе [основные понятия](basic-concepts.md).
ta: சி.டபிள்யூ.எல் இல், ஒரு கட்டளை-வரி கருவி மற்றும் பணிப்பாய்வு இடையே வேறுபாடு உள்ளது. ஆனால் எளிமைக்காக, நாங்கள் இங்கே “பணிப்பாய்வு” என்ற வார்த்தையைப் பயன்படுத்துகிறோம். இதைப் பற்றி [அடிப்படை கருத்துக்கள்](basic-concepts.md) பிரிவில் மேலும் அறிந்து கொள்வீர்கள்.
zh_hans: CWL 中“命令行工具”和“工作流”是有所区别的。但为了简单起见，这里我们仍然用了“工作流”一次。更多有关信息可在[《基本概念》](basic-concepts.md)一节中学到。

source: Installing a CWL Runner
ja: CWL Runnerのインストール
ru: Установка программы CWL Runner
ta: CWL ரன்னரை நிறுவுதல்
zh_hans: 安装 CWL 运行程序

source: `cwltool` is an implementation of the CWL specification. It is also the CWL *Reference Runner* for the specification, and it is compliant with the latest version of the specification: {{ cwl_version }}. You can install `cwltool` using `pip`:
ja: `cwltool` は、CWL仕様の実装の１つです。また、同仕様のCWL*Reference Runner* でもあり、同仕様の最新バージョンに準拠しています：{{cwl_version }}に準拠しています。`cwltool` は、`pip` を使ってインストールできます：
ru: `cwltool` - это реализация спецификации CWL. Он также является CWL *Reference Runner* для этой спецификации и совместим с последней версией спецификации: {{ cwl_version }}. Вы можете установить `cwltool` с помощью `pip`:
ta: `CWLTOOL` என்பது CWL விவரக்குறிப்பின் செயல்படுத்தல் ஆகும். இது விவரக்குறிப்பிற்கான CWL * குறிப்பு ரன்னர் * ஆகும், மேலும் இது விவரக்குறிப்பின் அண்மைக் கால பதிப்போடு இணங்குகிறது: {{ cwl_version }}. `பிப்` ஐப் பயன்படுத்தி` cwltool` ஐ நிறுவலாம்:
zh_hans: `cwltool` 是 CWL 规约的一种实现，也为该规约编写的 CWL *参考运行程序*。它符合规约的最新版本 {{ cwl_version }} 版。您可用 `pip` 安装 `cwltool`:

source: Installing `cwltool` with `pip`.
ja: `cwltool` を`pip` でインストールします。
ru: Установка `cwltool` с `pip`.
ta: `பிப்` உடன்` cwltool` ஐ நிறுவுகிறது.
zh_hans: 使用 `pip` 安装 `cwltool`.
