Repository: common-workflow-language/user_guide
Catalog: locales/*/LC_MESSAGES/user_guide.po
Languages: ja, ru, ta, zh_hans

source: Licenses
ja: ライセンス
ru: Лицензии
ta: உரிமங்கள்
zh_hans: 许可协议

source: Instructional Material
ja: 指導資料
ru: Инструкционные материалы
ta: அறிவுறுத்தல் பொருள்
zh_hans: 指南资料

source: All Common Workflow Language project instructional material and changes to the structure are also made available under the [Creative Commons Attribution license][cc-by-human]. The following is a human-readable summary of (and not a substitute for) the [full legal text of the CC BY 4.0 license][cc-by-legal].
ja: Common Workflow Languageプロジェクトのすべての説明資料と構造の変更は、[Creative Commons Attribution license][cc-by-human] の下でも利用できるようになっています。以下は、[CC BY 4.0 ライセンスの法的全文][cc-by-legal]を人間が読めるようにまとめたものです（ライセンス全文に代わるものではありません）。
ru: Все учебные материалы проекта Common Workflow Language и изменения в структуре также доступны по лицензии [Creative Commons Attribution][cc-by-human]. Нижеследующее является человекочитаемым кратким изложением [полного юридического текста лицензии CC BY 4.0][cc-by-legal] (но не заменяет его).
ta: அனைத்து பொதுவான பணிப்பாய்வு மொழி திட்ட அறிவுறுத்தல் பொருள் மற்றும் கட்டமைப்பில் மாற்றங்கள் [Creative Commons Attribution license][cc-by-human] இன் கீழ் கிடைக்கின்றன. பின்வருபவை மனிதனால் படிக்கக்கூடிய சுருக்கமாகும் (மற்றும் இதற்கான மாற்று அல்ல)[full legal text of the CC BY 4.0 license][cc-by-legal].
zh_hans: 通用工作流语言项目的所有指南资料，以及对其结构的修改，均可在遵照[知识共享署名公共许可协议 (Creative Commons Attribution license)][cc-by-human]的前提下获得授权使用。以下是[CC BY 4.0许可完整法律条文][cc-by-legal]的可读摘要（不能替代原条文）。

source: You are free:
ru: Вы свободны:
ta: நீங்கள் இலவசம்:
zh_hans: 您可以自由地：

source: to **Share**---copy and redistribute the material in any medium or format
ru: **Пользоваться** - копировать и распространять материал на любом носителе или в любом формате
ta: ** பகிர ** --- எந்த நடுத்தரத்திலும் அல்லது வடிவத்திலும் பொருளை நகலெடுத்து மறுபகிர்வு செய்யுங்கள்
zh_hans: **共享**——通过任何媒介、以任意格式复制和重新分发本作品

source: to **Adapt**---remix, transform, and build upon the material
ru: **Адаптировать** - смешивать, преобразовывать и развивать материал
ta: ** மாற்றியமைக்க ** --- ரீமிக்ச், மாற்ற மற்றும் பொருள் மீது உருவாக்க
zh_hans: **演绎**——修改、转换或以本作品为基础进行创作

source: for any purpose, even commercially.
ja: 営利目的であっても、いかなる目的であっても。
ru: для любых целей, даже коммерчески.
ta: எந்தவொரு நோக்கத்திற்காகவும், வணிக ரீதியாக கூட.
zh_hans: 在任何用途下，甚至商业目的。

source: The licensor cannot revoke these freedoms as long as you follow the license terms:
ru: Лицензиар не может лишить вас этих свобод, если вы соблюдаете условия лицензии:
ta: உரிம விதிமுறைகளைப் பின்பற்றும் வரை உரிமதாரர் இந்த சுதந்திரங்களை ரத்து செய்ய முடியாது:
zh_hans: 只要你遵守许可协议条款，许可人就无法收回你的这些权利：

source: **Attribution**---You must give appropriate credit (mentioning that your work is derived from work that is Copyright © the Common Workflow Language project, and, where practical, linking to https://www.commonwl.org/ ), provide a [link to the license][cc-by-human], and indicate if changes were made. You may do so in any reasonable manner, but not in any way that suggests the licensor endorses you or your use.
ru: **Атрибуция**---Вы должны отдать должное (упомянуть, что ваша работа получена из работы, которая является Copyright © проекта Common Workflow Language, и, где это возможно, дать ссылку на https://www.commonwl.org/ ), предоставить [ссылку на лицензию][cc-by-human], и указать, были ли внесены изменения. Вы можете сделать это любым разумным способом, но не таким, который предполагает, что лицензиар одобряет вас или ваше использование.
ta: ** பண்புக்கூறு ** --- நீங்கள் பொருத்தமான கடன் கொடுக்க வேண்டும் (உங்கள் பணி பதிப்புரிமை பெற்ற வேலையிலிருந்து பெறப்பட்டது என்பதைக் குறிப்பிடுவது பொதுவான பணிப்பாய்வு மொழி திட்டம், மற்றும், நடைமுறையில், https://www.commonwl.org/ உடன் இணைகிறது) . நீங்கள் எந்தவொரு நியாயமான முறையில் அவ்வாறு செய்யலாம், ஆனால் உரிமதாரர் உங்களை அல்லது உங்கள் பயன்பாட்டை ஒப்புக் கொள்ள பரிந்துரைக்கும் எந்த வகையிலும் அல்ல.
zh_hans: **署名**——您必须给出适当的署名，即声明您作品之原始版本的版权为 Common Workflow Language Project 所有 ("Copyright © the Common Workflow Language project")。如条件允许，您应提供 https://www.commonwl.org/ 和[许可协议][cc-by-human]的链接，同时标明是否对原始作品作了修改。您可以用任何合理的方式来署名，但是不得以任何方式暗示许可人为您或您的使用背书。

source: **No additional restrictions**---You may not apply legal terms or technological measures that legally restrict others from doing anything the license permits. With the understanding that:
ru: **Нет дополнительных ограничений**---Вы не имеете права применять юридические условия или технологические меры, которые законно ограничивают других от выполнения действий, разрешенных лицензией. При понимании того, что:
ta: ** கூடுதல் கட்டுப்பாடுகள் எதுவும் இல்லை ** --- உரிமம் அனுமதிக்கும் எதையும் செய்வதிலிருந்து மற்றவர்களை சட்டப்பூர்வமாக கட்டுப்படுத்தும் சட்ட விதிமுறைகள் அல்லது தொழில்நுட்ப நடவடிக்கைகளை நீங்கள் பயன்படுத்தக்கூடாது. அதைப் புரிந்துகொள்வதன் மூலம்:
zh_hans: **没有附加限制**——您不得适用法律术语或者技术措施从而限制其他人做许可协议允许的事情。并且您理解：

source: You do not have to comply with the license for elements of the material in the public domain or where your use is permitted by an applicable exception or limitation.
ru: Вы не обязаны соблюдать лицензию в отношении элементов материала, находящихся в общественном достоянии, или если их использование допускается в соответствии с применимыми исключениями или ограничениями.
ta: பொது களத்தில் உள்ள பொருளின் கூறுகளுக்கான உரிமத்திற்கு நீங்கள் இணங்க வேண்டியதில்லை அல்லது பொருந்தக்கூடிய விதிவிலக்கு அல்லது வரம்பால் உங்கள் பயன்பாடு அனுமதிக்கப்படுகிறது.
zh_hans: 您不必因为公共领域的作品要素而遵守许可协议，或者您的使用被可适用的例外或限制所允许。

source: No warranties are given. The license may not give you all of the permissions necessary for your intended use. For example, other rights such as publicity, privacy, or moral rights may limit how you use the material.
ru: Гарантии не предоставляются. Лицензия может не предоставлять вам всех разрешений, необходимых для предполагаемого использования. Например, другие права, такие как публичность, неприкосновенность частной жизни или моральные права, могут ограничивать использование материала.
ta: உத்தரவாதங்கள் எதுவும் கொடுக்கப்படவில்லை. நீங்கள் விரும்பிய பயன்பாட்டிற்கு தேவையான அனைத்து அனுமதிகளையும் உரிமம் உங்களுக்கு வழங்காது. எடுத்துக்காட்டாக, விளம்பரம், தனியுரிமை அல்லது தார்மீக உரிமைகள் போன்ற பிற உரிமைகள் நீங்கள் பொருளை எவ்வாறு பயன்படுத்துகிறீர்கள் என்பதைக் கட்டுப்படுத்தலாம்.
zh_hans: 不提供担保。许可协议可能不会给与您意图使用的所必须的所有许可。例如，其他权利比如形象权、隐私权或人格权可能限制您如何使用作品。

source: Software
ja: ソフトウェア
ru: Программное обеспечение
ta: மென்பொருள்
zh_hans: 软件

source: Except where otherwise noted, the example programs and other software provided by Common Workflow Language project are made available under the [OSI][osi]-approved [Apache 2.0 license][apache-2.0-license].
ja: Common Workflow Languageプロジェクトが提供するサンプルプログラムおよびその他のソフトウェアは、特に断りのない限り、[OSI][osi]が承認した[Apache 2.0 license][apache-2.0-license] の下で提供されています。
ru: Если не указано иное, примеры программ и другое программное обеспечение, предоставляемое проектом Common Workflow Language, доступно на условиях [OSI][osi]-одобренной [Apache 2.0 license][apache-2.0-license].
ta: வேறுவிதமாகக் குறிப்பிடப்பட்ட இடத்தைத் தவிர, பொதுவான பணிப்பாய்வு மொழி திட்டத்தால் வழங்கப்பட்ட எடுத்துக்காட்டு நிரல்கள் மற்றும் பிற மென்பொருள் [ஓஎச்ஐ][osi]-அங்கீகரிக்கப்பட்ட [அப்பாச்சி 2.0 உரிமம்] [apache-2.0-license] இன் கீழ் கிடைக்கின்றன.
zh_hans: 除非另有注明，Common Workflow Language project 提供的示例程序及其他软件均可在遵照[OSI][osi]所批准的[Apache 2.0 许可协议][apache-2.0-license]之前提下获取并使用。

source: Unless required by applicable law or agreed to in writing, software distributed under the License is distributed on an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied. See the License for the specific language governing permissions and limitations under the License.
ru: За исключением случаев, предусмотренных действующим законодательством или оговоренных в письменном виде, программное обеспечение, распространяемое в рамках Лицензии, распространяется на условиях "КАК ЕСТЬ", БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ И УСЛОВИЙ, как явных, так и подразумеваемых. Конкретные формулировки, регулирующие разрешения и ограничения в рамках Лицензии, см. в Лицензии.
ta: பொருந்தக்கூடிய சட்டத்தால் தேவைப்படாவிட்டால் அல்லது எழுத்துப்பூர்வமாக ஒப்புக் கொள்ளப்படாவிட்டால், உரிமத்தின் கீழ் விநியோகிக்கப்படும் மென்பொருள் ஒரு "அப்படியே" அடிப்படையில், எந்தவொரு உத்தரவாதங்களும் நிபந்தனைகளும் இல்லாமல், வெளிப்படையான அல்லது மறைமுகமாக விநியோகிக்கப்படுகிறது. உரிமத்தின் கீழ் குறிப்பிட்ட மொழி ஆளும் அனுமதிகள் மற்றும் வரம்புகளுக்கான உரிமத்தைப் பார்க்கவும்.
zh_hans: 除非受适用法律要求或者经书面许可，据本许可协议发行的软件均为“依照其原样”发行，不存在任何种类的、无论是明文还是隐含的担保或合约要件。请查阅许可协议中关于本协议下授权许可行为和责任免除的具体条文。

source: CWL is a way to describe command-line tools and connect them together to create workflows. Because CWL is a specification and not a specific piece of software, tools and workflows described using CWL are portable across a variety of platforms that support the CWL standard.
ja: CWLは、コマンドラインツールを定義し、それらのツールを繋げてワークフローを作成するための方法です。CWLは仕様であり、特定のソフトウェアではないため、CWLを使用して定義されたツールやワークフローは、CWL標準をサポートするさまざまなプラットフォームで利用可能です。
ru: CWL - это способ описания инструментов командной строки и их соединения для создания рабочих процессов. Поскольку CWL - это спецификация, а не конкретный программный продукт, инструменты и рабочие процессы, описанные с помощью CWL, переносятся на различные платформы, поддерживающие стандарт CWL.
ta: CWL என்பது கட்டளை-வரி கருவிகளை விவரிப்பதற்கும் அவற்றை ஒன்றாக இணைக்கவும் ஒரு வழியாகும். சி.டபிள்யூ.எல் ஒரு விவரக்குறிப்பு மற்றும் ஒரு குறிப்பிட்ட மென்பொருள் அல்ல, சி.டபிள்யூ.எல் ஐப் பயன்படுத்தி விவரிக்கப்பட்ட கருவிகள் மற்றும் பணிப்பாய்வுகள் சி.டபிள்யூ.எல் தரத்தை ஆதரிக்கும் பல்வேறு தளங்களில் சிறியவை.
zh_hans: CWL 的作用在于描述各种命令行工具，并且将它们连接起来，以创建工作流 (workflow)。CWL 是一种规范，而非某种特定的软件。因此，由 CWL 描述的工具和工作流能够移植到支持 CWL 标准的多种平台。

source: This page has moved
ja: このページは移動しました
ru: Эта страница переехала
ta: இந்த பக்கம் நகர்ந்தது
zh_hans: 此页面已转移

source: This page is out-of-date and was kept here to preserve the links of the old User Guide. Please use the new [Table of Contents](index.md#table-of-contents) to browse the User Guide.
ja: このページは古いもので、旧ユーザーガイドのリンクを保存するためにここに残されています。ユーザーガイドの閲覧には、新しい[目次](index.md#table-of-contents)をご利用ください。
ru: Эта страница устарела и была оставлена здесь, чтобы сохранить ссылки на старое Руководство пользователя. Пожалуйста, используйте новое [Оглавление](index.md#table-of-contents) для просмотра Руководства пользователя.
ta: இந்த பக்கம் காலாவதியானது மற்றும் பழைய பயனர் வழிகாட்டியின் இணைப்புகளைப் பாதுகாக்க இங்கே வைக்கப்பட்டது. பயனர் வழிகாட்டியை உலவ புதிய [உள்ளடக்க அட்டவணை](index.md#table-of-contents) ஐப் பயன்படுத்தவும்.
zh_hans: 此页面已过时，保留在此仅用于留存旧版《用户指南》的链接。请使用[新版目录](index.md#table-of-contents)浏览《用户指南》。

source: FAQ
ja: よくある質問
ru: Часто задаваемые вопросы
ta: கேள்விகள்
zh_hans: 常见问题

source: Non "`File`" Types Using `evalFrom`
ru: Не "`Файл`" Типы, использующие `evalFrom`
ta: `எவல்ஃப்ரோம்` ஐப் பயன்படுத்தி" `கோப்பு`" வகைகள்
zh_hans: 使用 `evalFrom` 的非“`File`”类型

source: Rename an Input File
ru: Переименование входного файла
ta: உள்ளீட்டு கோப்பை மறுபெயரிடுங்கள்
zh_hans: 重命名输入文件

source: This example demonstrates how to change the name of an input file as part of a tool description. This could be useful when you are taking files produced from another step in a workflow, and don't want to work with the default names that these files were given when they were created.
ja: この例では、ツール定義の一部として、入力ファイルの名前を変更する方法を説明します。これは、ワークフローの別のステップで作成されたファイルを使用する場合に、これらのファイルが作成されたときに与えられたデフォルトの名前を使用して作業したくない場合に便利です。
ru: Этот пример демонстрирует, как изменить имя входного файла в описании инструмента. Это может быть полезно, когда вы берете файлы, созданные на другом этапе рабочего процесса, и не хотите работать с именами по умолчанию, которые были присвоены этим файлам при их создании.
ta: கருவி விளக்கத்தின் ஒரு பகுதியாக உள்ளீட்டு கோப்பின் பெயரை எவ்வாறு மாற்றுவது என்பதை இந்த எடுத்துக்காட்டு நிரூபிக்கிறது. பணிப்பாய்வுகளின் மற்றொரு படியிலிருந்து தயாரிக்கப்பட்ட கோப்புகளை நீங்கள் எடுக்கும்போது இது பயனுள்ளதாக இருக்கும், மேலும் இந்த கோப்புகள் உருவாக்கப்பட்டபோது வழங்கப்பட்ட இயல்புநிலை பெயர்களுடன் வேலை செய்ய விரும்பவில்லை.
zh_hans: 本示例演示如何在工具描述 (tool description) 中更改输入文件名称。如果要使用工作流中其它步骤产生的文件，但又不想使用这些文件创建时的默认名称，这时候更名操作可以派上用场。

source: Rename an Output File
ru: Переименование выходного файла
ta: வெளியீட்டு கோப்பை மறுபெயரிடுங்கள்
zh_hans: 重命名输出文件

source: This example demonstrates how to change the name of an output file from the default name given to it by a tool:
ja: この例では、出力ファイルの名前を、ツールから与えられたデフォルトの名前から変更する方法を示します：
ru: В этом примере показано, как изменить имя выходного файла по сравнению с именем по умолчанию, присвоенным ему инструментом:
ta: ஒரு கருவி மூலம் வழங்கப்பட்ட இயல்புநிலை பெயரிலிருந்து வெளியீட்டு கோப்பின் பெயரை எவ்வாறு மாற்றுவது என்பதை இந்த எடுத்துக்காட்டு நிரூபிக்கிறது:
zh_hans: 本示例演示更改输出文件名，不再使用某个工具赋予它的默认名称：

source: Referencing a Local Script
ru: Ссылка на локальный сценарий
ta: உள்ளக ச்கிரிப்டைக் குறிப்பிடுகிறது
zh_hans: 引用本地脚本

source: There are two ways to reference a local script:
ja: ローカルスクリプトを参照するには、2つの方法があります：
ru: Существует два способа сослаться на локальный скрипт:
ta: உள்ளக ச்கிரிப்டைக் குறிப்பிட இரண்டு வழிகள் உள்ளன:
zh_hans: 引用本地脚本有两种方法：

source: The first method involves adding the folder containing your scripts to the `PATH` environment variable. This allows you to run the shell script directly without using `sh` or `bash` commands.
ru: Первый способ заключается в добавлении папки с вашими скриптами в переменную окружения `PATH`. Это позволит вам запускать сценарий оболочки напрямую, без использования команд `sh` или `bash`.
ta: முதல் முறை உங்கள் ச்கிரிப்ட்களைக் கொண்ட கோப்புறையை `பாதை` சுற்றுச்சூழல் மாறியில் சேர்ப்பது அடங்கும். `Sh` அல்லது` பாச்` கட்டளைகளைப் பயன்படுத்தாமல் செல் ச்கிரிப்டை நேரடியாக இயக்க இது உங்களை அனுமதிக்கிறது.
zh_hans: 第一种方法是将包含相关脚本的文件夹添加至`PATH`（路径）环境变量。这样可以直接运行 shell 脚本，无需使用 `sh` 或 `bash` 命令。

source: Start with adding a _shebang_ at the top of your file:
ja: まず、ファイルの先頭に _shebang_ を追加します：
ru: Начните с добавления _shebang_ в начало файла:
ta: உங்கள் கோப்பின் மேற்புறத்தில் _shebang_ ஐச் சேர்ப்பதன் மூலம் தொடங்கவும்:
zh_hans: 首先，将 _"shebang"_ 添加为文件首行：

source: After that, make the script executable with the command `chmod +x scriptname.sh`
ja: その後、`chmod +x scriptname.sh` というコマンドでスクリプトを実行可能な状態にします
ru: После этого сделайте скрипт исполняемым с помощью команды `chmod +x scriptname.sh`
ta: அதன்பிறகு, `chmod +x scriptname.sh` கட்டளையுடன் ச்கிரிப்டை இயக்கவும்
zh_hans: 然后，用 `chmod +x scriptname.sh` 命令将脚本设为可执行。

source: Finally, modify your `PATH` to add the directory where your script is located. (It is good practice to use `$HOME/bin` for storing your own scripts).
ja: 最後に、`PATH` を変更し、スクリプトが置かれているディレクトリを追加します。(`$HOME/bin` を自分のスクリプトを保存するために使用するのは良い習慣です）。
ru: Наконец, измените `PATH`, чтобы добавить каталог, в котором находится ваш скрипт. (Хорошей практикой является использование `$HOME/bin` для хранения собственных скриптов).
ta: இறுதியாக, உங்கள் ச்கிரிப்ட் அமைந்துள்ள கோப்பகத்தைச் சேர்க்க உங்கள் `பாதையை` மாற்றவும். (உங்கள் சொந்த ச்கிரிப்ட்களை சேமிக்க `$ home/bin` ஐப் பயன்படுத்துவது நல்ல நடைமுறை).
zh_hans: 最后，修改 `PATH`, 添加该脚本所在的目录。（把你自己的脚本保存在 `$HOME/bin` 目录下是较好的做法）。

source: Now you can use `baseCommand: scriptname.sh` to run the script directly.
ja: これで、`baseCommand: scriptname.sh` を使って、スクリプトを直接実行できるようになりました。
ru: Теперь вы можете использовать `baseCommand: scriptname.sh`, чтобы запустить скрипт напрямую.
ta: இப்போது நீங்கள் ச்கிரிப்டை நேரடியாக இயக்க `BasCommand: scriptname.sh` ஐப் பயன்படுத்தலாம்.
zh_hans: 这样，您就能用 `baseCommand: scriptname.sh` 直接运行脚本了。

source: When you wish to share your work later, you can place your script in a software container in the Docker format.
ja: 後で作ったものを共有したいときは、スクリプトをDockerコンテナに入れることができます。
ru: Если вы захотите поделиться своей работой позже, вы можете поместить свой скрипт в программный контейнер в формате Docker.
ta: உங்கள் வேலையை பின்னர் பகிர்ந்து கொள்ள விரும்பினால், உங்கள் ச்கிரிப்டை மென்பொருள் கொள்கலனில் கப்பல்துறை வடிவத்தில் வைக்கலாம்.
zh_hans: 接下来若想共享您的工作，可将脚本存放在 Docker 格式的容器 (container) 中。

source: The second method involves including an input of `type: File` in the script itself:
ru: Второй способ предполагает включение входных данных типа `type: File` в самом скрипте:
ta: இரண்டாவது முறை ச்கிரிப்டில் `வகை: கோப்பு` உள்ளீட்டை உள்ளடக்கியது:
zh_hans: 第二种方法是将 `type: File` 输入内容编写进脚本：

source: In CWL, everything must be directly stated.
ru: В CWL все должно быть прямо указано.
ta: சி.டபிள்யூ.எல் இல், எல்லாவற்றையும் நேரடியாகக் கூற வேண்டும்.
zh_hans: 在CWL中，一切都必须直接说明。

source: Setting `self`-based Input Bindings for Optional Inputs
ru: Установка привязок ввода на основе `self` для необязательных входов
ta: விருப்ப உள்ளீடுகளுக்கு `தன்`-அடிப்படையிலான உள்ளீட்டு பிணைப்புகளை அமைத்தல்
zh_hans: 为可选输入项设置用到 `self` 变量的输入绑定

source: Currently, `cwltool` can't cope with missing optional inputs if their input binding makes use of `self`. Below is an example workaround for this, pending a more sophisticated fix.
ja: 現在、`cwltool` は、入力バインディングが`self` を使用している場合、オプション入力が見つからない事に対処することができません。以下は、より洗練された修正を待つ間の回避策の例です。
ru: В настоящее время `cwltool` не может справиться с отсутствующими необязательными входами, если их привязка к входу использует `self`. Ниже приведен пример обходного пути для этого, в ожидании более сложного исправления.
ta: தற்போது, `cwltool` அவர்களின் உள்ளீட்டு பிணைப்பு` சுயத்தை 'பயன்படுத்தினால், காணாமல் போன விருப்ப உள்ளீடுகளை சமாளிக்க முடியாது. இதற்கான ஒரு எடுத்துக்காட்டு பணித்தொகுப்பு கீழே உள்ளது, இது மிகவும் அதிநவீன பிழைத்திருத்தம் நிலுவையில் உள்ளது.
zh_hans: 目前，如果缺失的可选输入项用到了 `self`, `cwltool` 将无法处理。在更高明的解决办法出现前，下面的例子可作为临时变通一用。

source: Model a "one-or-the-other" Parameter
ru: Моделирование параметра "один-другой"
ta: மாதிரி A "ஒன்று அல்லது பிற" அளவுரு
zh_hans: 构建“非此即彼”参数的模型

source: Below is an example showing how to specify different strings to be added to a command line, based on the value given to a Boolean parameter.
ja: 以下は、Booleanパラメータの値によって、コマンドラインに追加する文字列を変える例を示しています。
ru: Ниже приведен пример, показывающий, как указать различные строки для добавления в командную строку в зависимости от значения булевого параметра.
ta: பூலியன் அளவுருவுக்கு கொடுக்கப்பட்ட மதிப்பின் அடிப்படையில், கட்டளை வரியில் சேர்க்கப்பட வேண்டிய வெவ்வேறு சரங்களை எவ்வாறு குறிப்பிடுவது என்பதைக் காட்டும் ஒரு எடுத்துக்காட்டு கீழே.
zh_hans: 以下示例演示的，是根据某个布尔参数的取值，来指定添加到命令行的字符串。

source: Connect a Solo Value to an Input that Expects an Array of that Type
ru: Подключите значение Solo к входу, который ожидает массив этого типа
ta: அந்த வகையின் வரிசையை எதிர்பார்க்கும் உள்ளீட்டுடன் ஒரு தனி மதிப்பை இணைக்கவும்
zh_hans: 将某个元素值与期待该值类型的数组关联起来

source: Using [`MultipleInputFeatureRequirement`](https://www.commonwl.org/v1.0/Workflow.html#MultipleInputFeatureRequirement) along with [`linkMerge: merge_nested`](https://www.commonwl.org/v1.0/Workflow.html#WorkflowStepInput)
ru: Использование [`MultipleInputFeatureRequirement`](https://www.commonwl.org/v1.0/Workflow.html#MultipleInputFeatureRequirement) вместе с [`linkMerge: merge_nested`](https://www.commonwl.org/v1.0/Workflow.html#WorkflowStepInput)
ta: [`MultipleInputFeatureRequirement`](https://www.commonwl.org/v1.0/Workflow.html#MultipleInputFeatureRequirement) உடன் [`linkMerge: merge_nested`](https://www.commonwl.org/v1.0/Workflow.html#WorkflowStepInput)
zh_hans: 将 [`MultipleInputFeatureRequirement`](https://www.commonwl.org/v1.0/Workflow.html#MultipleInputFeatureRequirement) 与 [`linkMerge: merge_nested`](https://www.commonwl.org/v1.0/Workflow.html#WorkflowStepInput) 联合使用

source: The input must be an array consisting of exactly one entry for each input link. If "merge_nested" is specified with a single link, the value from the link must be wrapped in a single-item list.
ru: Входные данные должны представлять собой массив, состоящий ровно из одной записи для каждой входной ссылки. Если для одной ссылки указано "merge_nested", то значение из ссылки должно быть обернуто в список из одного элемента.
ta: உள்ளீடு ஒவ்வொரு உள்ளீட்டு இணைப்பிற்கும் சரியாக ஒரு உள்ளீட்டைக் கொண்ட ஒரு வரிசையாக இருக்க வேண்டும். "Merge_nested" ஒற்றை இணைப்புடன் குறிப்பிடப்பட்டால், இணைப்பிலிருந்து வரும் மதிப்பு ஒற்றை-உருப்படி பட்டியலில் மூடப்பட வேண்டும்.
zh_hans: 输入必须是一个数组，每个输入链接只包含一个条目。如果使用单个链接指定“merge_nested”，则链接中的值必须包含在单项列表中。

source: Which means "create a list with exactly these sources as elements"
ru: Что означает "создать список, элементами которого являются именно эти источники"
ta: அதாவது "இந்த ஆதாரங்களைக் கொண்ட ஒரு பட்டியலை கூறுகளாக உருவாக்கவும்"
zh_hans: 这段话意思是，“创建一个列表，其中的元素正是这些源”

source: Or in other words: if the destination is of type `File[]` (an array of `File`s) and the source is a single `File` then add `MultipleInputFeatureRequirement` to the Workflow level `requirements` and add `linkMerge: merge_nested` under the appropriate `in` entry of the destination step.
ru: Или другими словами: если пункт назначения имеет тип `File[]` (массив `File`), а источник - один `File`, то добавьте `MultipleInputFeatureRequirement` в `требования` уровня Workflow и добавьте `linkMerge: merge_nested` в соответствующую запись `in` шага назначения.
ta: அல்லது வேறுவிதமாகக் கூறினால்: இலக்கு `கோப்பு []` (`கோப்பின் வரிசையின்) வகை மற்றும் மூலமானது ஒற்றை` கோப்பு` என்றால், பின்னர் `மல்டிபுட்ஃபியூட்யூர்ரெக்யூமென்ட் 'ஐச் சேர்த்து` தேவைகள்` மற்றும் `லிங்க்மர்ச் சேர்க்கவும் .
zh_hans: 换言之：如果目标的类型是 `File[]`（元素类型为 `File ` 的数组），而源是单独一个 `File`，那么将 `MultipleInputFeatureRequirements` 添加到工作流级别的 `requirements`，并在目标步骤相应的 `in` 条目下添加 `linkMerge： merge_nested`。

source: Optional Inputs 💯
ru: Дополнительные входы 💯
ta: விருப்ப உள்ளீடுகள்
zh_hans: 可选输入💯

source: To make an input parameter optional, add a question mark to the type declaration.
ja: 入力パラメータをオプションにするには、型宣言に疑問符を付けます。
ru: Чтобы сделать входной параметр необязательным, добавьте вопросительный знак в объявление типа.
ta: உள்ளீட்டு அளவுருவை விருப்பமாக மாற்ற, வகை அறிவிப்பில் கேள்விக்குறியைச் சேர்க்கவும்.
zh_hans: 若要令某个输入参数为可选，请在其类型声明中添加问号。

source: Enum Inputs ⚜️
ru: Входы Enum ⚜️
ta: Enum உள்ளீடுகள்
zh_hans: 枚举输入 ⚜️

source: For command line flags that require a specific input as the argument an enum type can be declared in CWL. **Specifying null here is known as long form style. It does the same thing as the question mark on the other inputs.**
ru: Для флагов командной строки, которые требуют определенного ввода в качестве аргумента, в CWL может быть объявлен тип enum. **Указание здесь null известно как стиль длинной формы. Он делает то же самое, что и вопросительный знак на других входах**
ta: ஒரு குறிப்பிட்ட உள்ளீடு தேவைப்படும் கட்டளை வரி கொடிகளுக்கு CWL இல் ஒரு enum வகையை அறிவிக்க முடியும். ** இங்கே NULL ஐக் குறிப்பிடுவது நீண்ட வடிவ பாணி என்று அழைக்கப்படுகிறது. இது மற்ற உள்ளீடுகளில் கேள்விக்குறியைப் போலவே செய்கிறது. **
zh_hans: 某些命令行标志需要特定的参数值；对此，可以在 CWL 中声明枚举类型。**此处指定 null, 这样的编程风格称为“长格式” (long form)。它的作用与其他输入上的问号相同。**

source: Record Inputs 📀
ru: Запись входов 📀
ta: உள்ளீடுகளை பதிவு செய்யுங்கள்
zh_hans: 记录输入 📀

source: For commandline flags that are either **mutually exclusive** or **dependent** a special record type can be defined. You can also specify null here to create optional inputs.
ru: Для флагов командной строки, которые являются **взаимоисключающими** или **зависимыми**, может быть определен специальный тип записи. Вы также можете указать здесь null для создания необязательных входов.
ta: ** பரச்பர பிரத்தியேக ** அல்லது ** சார்பு ** ஒரு சிறப்பு பதிவு வகையை வரையறுக்கலாம். விருப்ப உள்ளீடுகளை உருவாக்க நீங்கள் இங்கே NULL ஐ குறிப்பிடலாம்.
zh_hans: 如果部分命令行标志之间存在 **互斥** 或 **依赖** 的关系，可以为其定义专门的记录类型 (record type)。此处也可以指定 null 创建可选输入。

source: Setting Mutually Exclusive Parameters
ru: Установка взаимоисключающих параметров
ta: பரச்பர பிரத்தியேக அளவுருக்களை அமைத்தல்
zh_hans: 设定互斥参数
