Repository: common-workflow-language/user_guide
Catalog: locales/*/LC_MESSAGES/user_guide.po
Languages: ja, ru, ta, zh_hans

source: To properly set fields in a record input type, you need to pass a dictionary to the input to properly set the parameters. This is done by using inline JavaScript and returning the dictionary with the key of the field you want to set. The source field is set to indicate the input from the workflow to be used as the value.
ru: Чтобы правильно задать поля в типе ввода записи, необходимо передать словарь в input для правильной установки параметров. Для этого используется встроенный JavaScript и возвращается словарь с ключом поля, которое вы хотите установить. Поле источника задается для указания ввода из рабочего процесса, который будет использоваться в качестве значения.
ta: பதிவு உள்ளீட்டு வகையில் புலங்களை சரியாக அமைக்க, அளவுருக்களை சரியாக அமைக்க நீங்கள் ஒரு அகராதியை உள்ளீட்டிற்கு அனுப்ப வேண்டும். இன்லைன் சாவாச்கிரிப்டைப் பயன்படுத்துவதன் மூலமும், நீங்கள் அமைக்க விரும்பும் புலத்தின் விசையுடன் அகராதியைத் திருப்புவதன் மூலமும் இது செய்யப்படுகிறது. பணிப்பாய்வுகளிலிருந்து உள்ளீடு மதிப்பாக பயன்படுத்தப்படுவதைக் குறிக்க மூல புலம் அமைக்கப்பட்டுள்ளது.
zh_hans: 为了正确地设置记录输入类型的字段，您需要将字典传递给输入，以正确设置参数。具体方法是使用内联 JavaScript 返回以待设置字段为主键的字典。此处设定了 source （源）字段，以指示工作流中要充当其键值的输入。

source: Setting Booleans
ru: Настройка булевых значений
ta: பூலியன்சை அமைத்தல்
zh_hans: 设置布尔参数

source: These can be set by using the default field
ja: デフォルトフィールドを使って、これらを設定します
ru: Их можно задать с помощью поля по умолчанию
ta: இயல்புநிலை புலத்தைப் பயன்படுத்தி இவற்றை அமைக்கலாம்
zh_hans: 可使用 default（默认）字段设置

source: Concatenating Strings in Inputs
ru: Конкатенация строк во входных данных
ta: உள்ளீடுகளில் சரங்களை இணைத்தல்
zh_hans: 在输入中串联字符串

source: The valueFrom field must be used instead of default.
ja: defaultフィールドの代わりにvalueFromフィールドを使用する必要があります。
ru: Поле valueFrom должно использоваться вместо default.
ta: இயல்புநிலைக்கு பதிலாக மதிப்பு முதல் புலம் பயன்படுத்தப்பட வேண்டும்.
zh_hans: 为此必须使用 valueFrom 而非 default 字段。

source: `cwltool` Errors due to Filenames with Space Characters Inside
ru: Ошибки `cwltool` из-за имен файлов с пробельными символами внутри
ta: `cwltool` பிழைகள் உள்ளே உள்ள விண்வெளி எழுத்துக்களைக் கொண்ட கோப்பு பெயர்கள் காரணமாக
zh_hans: 因文件名含有空格字符，`cwltool`报错

source: `cwltool` does not allow some characters in filenames by default.
ja: `cwltool` は、デフォルトではファイル名に一部の文字を許可していません。
ru: По умолчанию `cwltool` не разрешает использовать некоторые символы в именах файлов.
ta: `cwltool` இயல்புநிலையாக கோப்பு பெயர்களில் சில எழுத்துக்களை அனுமதிக்காது.
zh_hans: 默认情况下，`cwltool`不允许某些字符出现在文件名中。

source: For example, the filename `a space is here.txt` includes 3 space characters.
ja: 例えば、`a space is here.txt` というファイル名には、3つの空白文字が含まれています。
ru: Например, имя файла `a space is here.txt` содержит 3 символа пробела.
ta: எடுத்துக்காட்டாக, `ஒரு இடம் இங்கே உள்ளது. TXT` 3 விண்வெளி எழுத்துக்களை உள்ளடக்கியது.
zh_hans: 例如，文件名 `a space is here.txt`包含三个空格字符。

source: If you can not avoid these dangerous characters, then pass `--relax-path-checks` to `cwltool`.
ja: これらの危険な文字を避けられない場合は、`--relax-path-checks` を`cwltool` に渡してください。
ru: Если вы не можете избежать этих опасных символов, то передайте `--relax-path-checks` в `cwltool`.
ta: இந்த ஆபத்தான கதாபாத்திரங்களை நீங்கள் தவிர்க்க முடியாவிட்டால், `--ரெலாக்ச்-பாத்-செக்ச்` ஐ` cwltool` க்கு அனுப்பவும்.
zh_hans: 如果不能避开这些危险的字符，您可以为 `cwltool` 传递 `--relax-path-checks` 选项。

source: CWL Parameter Reference Error due to Hyphen in Input Identifier
ru: Ошибка ссылки на параметр CWL из-за дефиса в входном идентификаторе
ta: உள்ளீட்டு அடையாளங்காட்டியில் ஐபன் காரணமாக சி.டபிள்யூ.எல் அளவுரு குறிப்பு பிழை
zh_hans: 输入标识符中包含连字符导致 CWL 参数引用错误

source: If `cwltool --validate` returns valid
ja: `cwltool --validate` の結果に問題ない場合
ru: Если `cwltool --validate` возвращает действительный
ta: `Cwltool -வாலிடேட்` வருவது செல்லுபடியாகும்
zh_hans: 如 `cwltool --validate` 返回 valid（验证通过）

source: But executing it causes an error like:
ja: しかし、実行すると以下のようなエラーが発生します：
ru: Но его выполнение приводит к ошибке типа:
ta: ஆனால் அதை செயல்படுத்துவது போன்ற பிழையை ஏற்படுத்துகிறது:
zh_hans: 但执行时导致如下错误：

source: The file is here
ja: ファイルはこちらです
ru: Файл находится здесь
ta: கோப்பு இங்கே உள்ளது
zh_hans: 该文件如下

source: Problem caused by `-` (hyphen character).
ja: `-` (ハイフン文字、引き算の記号)が原因で発生した問題です。
ru: Проблема, вызванная `-` (символом дефиса).
ta: `-` (ஐபன் எழுத்து) காரணமாக ஏற்படும் சிக்கல்.
zh_hans: 问题由 `-`（连字符）引发。

source: To fix this error, change `-` (hyphen) to `_` (underscore)
ru: Чтобы исправить эту ошибку, замените `-` (дефис) на `_` (знак подчеркивания)
ta: இந்த பிழையை சரிசெய்ய, `-` (ஐபன்)
zh_hans: 修复方法是将 `-`（连字符）更改为 `_`（下划线）

source: If it is not possible to change the input identifier, then you can use an alternative CWL Parameter Reference syntax:
ja: 入力識別子を変更することができない場合は、別のCWLパラメータリファレンス構文を使用することができます：
ru: Если изменить входной идентификатор невозможно, можно использовать альтернативный синтаксис справочника параметров CWL:
ta: உள்ளீட்டு அடையாளங்காட்டியை மாற்ற முடியாவிட்டால், நீங்கள் ஒரு மாற்று CWL அளவுரு குறிப்பு தொடரியல் பயன்படுத்தலாம்:
zh_hans: 如果不能改动输入标识符，您可使用另一种 CWL 参数引用句法：

source: Use CWL and cwltool with Singularity
ru: Использование CWL и cwltool с Singularity
ta: சி.டபிள்யூ.எல் மற்றும் சி.டபிள்யூ.எல்.டூலை ஒருமைப்பாட்டுடன் பயன்படுத்தவும்
zh_hans: 在 Singularity 下使用 CWL 和 cwltool

source: The CWL standards are built around (optional) Docker format containers. The reference runner and several other CWL implementations support running those Docker format containers using the Singularity engine. Directly specifying a Singularity format container is not part of the CWL standards.
ja: CWL標準は、（オプションの）Docker形式のコンテナを中心に構築されています。リファレンスランナーや他のいくつかのCWL実装は、Singularityエンジンを使用してそれらのDockerフォーマットコンテナを実行することをサポートしています。Singularityフォーマットコンテナを直接指定することは、CWL標準ではありません。
ru: Стандарты CWL построены на основе контейнеров формата Docker (по желанию). Эталонный runner и некоторые другие реализации CWL поддерживают запуск контейнеров формата Docker с помощью движка Singularity. Прямое указание контейнера формата Singularity не является частью стандартов CWL.
ta: சி.டபிள்யூ.எல் தரநிலைகள் (விருப்ப) கப்பல்துறை வடிவமைப்பு கொள்கலன்களைச் சுற்றி கட்டப்பட்டுள்ளன. குறிப்பு ரன்னர் மற்றும் பல சி.டபிள்யூ.எல் செயலாக்கங்கள் அந்த கப்பல்துறை வடிவமைப்பு கொள்கலன்களை ஒருமைப்பாட்டு இயந்திரத்தைப் பயன்படுத்தி இயக்குகின்றன. ஒரு ஒருமை வடிவமைப்பு கொள்கலனை நேரடியாகக் குறிப்பிடுவது CWL தரங்களின் ஒரு பகுதியாக இல்லை.
zh_hans: CWL 标准是依照 Docker 容器格式建立的，其参考运行程序和另外几种 CWL 实现均支持适应 Singularity 引擎运行 Docker 格式容器。不过，直接指定 Singularity 格式容器不在 CWL 标准之内。

source: Debug JavaScript Expressions
ru: Отладка выражений JavaScript
ta: சாவாச்கிரிப்ட் வெளிப்பாடுகள் பிழைத்திருத்த
zh_hans: 调试 JavaScript 表达式

source: You can use the <code>--js-console</code> option of <code>cwltool</code>, or you can try creating a JavaScript or TypeScript project for your code, and load it using <code>expressionLib</code>, e.g.: <a href="https://github.com/common-workflow-language/common-workflow-language/blob/master/v1.0/v1.0/template-tool.cwl#L6-L8"> https://github.com/common-workflow-language/common-workflow-language/blob/master/v1.0/v1.0/template-tool.cwl#L6-L8</a></dd>
ta: நீங்கள் <code>-JS-CONSOLE </code> <code> cwltool </code> இன் விருப்பத்தைப் பயன்படுத்தலாம், அல்லது உங்கள் குறியீட்டிற்கான சாவாச்கிரிப்ட் அல்லது டைப்ச்கிரிப்ட் திட்டத்தை உருவாக்க முயற்சி செய்யலாம், மேலும் <குறியீடு> எக்ச்பிரசன் லிப் <ஐப் பயன்படுத்தி அதை ஏற்றலாம் /குறியீடு>, எ.கா. -L8 "> https://github.com/common-workflow-language/common-workflow-language/blob/master/v1.0/v1.0/template-tool.cwl#-l8 </a> </a> < /dd>
zh_hans: 您可使用 <code>cwltool</code> 的 <code>--js-console</code> 选项，也可以考虑为您的代码创建 JavaScript 或 TypeScript 项目后使用 <code>expressionLib</code> 加载， 比如： <a href="https://github.com/common-workflow-language/common-workflow-language/blob/master/v1.0/v1.0/template-tool.cwl#L6-L8"> https://github.com/common-workflow-language/common-workflow-language/blob/master/v1.0/v1.0/template-tool.cwl#L6-L8</a>

source: Common Workflow Language User Guide
ja: Common Workflow Language ユーザーガイド
ru: Руководство пользователя Common Workflow Language
ta: பொதுவான பணிப்பாய்வு மொழி பயனர் வழிகாட்டி
zh_hans: 通用工作流语言用户指南

source: This guide will introduce you to writing workflows using the [Common Workflow Language](https://www.commonwl.org/) (CWL) open standards. This guide describes the latest specification {{ cwl_version }}.
ja: 本ガイドは、オープンスタンダードである [Common Workflow Language](https://www.commonwl.org/) (CWL) を使用したワークフローの書き方を紹介するものです。本ガイドは、最新仕様{{ cwl_version }}を解説しています。
ru: Это руководство познакомит вас с написанием рабочих процессов с использованием открытых стандартов [Common Workflow Language](https://www.commonwl.org/) (CWL). В этом руководстве описывается последняя спецификация {{ cwl_version }}.
ta: [பொதுவான பணிப்பாய்வு மொழி](https://www.commonwl.org/) (சி.டபிள்யூ.எல்) திறந்த தரங்களைப் பயன்படுத்தி பணிப்பாய்வுகளை எழுதுவதற்கு இந்த வழிகாட்டி உங்களை அறிமுகப்படுத்தும். இந்த வழிகாட்டி அண்மைக் கால விவரக்குறிப்பை விவரிக்கிறது {{ cwl_version }}.
zh_hans: 这本指南将向您介绍使用 [Common Workflow Language](https://www.commonwl.org/) (CWL) 开放标准编写工作流。本指南所描述的是 {{ cwl_version }} 版本最新规范。

source: Contributions and Feedback are Welcome!
ja: ご意見、ご感想、貢献をお待ちしております!
ru: Вклад и отзывы приветствуются!
ta: பங்களிப்புகள் மற்றும் பின்னூட்டங்கள் வரவேற்கப்படுகின்றன!
zh_hans: 欢迎您的来稿和意见！

source: If you find that something is missing from this guide, or if you would like to provide other feedback, file an Issue on the [project repository for this guide][repo]. You can also suggest changes directly in a Pull Request by clicking the "Edit this page" button at the right sidebar of each page.
ja: このガイドに足りないものがある場合、またはその他のフィードバックを提供したい場合は、[このユーザーガイドのプロジェクトリポジトリ][repo]にIssueを作成してください。また、各ページの右サイドバーにある「このページを編集する」ボタンをクリックすると、Pull Requestで直接変更を提案することができます。
ru: Если вы обнаружили, что в этом руководстве чего-то не хватает, или хотите дать другие отзывы, оформите проблему в [репозитории проекта для этого руководства][repo]. Вы также можете предложить изменения непосредственно в Pull Request, нажав кнопку "Редактировать эту страницу" в правой боковой панели каждой страницы.
ta: இந்த வழிகாட்டியிலிருந்து ஏதேனும் காணவில்லை என்று நீங்கள் கண்டால், அல்லது பிற கருத்துக்களை வழங்க விரும்பினால், [இந்த வழிகாட்டிக்கான திட்ட களஞ்சியத்தில்][repo] இல் சிக்கலை தாக்கல் செய்யுங்கள். ஒவ்வொரு பக்கத்தின் வலது பக்கப்பட்டியில் "இந்த பக்கத்தைத் திருத்து" பொத்தானைக் சொடுக்கு செய்வதன் மூலம் இழுக்கும் கோரிக்கையில் நேரடியாக மாற்றங்களை நீங்கள் பரிந்துரைக்கலாம்.
zh_hans: 如您发现本指南的疏漏之处，或想提供其他反馈，请在[本指南项目源码库][repo]上提交报告 (Issue). 您也可在任意页面点击右边栏的 “Edit this page”（编辑本页）按钮，创建 Pull Request（拉取请求）直接提交修改建议。

source: Navigating the User Guide
ja: ユーザーガイドの使い方
ru: Навигация по руководству пользователя
ta: பயனர் வழிகாட்டியை வழிநடத்துதல்
zh_hans: 浏览《用户指南》

source: If you are a beginner user get started with the [Introduction](/introduction/index.md) section. For advanced users the subsections of the [Topics](/topics/index.md) have detailed information about the most common topics for CWL.
ja: 初心者の方は、[はじめに](/introduction/index.md)のセクションから始めてください。上級者向けには、[Topics](/topics/index.md)のサブセクションに、CWLで最も一般的なトピックに関する詳細情報があります。
ru: Если вы начинающий пользователь, начните с раздела [Введение](/introduction/index.md). Для опытных пользователей в подразделах раздела [Topics](/topics/index.md) содержится подробная информация о наиболее распространенных темах для CWL.
ta: நீங்கள் ஒரு தொடக்க பயனராக இருந்தால் [அறிமுகம்](/introduction/index.md) பிரிவில் தொடங்கலாம். மேம்பட்ட பயனர்களுக்கு [தலைப்புகள்](/topics/index.md)குறியீட்டு.
zh_hans: 如您是新用户，请从 [《入门》](/introduction/index.md) 章节出发。而对于进阶用户而言， [《主题》](/topics/index.md)部分各小节涵盖了关于 CWL 最常见话题的详细信息。

source: The Table of Contents is displayed at the top menu and also on the left sidebar. It also appears further down this page but with links to subsections. The right sidebar contains links to the sections of each page, and the Search form is on the left sidebar.
ja: 目次は、トップメニューと左サイドバーに表示されています。また、このページのさらに下にも表示されますが、サブセクションへのリンクがあります。右サイドバーには各ページのセクションへのリンクがあり、左サイドバーには「検索フォーム」があります。
ru: Оглавление отображается в верхнем меню, а также на левой боковой панели. Оно также отображается далее на этой странице, но со ссылками на подразделы. Правая боковая панель содержит ссылки на разделы каждой страницы, а форма поиска находится на левой боковой панели.
ta: உள்ளடக்க அட்டவணை மேல் மெனுவிலும் இடது பக்கப்பட்டியிலும் காட்டப்படும். இது இந்த பக்கத்தின் மேலும் கீழே தோன்றுகிறது, ஆனால் துணைப்பிரிவுகளுக்கான இணைப்புகளுடன். வலது பக்கப்பட்டியில் ஒவ்வொரு பக்கத்தின் பிரிவுகளுக்கான இணைப்புகள் உள்ளன, மேலும் தேடல் படிவம் இடது பக்கப்பட்டியில் உள்ளது.
zh_hans: 目录显示在顶部菜单和左侧边栏，本页更下方也有带小节链接的目录。右侧边栏有当前单页分节链接，搜索功能在左侧边栏。

source: Table of Contents
ja: 目次
ru: Оглавление
ta: உள்ளடக்க அட்டவணை
zh_hans: 目录

source: Basic Concepts
ja: 基本コンセプト
ru: Основные концепции
ta: அடிப்படை கருத்துக்கள்
zh_hans: 基本概念

source: This section describes the basic concepts for users to get started on working with Common Workflow Language (CWL) workflows. Readers are expected to be familiar with workflow managers, YAML, and comfortable with following instructions for the command-line. The other sections of the user guide cover the same concepts, but in more detail. If you are already familiar with CWL or you are looking for more advanced content, you may want to skip this section.
ja: このセクションでは、Common Workflow Language（CWL）ワークフローの使用を開始するための基本的な概念について説明します。読者は、ワークフローマネージャー、YAML に精通し、コマンドラインの指示に従うことに慣れていることが期待されます。このユーザーガイドの他のセクションは、同じ概念をカバーしていますが、より詳細に説明されています。すでにCWLに精通している場合、またはより高度なコンテンツを探している場合は、このセクションをスキップすることができます。
ru: В этом разделе описаны основные понятия, с помощью которых пользователи смогут начать работу с рабочими процессами на Common Workflow Language (CWL). Предполагается, что читатели знакомы с менеджерами рабочих процессов, YAML и умеют выполнять инструкции в командной строке. В других разделах руководства пользователя рассматриваются те же концепции, но более подробно. Если вы уже знакомы с CWL или ищете более продвинутое содержание, вы можете пропустить этот раздел.
ta: இந்த பிரிவு பயனர்கள் பொதுவான பணிப்பாய்வு மொழி (சி.டபிள்யூ.எல்) பணிப்பாய்வுகளுடன் பணிபுரியத் தொடங்குவதற்கான அடிப்படைக் கருத்துக்களை விவரிக்கிறது. வாசகர்கள் பணிப்பாய்வு மேலாளர்கள், YAML உடன் நன்கு அறிந்திருப்பார்கள், மேலும் கட்டளை வரிக்கான பின்வரும் வழிமுறைகளுடன் வசதியாக இருப்பார்கள். பயனர் வழிகாட்டியின் பிற பிரிவுகள் அதே கருத்துக்களை உள்ளடக்கியது, ஆனால் இன்னும் விரிவாக. நீங்கள் ஏற்கனவே சி.டபிள்யூ.எல் உடன் தெரிந்திருந்தால் அல்லது நீங்கள் இன்னும் மேம்பட்ட உள்ளடக்கத்தைத் தேடுகிறீர்களானால், இந்த பகுதியைத் தவிர்க்க விரும்பலாம்.
zh_hans: 本章节介绍用户开始运用通用工作流语言（CWL）所需的基本概念。读者应了解工作流管理工具和 YAML, 且能较为自如地按照文中指示操作命令行。这些概念在《用户指南》其他部分有更详尽的说明。如果您已了解 CWL, 或想查阅进阶内容，可以考虑跳过本章节。

source: The CWL Specification
ja: CWLの仕様
ru: Спецификация CWL
ta: CWL விவரக்குறிப்பு
zh_hans: CWL 规约

source: The CWL specification is a document written and maintained by the CWL community. The specification has different versions. The version covered in this user guide is the {{ cwl_version }}.
ja: CWL仕様は、CWLコミュニティによって書かれ、維持されている文書です。この仕様には異なるバージョンが存在します。このユーザーガイドで扱うバージョンは{{ cwl_version }}です。
ru: Спецификация CWL - это документ, написанный и поддерживаемый сообществом CWL. У спецификации есть разные версии. В данном руководстве пользователя рассматривается версия {{ cwl_version }}.
ta: சி.டபிள்யூ.எல் விவரக்குறிப்பு என்பது சி.டபிள்யூ.எல் சமூகத்தால் எழுதப்பட்ட மற்றும் பராமரிக்கப்படும் ஒரு ஆவணமாகும். விவரக்குறிப்பில் வெவ்வேறு பதிப்புகள் உள்ளன. இந்த பயனர் வழிகாட்டியில் உள்ள பதிப்பு {{ cwl_version }} ஆகும்.
zh_hans: CWL 规约由 CWL 社群撰写并维护，此规约现有多个版本，本《用户指南》所涵盖的是版本 {{ cwl_version }}.

source: The specification version can have up to three numbers separated by `.`s (dots). The first number is the major release, used for backward-incompatible changes like the removal of deprecated features. The second number is the minor release, used for new features or smaller changes that are backward-compatible. The last number is used for bug fixes, like typos and other corrections to the specification.
ja: 仕様のバージョンは、`.`s（ドット）で区切られた最大3つの数字を持つことができます。最初の番号はメジャーリリースで、非推奨機能の削除など、後方互換性のない変更に使用されます。2番目の番号はマイナーリリースで、新機能や後方互換性のある小さな変更に使用されます。最後の番号は、仕様の誤字やその他の修正など、バグフィックスに使用される番号です。
ru: Версия спецификации может содержать до трех чисел, разделенных `.` (точками). Первый номер - это основной выпуск, используемый для изменений, несовместимых с прошлым, например, для удаления устаревших функций. Второй номер - это минорный релиз, который используется для новых функций или небольших изменений, совместимых с предыдущими версиями. Последний номер используется для исправления ошибок, например, опечаток и других исправлений в спецификации.
ta: விவரக்குறிப்பு பதிப்பில் `.`கள் (புள்ளிகள்) பிரிக்கப்பட்ட மூன்று எண்கள்வரை இருக்கலாம். முதல் எண் முக்கிய வெளியீடு ஆகும், இது நீக்கப்பட்ட அம்சங்களை அகற்றுவது போன்ற பின்தங்கிய-இணக்கமான மாற்றங்களுக்குப் பயன்படுத்தப்படுகிறது. இரண்டாவது எண் சிறிய வெளியீடு ஆகும், இது புதிய நற்பொருத்தங்கள் அல்லது பின்தங்கிய-இணக்கமான சிறிய மாற்றங்களுக்குப் பயன்படுத்தப்படுகிறது. எழுத்துப்பிழைகள் மற்றும் விவரக்குறிப்புக்கான பிற திருத்தங்கள் போன்ற பிழை திருத்தங்களுக்குக் கடைசி எண் பயன்படுத்தப்படுகிறது.
zh_hans: 规约的版本号码由至多三个数字构成，以 `.`（圆点）分隔。第一个数字为主发布版本，用于向后不可兼容的更改，例如删除过时的功能。第二个数字是次级发布版本，用于新增功能或向后兼容的小幅调整。最后一个数字用于错误修复，例如打字错误或其他更正。

source: The model used for the specification version is called Semantic Versioning. See the end of this section to [learn more](#learn-more) about it.
ja: 仕様のバージョンアップに使われるモデルは、セマンティックバージョニングです。それについて[もっと知りたい](#learn-more)方は、このセクションの最後をご覧ください。
ru: Модель, используемая для создания версии спецификации, называется Semantic Versioning. См. конец этого раздела, чтобы [узнать больше](#learn-more) о ней.
ta: விவரக்குறிப்பு பதிப்பிற்கு பயன்படுத்தப்படும் மாதிரி சொற்பொருள் பதிப்பு என்று அழைக்கப்படுகிறது. இதைப் பற்றி [மேலும் அறிக](#learn-more) இந்த பிரிவின் முடிவைக் காண்க.
zh_hans: 规约所使用的版本标号模型称为“语义型版本”，请参阅本章结尾以[了解更多](#learn-more)相关信息。

source: Implementations
ja: 実装
ru: Осуществление
ta: செயல்படுத்தல்கள்
zh_hans: 实现

source: An implementation of the CWL specification is any software written following what is defined in a version of the specification document. However, implementations may not implement every aspect of the specification. CWL implementations are licensed under both Open Source and commercial licenses.
ja: CWL仕様の実装とは、あるバージョンの仕様書で定義された内容に従って書かれたソフトウェアのことです。ただし、実装は仕様にあるすべてを実装するわけではありません。CWLの実装は、オープンソース・ライセンスと商用ライセンスの両方でライセンスされています。
ru: Реализация спецификации CWL - это любое программное обеспечение, написанное в соответствии с тем, что определено в той или иной версии документа спецификации. Однако реализации могут не реализовывать все аспекты спецификации. Реализации CWL лицензируются как под Open Source, так и под коммерческими лицензиями.
ta: சி.டபிள்யூ.எல் விவரக்குறிப்பின் செயல்படுத்தல் என்பது விவரக்குறிப்பு ஆவணத்தின் பதிப்பில் வரையறுக்கப்பட்டுள்ளதைத் தொடர்ந்து எழுதப்பட்ட எந்தவொரு மென்பொருளாகும். இருப்பினும், செயலாக்கங்கள் விவரக்குறிப்பின் ஒவ்வொரு அம்சத்தையும் செயல்படுத்தாது. சி.டபிள்யூ.எல் செயலாக்கங்கள் திறந்த மூல மற்றும் வணிக உரிமங்களின் கீழ் உரிமம் பெற்றுள்ளன.
zh_hans: 所谓 CWL 规约的某种“实现” (implementation), 指的是任何一种依照某版本的规约内容而编写的软件。然而，诸实现未必能将规约的每个方面都转化为软件实体。目前，CWL 各种实现的许可协议包括开源和商业许可。

source: CWL is well suited for describing large-scale workflows in cluster, cloud and high performance computing environments where tasks are scheduled in parallel across many nodes.
ja: CWLは、多くのノードでタスクが並列にスケジューリングされるクラスタ、クラウド、ハイパフォーマンスコンピューティング環境における大規模なワークフローを記述するのに適しています。
ru: CWL хорошо подходит для описания крупномасштабных рабочих процессов в кластерных, облачных и высокопроизводительных вычислительных средах, где задачи планируются параллельно на многих узлах.
ta: பல முனைகளில் இணையாக பணிகள் திட்டமிடப்பட்டுள்ள கொத்து, முகில் மற்றும் உயர் செயல்திறன் கொண்ட கணினி சூழல்களில் பெரிய அளவிலான பணிப்பாய்வுகளை விவரிக்க சி.டபிள்யூ.எல் மிகவும் பொருத்தமானது.
zh_hans: CWL非常适用于描述集群、云计算和高性能计算 (HPC) 等多节点、任务并行调度环境中的大规模工作流。

source: CWL specification, implementations, and other tools.
ja: CWL仕様、実装、その他ツール。
ru: Спецификация CWL, реализации и другие инструменты.
ta: சி.டபிள்யூ.எல் விவரக்குறிப்பு, செயலாக்கங்கள் மற்றும் பிற கருவிகள்.
zh_hans: CWL 规约、实现及其他工具。

source: Processes and Requirements
ja: Processes 及び Requirements
ru: Процессы и требования
ta: செயல்முறைகள் மற்றும் தேவைகள்
zh_hans: 流程和要求

source: A process is a computing unit that takes inputs and produces outputs. The behavior of a process can be affected by the inputs, requirements, and hints. There are four types of processes defined in the CWL specification {{ cwl_version }}:
ja: Processとは、入力を受けて出力を生成する計算のユニットです。Processの動作は、inputs、requirements、hintsに影響されることがあります。CWL仕様{{ cwl_version }}では、4種類のProcessが定義されています：
ru: Процесс - это вычислительная единица, которая принимает входные данные и производит выходные. На поведение процесса могут влиять входы, требования и подсказки. В спецификации CWL {{ cwl_version }} определены четыре типа процессов:
ta: ஒரு செயல்முறை என்பது ஒரு கணினி அலகு ஆகும், இது உள்ளீடுகளை எடுத்து வெளியீடுகளை உருவாக்குகிறது. ஒரு செயல்முறையின் நடத்தை உள்ளீடுகள், தேவைகள் மற்றும் குறிப்புகளால் பாதிக்கப்படலாம். CWL விவரக்குறிப்பில் நான்கு வகையான செயல்முறைகள் வரையறுக்கப்பட்டுள்ளன {{ cwl_version }}:
zh_hans: 流程 (process) 是指接收输入并生成输出的计算单元，影响其行为的包括输入 (input)、要求 (requirement) 及提示 (hint)。CWL 规约 {{ cwl_version }} 版定义了如下四种流程：

source: A command-line tool.
ja: コマンドラインツール。
ru: Инструмент командной строки.
ta: ஒரு கட்டளை-வரி கருவி.
zh_hans: 命令行工具。

source: An expression tool.
ja: Expression ツール。
ru: Инструмент выражения.
ta: ஒரு வெளிப்பாடு கருவி.
zh_hans: 表达式工具。

source: An operation.
ja: Operation。
ru: Операция.
ta: ஒரு செயல்பாடு.
zh_hans: 操作。

source: A workflow.
ja: ワークフロー。
ru: Рабочий процесс.
ta: ஒரு பணிப்பாய்வு.
zh_hans: 工作流。

source: The processing units available in the CWL objects model.
ja: CWLオブジェクトモデルで使用可能な処理単位です。
ru: Блоки обработки, доступные в модели объектов CWL.
ta: CWL பொருள்களின் மாதிரியில் கிடைக்கும் செயலாக்க அலகுகள்.
zh_hans: 可用在 CWL 对象模型中的处理单元。

source: A command-line tool is a wrapper for a command-line utility like `echo`, `ls`, and `tar`. A command-line tool can be called from a workflow.
ja: コマンドラインツールは、`echo` 、`ls` 、`tar` のようなコマンドラインユーティリティのラッパーです。コマンドラインツールは、ワークフローから呼び出せます。
ru: Инструмент командной строки - это обертка для утилит командной строки, таких как `echo`, `ls` и `tar`. Инструмент командной строки может быть вызван из рабочего процесса.
ta: ஒரு கட்டளை-வரி கருவி `எதிரொலி`,` எல்.எச்`, மற்றும் `தார்` போன்ற கட்டளை-வரி பயன்பாட்டிற்கான ஒரு ரேப்பர். ஒரு பணிப்பாய்விலிருந்து கட்டளை-வரி கருவியை அழைக்கலாம்.
zh_hans: “命令行工具”指的是 `echo`、`ls` 及 `tar` 等命令行程序的包装器 (wrapper)。从工作流中可以调用命令行工具。

source: An expression tool is a wrapper for a JavaScript expression. It can be used to simplify workflows and command-line tools, moving common parts of a workflow execution into reusable JavaScript code that takes inputs and produces outputs like a command-line tool.
ja: ExpressionToolは、JavaScriptの式のラッパーです。WorkflowやCommandLineToolの簡略化に使用でき、ワークフロー実行の共通部分を、CommandLineToolのように入力を受けて出力を生成する再利用可能なJavaScriptコードに移動させることができます。
ru: Инструмент выражения - это обертка для выражения JavaScript. Он может использоваться для упрощения рабочих процессов и инструментов командной строки, перенося общие части выполнения рабочего процесса в многократно используемый код JavaScript, который принимает входные данные и выдает выходные, как инструмент командной строки.
ta: ஒரு வெளிப்பாடு கருவி என்பது சாவாச்கிரிப்ட் வெளிப்பாட்டிற்கான ஒரு ரேப்பர். பணிப்பாய்வு மற்றும் கட்டளை-வரி கருவிகளை எளிதாக்குவதற்கு இதைப் பயன்படுத்தலாம், பணிப்பாய்வு செயலாக்கத்தின் பொதுவான பகுதிகளை மீண்டும் பயன்படுத்தக்கூடிய சாவாச்கிரிப்ட் குறியீட்டிற்கு நகர்த்தும், இது உள்ளீடுகளை எடுத்து கட்டளை-வரி கருவி போன்ற வெளியீடுகளை உருவாக்குகிறது.
zh_hans: “表达式工具”是 JavaScript 表达式的包装器。通过将工作流执行过程中的相同部分整理为可重用的 JavaScript 代码，像命令行工具一样接受输入并生成输出，工作流和命令行工具可以得到简化。
