Repository: common-workflow-language/user_guide
Catalog: locales/*/LC_MESSAGES/user_guide.po
Languages: ja, ru, ta, zh_hans

source: Operation is an abstract process that also takes inputs, produces outputs, and can be used in a workflow. But it is a special operation not so commonly used. It is discussed in the [Operations section](../topics/operations.md) of this user guide.
ja: Operationは、入力を受け、出力を出す抽象的なプロセスでもあり、ワークフローで使用することができます。しかし、あまり一般的に使われていない特別な処理です。このユーザーガイドの[Operation編](../topics/operations.md)で説明します。
ru: Операция - это абстрактный процесс, который также принимает входные данные, производит выходные и может быть использован в рабочем процессе. Но это особая операция, которая используется не так часто. Она рассматривается в разделе [Операции](../topics/operations.md) этого руководства пользователя.
ta: செயல்பாடு என்பது ஒரு சுருக்க செயல்முறையாகும், இது உள்ளீடுகளை எடுக்கும், வெளியீடுகளை உருவாக்குகிறது மற்றும் பணிப்பாய்வுகளில் பயன்படுத்தப்படலாம். ஆனால் இது பொதுவாகப் பயன்படுத்தப்படாத ஒரு சிறப்பு செயல்பாடு. இது இந்த பயனர் வழிகாட்டியின் [செயல்பாட்டு பிரிவு](../topics/operations.md) இல் விவாதிக்கப்படுகிறது.
zh_hans: “操作”是一种抽象的过程，它同样可接受输入、生成输出，并用于工作流中。但是，这一类特殊操作并不十分常用。用户指南的 [《操作》](../topics/operations.md)一节将进行讨论。

source: The workflow is a process that contains steps. Steps can be other workflows (nested workflows), command-line tools, or expression tools. The inputs of a workflow can be passed to any of its steps, while the outputs produced by its steps can be used in the final output of the workflow.
ja: Workflowは、ステップを含むプロセスです。ステップには、他のWorkflow（ネストされたWorkflow）、CommandLineTool、ExpressionToolを使用することができます。Workflowの入力は、そのステップのいずれかに渡すことができ、ステップによって生成された出力は、Workflowの最終出力に使用することができます。
ru: Рабочий процесс - это процесс, содержащий шаги. Шаги могут быть другими рабочими процессами (вложенными рабочими процессами), инструментами командной строки или средствами выражения. Входные данные рабочего процесса могут быть переданы любому из его этапов, а выходные данные, созданные его этапами, могут быть использованы в конечном результате рабочего процесса.
ta: பணிப்பாய்வு என்பது படிகளைக் கொண்ட ஒரு செயல்முறையாகும். படிகள் பிற பணிப்பாய்வு (உள்ளமைக்கப்பட்ட பணிப்பாய்வுகள்), கட்டளை-வரி கருவிகள் அல்லது வெளிப்பாடு கருவிகளாக இருக்கலாம். ஒரு பணிப்பாய்வுகளின் உள்ளீடுகளை அதன் எந்த படிகளுக்கும் அனுப்ப முடியும், அதே நேரத்தில் அதன் படிகளால் விளைவாக்கம் செய்யப்படும் வெளியீடுகள் பணிப்பாய்வுகளின் இறுதி வெளியீட்டில் பயன்படுத்தப்படலாம்.
zh_hans: “工作流”指的是可分为步骤的流程。“步骤”可以是其他工作流（嵌套工作流），也可以是命令行工具或表达式工具。工作流的输入可以传递给它的任一步骤，而其步骤生成的输出可用作工作流的最终输出。

source: The CWL specification allows for implementations to provide extra functionality and specify prerequisites to workflows through *requirements*. There are many requirements defined in the CWL specification, for instance:
ja: CWL 仕様では、*requirements* を通じて、実装が追加機能を提供し、ワークフローの前提条件を指定することができます。CWL仕様には、例えば、以下のような多くの要件が定義されています：
ru: Спецификация CWL позволяет реализациям предоставлять дополнительную функциональность и указывать необходимые условия для рабочих процессов с помощью *требований*. В спецификации CWL определено множество требований, например:
ta: சி.டபிள்யூ.எல் விவரக்குறிப்பு செயலாக்கங்களை கூடுதல் செயல்பாட்டை வழங்க அனுமதிக்கிறது மற்றும் *தேவைகள் *மூலம் பணிப்பாய்வுகளுக்கு முன்நிபந்தனைகளை குறிப்பிடுகிறது. உதாரணமாக, சி.டபிள்யூ.எல் விவரக்குறிப்பில் பல தேவைகள் வரையறுக்கப்பட்டுள்ளன:
zh_hans: CWL 规约允许其实现提供额外功能，或通过 *requirements* （要求）指定工作流的先决条件。CWL 规约定义了诸种要求，如：

source: `InlineJavascriptWorkflow` - enables JavaScript in expressions.
ru: `InlineJavascriptWorkflow` - включает JavaScript в выражениях.
ta: `இன்லைன் சாவாச்கிரிப்ட் பணிப்பாய்வு` - வெளிப்பாடுகளில் சாவாச்கிரிப்ட் இயக்கப்பட்டது.
zh_hans: `InlineJavascriptWorkflow` —— 在表达式中启用 JavaScript。

source: `SubworkflowFeatureRequirement` - enables nested workflows.
ru: `SubworkflowFeatureRequirement` - включает вложенные рабочие процессы.
ta: `Subworkflowfeaturerequirement` - உள்ளமைக்கப்பட்ட பணிப்பாய்வுகளை இயக்குகிறது.
zh_hans: `SubworkflowFeatureRequirement` —— 启用嵌套工作流。

source: `InitialWorkDirRequirement` - controls staging files in the input directory.
ru: `InitialWorkDirRequirement` - контролирует размещение файлов во входном каталоге.
ta: `SiteritWorkDirRequirement` - உள்ளீட்டு கோப்பகத்தில் ச்டேசிங் கோப்புகளை கட்டுப்படுத்துகிறது.
zh_hans: `InitialWorkDirRequirement` —— 控制输入目录中的暂存文件。

source: Some CWL runners may provide requirements that are not in the specification. For example, GPU requirements are supported in `cwltool` through the `cwltool:CUDARequirement` requirement, but it is not part of the {{ cwl_version }} specification and may not be supported by other CWL runners.
ja: いくつかのCWLランナーは、仕様にないrequirementsを提供することがあります。例えば、GPUに関するrequirementsは`cwltool` で`cwltool:CUDARequirement` を通してサポートされていますが、{{ cwl_version }}仕様の一部ではないので、他のCWLランナーではサポートされていないかもしれません。
ru: Некоторые прогоны CWL могут предоставлять требования, которых нет в спецификации. Например, требования к GPU поддерживаются в `cwltool` с помощью требования `cwltool:CUDARequirement`, но оно не является частью спецификации {{ cwl_version }} и может не поддерживаться другими CWL-прогонами.
ta: சில சி.டபிள்யூ.எல் ஓட்டப்பந்தய வீரர்கள் விவரக்குறிப்பில் இல்லாத தேவைகளை வழங்கலாம். எடுத்துக்காட்டாக, சி.பீ.யூ தேவைகள் `சி.டபிள்யு.எல்.டி.ஓ.எல்` இல்` சி.டபிள்யூ.எல்.டி.ஓ.எல்: குடர் க்யூரமென்ட்` தேவை மூலம் ஆதரிக்கப்படுகின்றன, ஆனால் இது {{ cwl_version }} விவரக்குறிப்பின் ஒரு பகுதியாக இல்லை, மற்ற சி.டபிள்யூ.எல் ஓட்டப்பந்தய வீரர்களால் ஆதரிக்கப்படாது.
zh_hans: 某些 CWL 运行程序可能提供规约之外的需求。例如 `cwltool` 提供 `cwltool:CUDARequirement` 以支持GPU需求，但这不在 {{ cwl_version }} 版本规约之内，可能不受其他 CWL 运行程序支持。

source: Hints are similar to requirements, but while requirements list features that are required, hints list optional features. Requirements are explained in detail in the [Requirements](../topics/requirements-and-hints.md) section.
ja: HintsはRequirementsと似ていますが、Requirementsが必須機能を列挙するのに対し、Hintsはオプションの機能を列挙します。Requirementsについては、[Requirements](../topics/requirements-and-hints.md) セクションで詳しく説明しています。
ru: Подсказки похожи на требования, но если в требованиях перечислены обязательные функции, то в подсказках - необязательные. Требования подробно описаны в разделе [Требования](../topics/requirements-and-hints.md).
ta: குறிப்புகள் தேவைகளுக்கு ஒத்தவை, ஆனால் தேவைகள் தேவைப்படும் அம்சங்களை பட்டியலிடுகையில், குறிப்புகள் விருப்ப அம்சங்களை பட்டியலிடுகின்றன. [தேவைகள்](../topics/requirements-and-hints.md) பிரிவில் தேவைகள் விரிவாக விளக்கப்பட்டுள்ளன.
zh_hans: “提示”与需求类似。其区别是，列为“需求”的功能是不可缺少的，而提示仅列出可选功能。更详细介绍请见 [《需求》](../topics/requirements-and-hints.md)一章。

source: FAIR Workflows
ja: FAIRワークフロー
ru: Рабочие процессы FAIR
ta: நியாயமான பணிப்பாய்வு
zh_hans: FAIR 工作流

source: The FAIR principles have laid a foundation for sharing and publishing digital assets, and in particular, data. The FAIR principles emphasize machine accessibility and that all digital assets should be Findable, Accessible, Interoperable, and Reusable. Workflows encode the methods by which the scientific process is conducted and via which data are created. It is thus important that workflows support the creation of FAIR data and adhere to the FAIR principles. — [FAIR Computational Workflows](https://workflows.community/groups/fair/), Workflows Community Initiative.
ru: Принципы FAIR заложили основу для обмена и публикации цифровых активов, в частности данных. Принципы FAIR подчеркивают доступность машин и то, что все цифровые активы должны быть находимыми, доступными, взаимодействующими и многократно используемыми. Рабочие процессы кодируют методы, с помощью которых осуществляется научный процесс и создаются данные. Поэтому важно, чтобы рабочие процессы поддерживали создание данных FAIR и соответствовали принципам FAIR. - [FAIR Computational Workflows](https://workflows.community/groups/fair/), Workflows Community Initiative.
ta: நியாயமான கொள்கைகள் டிசிட்டல் சொத்துக்களைப் பகிர்வதற்கும் வெளியிடுவதற்கும் ஒரு அடித்தளத்தை அமைத்துள்ளன, குறிப்பாக தரவுகள். நியாயமான கொள்கைகள் இயந்திர அணுகலை வலியுறுத்துகின்றன, மேலும் அனைத்து டிசிட்டல் சொத்துக்களும் கண்டுபிடிக்கப்படக்கூடியவை, அணுகக்கூடியவை, இயங்கக்கூடியவை மற்றும் மீண்டும் பயன்படுத்தக்கூடியவை. பணிப்பாய்வுகள் விஞ்ஞான செயல்முறை நடத்தப்படும் முறைகள் மற்றும் எந்த தரவு உருவாக்கப்படுகின்றன என்பதை குறியாக்குகின்றன. நியாயமான தரவை உருவாக்குவதை பணிப்பாய்வு ஆதரிப்பது முதன்மை மற்றும் நியாயமான கொள்கைகளை பின்பற்றுகிறது. -.
zh_hans: FAIR 为数字资源（尤其是数据）的共享和发布提供了一组基本原则。FAIR 四项原则强调了“机器可读”的重要性，进而提出应使所有数字资源可发现、可访问、可互操作以及可重用 (Findable, Accessible, Interoperable, and Reusable)。工作流通过代码所描述的，正是科学工作得以开展、数据得以创建的过程。因此，应强调工作流须支持创建 FAIR 数据，遵从 FAIR 原则。—— 工作流社群行动之[FAIR 计算工作流](https://workflows.community/groups/fair/)。

source: CWL has roots in "make" and many similar tools that determine order of execution, based on dependencies between tasks. However, unlike "make", CWL tasks are isolated, and you must be explicit about your inputs and outputs.
ja: CWLのルーツは、タスク間の依存関係に基づき、実行順序を決定する "make" や多くの類似ツールにあります。しかし、"make" とは異なり、CWLのタスクは分離されており、入力と出力を明示する必要があります。
ru: CWL уходит корнями в "make" и многие другие подобные инструменты, которые определяют порядок выполнения, основываясь на зависимостях между задачами. Однако, в отличие от "make", задачи CWL изолированы, и вы должны явно указывать свои входы и выходы.
ta: சி.டபிள்யூ.எல் "மேக்" இல் வேர்களைக் கொண்டுள்ளது மற்றும் பணிகளுக்கு இடையிலான சார்புகளை அடிப்படையாகக் கொண்டு செயல்படுத்தும் வரிசையை நிர்ணயிக்கும் பல ஒத்த கருவிகள் உள்ளன. இருப்பினும், "மேக்" போலல்லாமல், சி.டபிள்யூ.எல் பணிகள் தனிமைப்படுத்தப்பட்டுள்ளன, மேலும் உங்கள் உள்ளீடுகள் மற்றும் வெளியீடுகள் குறித்து நீங்கள் வெளிப்படையாக இருக்க வேண்டும்.
zh_hans: CWL 滥觞于“make”一类推定任务间依赖关系，并据此决定其执行次序的工具。但与“make”的不同在于，CWL 任务是存在于独立环境中的，其输入和输出需要明确指定。

source: The benefit of explicitness and isolation are flexibility, portability, and scalability; tools and workflows described with CWL can transparently leverage technologies such as Docker and be used with CWL implementations from different vendors.
ja: CWLで定義されたツールやワークフローは、Dockerなどの技術を透過的に活用し、異なるベンダーのCWL実装と組み合わせて使用することができるためです。
ru: Преимуществами явности и изолированности являются гибкость, переносимость и масштабируемость; инструменты и рабочие процессы, описанные с помощью CWL, могут прозрачно использовать такие технологии, как Docker, и применяться с реализациями CWL от разных производителей.
ta: வெளிப்படையான தன்மை மற்றும் தனிமைப்படுத்தலின் நன்மை நெகிழ்வுத்தன்மை, பெயர்வுத்திறன் மற்றும் அளவிடுதல்; சி.டபிள்யூ.எல் உடன் விவரிக்கப்பட்ட கருவிகள் மற்றும் பணிப்பாய்வுகள் கப்பல்துறை போன்ற தொழில்நுட்பங்களை வெளிப்படையாக மேம்படுத்தலாம் மற்றும் வெவ்வேறு விற்பனையாளர்களிடமிருந்து சி.டபிள்யூ.எல் செயலாக்கங்களுடன் பயன்படுத்தப்படலாம்.
zh_hans: 明确而独立，其益处在于灵活、可移植及可扩缩。CWL 所描述的工具和工作流，既能无缝对接 Docker 等技术以发挥其优势，又能通用于不同供应方的 CWL 实现环境中。

source: `cwltool` also uses the PROV-O standard ontology for data provenance.
ja: `cwltool` はまた、データプロベナンスのためのPROV-O標準オントロジーを使用しています。
ru: `cwltool` также использует стандартную онтологию PROV-O для проверки достоверности данных.
ta: `CWLTool` தரவு ஆதாரத்திற்காக Prov-O நிலையான ஆன்டாலசியையும் பயன்படுத்துகிறது.
zh_hans: 同时，`cwltool` 将 PROV-O 标准本体 (standard ontology) 运用于数据来源的保证。

source: Learn More
ja: さらなる学習
ru: Узнать больше
ta: மேலும் அறிக
zh_hans: 了解更多信息

source: Semantic Versioning - <https://semver.org/>
ja: セマンティック・バージョニング -<https://semver.org/>
ru: Семантическое версионирование - <https://semver.org/>
ta: சொற்பொருள் பதிப்பு - <https://semver.org/>
zh_hans: 语义型版本 —— <https://semver.org/>

source: The CWL Specification page in the CWL website: <https://www.commonwl.org/specification/>
ja: CWLサイト内の「CWL仕様」ページ：<https://www.commonwl.org/specification/>
ru: Страница спецификации CWL на сайте CWL: <https://www.commonwl.org/specification/>
ta: CWL இணையதளத்தில் உள்ள CWL விவரக்குறிப்பு பக்கம்: <https://www.commonwl.org/specification/>
zh_hans: CWL网站上的规约页面： <https://www.commonwl.org/specification/>

source: The current CWL specification on GitHub: {{ '<https://github.com/common-workflow-language/cwl-{}>'.format(cwl_version_text) }}
ja: GitHubにある現在のCWL仕様：{{ '<https://github.com/common-workflow-language/cwl-{}>'.format(cwl_version_text) }}
ru: Текущая спецификация CWL на GitHub: {{ '<https://github.com/common-workflow-language/cwl-{}>'.format(cwl_version_text) }}
ta: Github இல் தற்போதைய CWL விவரக்குறிப்பு: {{'<https://github.com/common-workflow-language/cwl- {}>' .format (cwl_version_text)}}
zh_hans: GitHub 上的 CWL 规约当前版本： {{ '<https://github.com/common-workflow-language/cwl-{}>'.format(cwl_version_text) }}

source: The list of Implementations in the CWL website: <https://www.commonwl.org/implementations/>
ja: CWLサイト内の実装のリスト：<https://www.commonwl.org/implementations/>
ru: Список реализаций на сайте CWL: <https://www.commonwl.org/implementations/>
ta: CWL இணையதளத்தில் செயலாக்கங்களின் பட்டியல்: <https://www.commonwl.org/implementations/>
zh_hans: CWL 网站所列的诸种实现：<https://www.commonwl.org/implementations/>

source: PROV-O: The PROV Ontology - <https://www.w3.org/TR/prov-o/>
ja: PROV-O: PROVオントロジー -<https://www.w3.org/TR/prov-o/>
ru: PROV-O: Онтология PROV - <https://www.w3.org/TR/prov-o/>
ta: Prov-o: prov ontology-<https://www.w3.org/tr/prov-o/>
zh_hans: PROV-O：PROV 本体 —— <https://www.w3.org/TR/prov-o/>

source: CWL Operations are covered in the [Operations](../topics/operations.md) section of this user guide.
ja: CWLのOperationsについては、本ユーザーガイドの[Operations](../topics/operations.md)セクションで説明します。
ru: Операции CWL рассматриваются в разделе [Операции](../topics/operations.md) данного руководства пользователя.
ta: சி.டபிள்யூ.எல் செயல்பாடுகள் இந்த பயனர் வழிகாட்டியின் [செயல்பாடுகள்](../topics/operations.md) பிரிவில் உள்ளன.
zh_hans: CWL 操作 (operations) 见于本《用户指南》中[《操作》](../topics/operations.md)一章。

source: Introduction
ja: はじめに
ru: Введение
ta: அறிமுகம்
zh_hans: 概述

source: This section will guide you through a short introduction to CWL, the prerequisites for following this user guide, and some basic concepts that are useful to know before reading the rest of the user guide.
ja: このセクションでは、CWLの簡単な紹介、このユーザーガイドに従うための前提条件、そしてユーザーガイドの他の部分を読む前に知っておくと便利な基本概念について案内します。
ru: В этом разделе мы расскажем вам о кратком введении в CWL, предпосылках для изучения данного руководства пользователя и некоторых основных понятиях, которые полезно знать перед прочтением остальной части руководства пользователя.
ta: சி.டபிள்யூ.எல் -க்கு ஒரு குறுகிய அறிமுகம், இந்த பயனர் வழிகாட்டியைப் பின்பற்றுவதற்கான முன்நிபந்தனைகள் மற்றும் மீதமுள்ள பயனர் வழிகாட்டியைப் படிப்பதற்கு முன் தெரிந்து கொள்ள பயனுள்ள சில அடிப்படைக் கருத்துகள் மூலம் இந்த பிரிவு உங்களுக்கு வழிகாட்டும்.
zh_hans: 本章节将引导您了解 CWL简介、学习本《用户指南》所需的准备，以及有利于您阅读理解本《指南》的若干基本概念。

source: Prerequisites
ja: 前提条件
ru: Пререквизиты
ta: முன்நிபந்தனைகள்
zh_hans: 学习前的准备

source: The software and configurations listed in this section are prerequisites for following this user guide. The CWL standards are implemented by many different workflow runners and platforms. This list of requirements focuses on the CWL reference runner, `cwltool`. You can use another CWL-compatible runner or workflow system, but the results and interface may look different (though the exact workflow outputs should be identical).
ru: Программное обеспечение и конфигурации, перечисленные в этом разделе, являются необходимыми условиями для выполнения данного руководства пользователя. Стандарты CWL реализуются множеством различных программ и платформ для запуска рабочих процессов. В этом списке требований основное внимание уделено эталонному исполнителю CWL, `cwltool`. Вы можете использовать другой CWL-совместимый прогон или систему документооборота, но результаты и интерфейс могут выглядеть иначе (хотя точные результаты документооборота должны быть идентичными).
ta: இந்த பிரிவில் பட்டியலிடப்பட்டுள்ள மென்பொருள் மற்றும் உள்ளமைவுகள் இந்த பயனர் வழிகாட்டியைப் பின்பற்றுவதற்கான முன்நிபந்தனைகள். சி.டபிள்யூ.எல் தரநிலைகள் பல்வேறு பணிப்பாய்வு ஓட்டப்பந்தய வீரர்கள் மற்றும் தளங்களால் செயல்படுத்தப்படுகின்றன. தேவைகளின் இந்த பட்டியல் CWL குறிப்பு ரன்னர், `CWLTOOL` இல் கவனம் செலுத்துகிறது. நீங்கள் மற்றொரு சி.டபிள்யூ.எல்-இணக்கமான ரன்னர் அல்லது பணிப்பாய்வு முறையைப் பயன்படுத்தலாம், ஆனால் முடிவுகள் மற்றும் இடைமுகம் வித்தியாசமாகத் தோன்றலாம் (சரியான பணிப்பாய்வு வெளியீடுகள் ஒரே மாதிரியாக இருக்க வேண்டும் என்றாலும்).
zh_hans: 学习本《用户指南》前，首先需要准备好本节所述的软件及其配置。CWL 标准现有多种工作流运行器和平台实现。本节列出的要求主要着眼于 CWL 的参考运行程序即 `cwltool`。您也可以使用与之兼容的其他 CWL 运行程序或工作流系统，但运行结果和界面可能有所出入（尽管严格意义上属于工作流的输出应该相同）。

source: CWL Implementations
ja: CWL実装
ru: Реализации CWL
ta: சி.டபிள்யூ.எல் செயலாக்கங்கள்
zh_hans: CWL 实现

source: There are many implementations of the CWL standards. Some are complete CWL runners, while others could be plug-ins or extensions to workflow engines. We have a better explanation in the [Implementations](basic-concepts.md#implementations) section.
ja: CWL標準規格の実装は数多く存在します。あるものは完全なCWL実装であり、他のものはワークフローエンジンのプラグインや拡を含むことがあります。[実装](basic-concepts.md#implementations)のセクションでより詳しい説明をしています。
ru: Существует множество реализаций стандартов CWL. Некоторые из них представляют собой полноценные CWL-программы, в то время как другие могут быть плагинами или расширениями для движков рабочих процессов. Более подробное описание приведено в разделе [Реализации](basic-concepts.md#implementations).
ta: சி.டபிள்யூ.எல் தரநிலைகளில் பல செயலாக்கங்கள் உள்ளன. சில முழுமையான சி.டபிள்யூ.எல் ஓட்டப்பந்தய வீரர்கள், மற்றவர்கள் பணிப்பாய்வு இயந்திரங்களுக்கு செருகுநிரல்கள் அல்லது நீட்டிப்புகளாக இருக்கலாம். [செயலாக்கங்கள்](basic-concepts.md#implementations) பிரிவில் எங்களுக்கு சிறந்த விளக்கம் உள்ளது.
zh_hans: CWL 标准有多种实现，既包括完整的 CWL 运行程序，也有工作流引擎的插件或扩展程序。 详见[《实现》](basic-concepts.md#implementations)一章。

source: Operating System
ja: オペレーティングシステム
ru: Операционная система
ta: இயக்க முறைமை
zh_hans: 操作系统

source: We recommend using an up-to-date operating system. You can choose any of the following options for your operating system:
ja: 最新のオペレーティングシステムを使用することをお勧めします。OSは、以下のいずれかをお選びいただけます：
ru: Мы рекомендуем использовать современную операционную систему. Вы можете выбрать любой из следующих вариантов операционной системы:
ta: புதுப்பித்த இயக்க முறைமையைப் பயன்படுத்த பரிந்துரைக்கிறோம். உங்கள் இயக்க முறைமைக்கு பின்வரும் விருப்பங்களில் ஏதேனும் ஒன்றை நீங்கள் தேர்வு செய்யலாம்:
zh_hans: 建议使用以下任一可选系统的最新版本：

source: Linux
ta: லினக்ச்

source: macOS
ta: மேகோச்

source: Windows
ta: சாளரங்கள்

source: If you are using Windows, you will have to install the [Windows Subsystem for Linux 2](https://learn.microsoft.com/en-us/windows/wsl/install) (WSL2). Visit the `cwltool` [documentation](https://github.com/common-workflow-language/cwltool/blob/main/README.rst#ms-windows-users) for details on installing WSL2. Your operating system also needs internet access and a recent version of Python (3.6+).
ru: Если вы используете Windows, вам придется установить [Windows Subsystem for Linux 2](https://learn.microsoft.com/en-us/windows/wsl/install) (WSL2). Подробную информацию об установке WSL2 можно найти в `cwltool` [документации](https://github.com/common-workflow-language/cwltool/blob/main/README.rst#ms-windows-users). Вашей операционной системе также необходим доступ в Интернет и последняя версия Python (3.6+).
ta: நீங்கள் விண்டோசைப் பயன்படுத்துகிறீர்கள் என்றால், நீங்கள் [லினக்ச் 2 க்கான சாளரங்கள் துணை அமைப்பு](https://learn.microsoft.com/en-us/windows/wsl/install) (WSL2) ஐ நிறுவ வேண்டும். WSL2 ஐ நிறுவுவது குறித்த விவரங்களுக்கு `cwltool` [ஆவணம்](https://github.com/common-workflow-language/cwltool/blob/readme.rst#ms-mys-windows-users) ஐப் பார்வையிடவும். உங்கள் இயக்க முறைமைக்கு இணைய அணுகல் மற்றும் பைதானின் அண்மைக் கால பதிப்பு (3.6+) தேவை.
zh_hans: 如使用 Windows 操作系统，须首先安装[适用于 Linux 的 Windows 子系统 2](https://learn.microsoft.com/en-us/windows/wsl/install) (WSL2)。请参阅 `cwltool` [说明文件](https://github.com/common-workflow-language/cwltool/blob/main/README.rst#ms-windows-users) ，了解关于安装 WSL2 的细节。同时，您的操作系统还需能接入互联网，以及运行较新版本（3.6 以上）的 Python.

source: CWL Runner
ru: Бегун CWL
ta: கூல் ரன்னர்
zh_hans: CWL 运行程序

source: The first thing you will need for running CWL workflows is a CWL runner. `cwltool` is a Python Open Source project maintained by the CWL community. It is also the CWL reference runner, which means it must support everything in the current CWL specification, {{ cwl_version }}.
ja: CWL ワークフローを実行するために最初に必要なものは、CWL runnerです。`cwltool` は、CWL コミュニティによって維持されている Python オープンソース・プロジェクトです。これはCWL reference runner(訳注: CWLの参照実装)でもあり、`cwltool`は現在のCWL仕様{{ cwl_version }}のすべてをサポートしなければならないことを意味します。
ru: Первое, что вам понадобится для запуска рабочих процессов CWL, - это CWL runner. `cwltool` - это проект с открытым исходным кодом на Python, поддерживаемый сообществом CWL. Он также является эталонным бегуном CWL, что означает, что он должен поддерживать все, что есть в текущей спецификации CWL, {{ cwl_version }}.
ta: சி.டபிள்யூ.எல் பணிப்பாய்வுகளை இயக்குவதற்கு உங்களுக்கு முதல் சேதி சி.டபிள்யூ.எல் ரன்னர். `CWLTool` என்பது CWL சமூகத்தால் பராமரிக்கப்படும் பைதான் திறந்த மூல திட்டமாகும். இது CWL குறிப்பு ரன்னர் ஆகும், அதாவது தற்போதைய CWL விவரக்குறிப்பில் உள்ள அனைத்தையும் இது ஆதரிக்க வேண்டும், {{ cwl_version }}.
zh_hans: 要运行CWL工作流，首先要用到的就是 CWL 运行程序 (runner). `cwltool`作为 CWL 社群共同维护开发的 Python 开源项目，正是 CWL 运行程序的参考实现，也就是说，它必须完整支持当前 {{ cwl_version }} 版本 CWL 规约。

source: `cwltool` can be installed with `pip`. We recommend using a virtual environment like `venv` or `conda`. The following commands will create and activate a Python virtual environment using the `venv` module, and install `cwltool` in that environment:
ru: `cwltool` может быть установлен с помощью `pip`. Мы рекомендуем использовать виртуальную среду, например `venv` или `conda`. Следующие команды создадут и активируют виртуальную среду Python с помощью модуля `venv`, а также установят `cwltool` в эту среду:
ta: `cwltool` உடன்` பிப்` உடன் நிறுவலாம். `Vev` அல்லது` Conda` போன்ற மெய்நிகர் சூழலைப் பயன்படுத்த பரிந்துரைக்கிறோம். பின்வரும் கட்டளைகள் `VENV` தொகுதியைப் பயன்படுத்தி பைதான் மெய்நிகர் சூழலை உருவாக்கி செயல்படுத்தும், மேலும் அந்த சூழலில்` CWLTool` ஐ நிறுவும்:
zh_hans: `cwltool` 可以用 `pip` 命令安装，而且我们推荐使用 `venv` 或 `conda` 等虚拟环境。以下命令将使用 `venv` 模块创建并激活一个 Python 虚拟环境，并在该环境中安装 `cwltool`:

source: Installing `cwltool` with `pip` and `venv`.
ru: Установка `cwltool` с помощью `pip` и `venv`.
ta: `PIP` மற்றும்` vev` உடன் `cwltool` ஐ நிறுவுகிறது.
zh_hans: 使用 `pip` 和 `venv` 安装 `cwltool`.

source: Visit the `cwltool` [documentation](https://github.com/common-workflow-language/cwltool#install) for other ways to install `cwltool` with `apt` and `conda`.
ru: О других способах установки `cwltool` с помощью `apt` и `conda` читайте в разделе `cwltool` [документация](https://github.com/common-workflow-language/cwltool#install).
ta: `cwltool` உடன்` apt` மற்றும் `conda` உடன் நிறுவ பிற வழிகளில்` cwltool` [ஆவணம்](https://github.com/common-workflow-language/cwltool#install) ஐப் பார்வையிடவும்.
zh_hans: 请参阅 `cwltool` [说明文件](https://github.com/common-workflow-language/cwltool#install)查看其他安装方法，包括用 `apt` 或 `conda`.

source: Let's use a simple CWL tool description `true.cwl` with `cwltool`.
ja: 簡単なCWLツール定義`true.cwl` で`cwltool` を使ってみましょう。
ru: Давайте воспользуемся простым описанием CWL-инструмента `true.cwl` с помощью `cwltool`.
ta: `Cwltool` உடன் எளிய CWL கருவி விளக்கத்தை` true.cwl` ஐப் பயன்படுத்துவோம்.
zh_hans: 我们来用`cwltool` 处理名为 `true.cwl` 的一个简单 CWL 工具描述。
