Repository: common-workflow-language/user_guide
Catalog: locales/*/LC_MESSAGES/user_guide.po
Languages: ja, ru, ta, zh_hans

source: Notice that "example_file", as a `File` type, must be provided as an object with the fields `class: File` and `path`.
ja: "example_file" は `File` 型として、フィールド `class： File` と `path` フィールドを持つオブジェクトとして提供されなければなりません。
ru: Обратите внимание, что "example_file", как тип `File`, должен быть предоставлен в виде объекта с полями `class: File` и `path`.
ta: `கோப்பு` வகையாக" எடுத்துக்காட்டு_பீல் ",` வகுப்பு: கோப்பு` மற்றும் `பாதை` ஆகிய புலங்களுடன் ஒரு பொருளாக வழங்கப்பட வேண்டும் என்பதைக் கவனியுங்கள்.
zh_hans: 注意，“example_file” 属于 `File`（文件）类型，因此必须作为含有 `class: File` 和 `path` 字段的对象出现。

source: Next, create a whale.txt using [touch] by typing `touch whale.txt` on the command line.
ja: 次に、コマンドラインで`touch whale.txt` と入力し、[touch]をコマンドを使用して whale.txt を作成します。
ru: Затем создайте файл whale.txt с помощью [touch], набрав в командной строке `touch whale.txt`.
ta: `touch whale.txt `டச் திமிங்கலம்.
zh_hans: 然后，在命令行键入 `touch whale.txt`, 用 [touch] 命令创建文件 whale.txt.

source: Now invoke `cwltool` with the tool description and the input object on the command line, using the command `cwltool inp.cwl inp-job.yml`. The following boxed text describes these two commands and the expected output from the command line:
ja: 次に、`cwltool inp.cwl inp-job.yml` というコマンドを使い、コマンドラインにツール定義と入力オブジェクトを指定して`cwltool` を起動します。次のボックステキストは、これら2つのコマンドと、コマンドラインから期待される出力について説明しています：
ru: Теперь вызовите `cwltool` с описанием инструмента и входным объектом в командной строке, используя команду `cwltool inp.cwl inp-job.yml`. В следующем тексте в рамке описаны эти две команды и ожидаемый вывод из командной строки:
ta: `CWLTOOL INP.CWL INP-JOB.YML` என்ற கட்டளையைப் பயன்படுத்தி, கருவி விளக்கம் மற்றும் கட்டளை வரியில் உள்ளீட்டு பொருளுடன்` CWLTool` ஐ இப்போது அழைக்கவும். பின்வரும் பெட்டி உரை இந்த இரண்டு கட்டளைகளையும், கட்டளை வரியிலிருந்து எதிர்பார்க்கப்படும் வெளியீட்டையும் விவரிக்கிறது:
zh_hans: 现在，使用 `cwltool inp.cwl inp-job.yml` 命令，即指定工具描述和输入对象、通过命令行调用 `cwltool`. 下方文本框描述了这两个命令及命令行的预期输出：

source: The CWL reference runner (cwltool) and other runners create temporary directories with symbolic ("soft") links to your input files to ensure that the tools aren't accidentally accessing files that were not explicitly specified
ja: CWLリファレンスランナー（cwltool）と他のランナーは、ツールが明示的に指定されていないファイルに誤ってアクセスしないように、入力ファイルへの（"ソフト"）シンボリックリンクを持つ一時ディレクトリを作成します
ru: Программа запуска ссылок на CWL (cwltool) и другие программы создают временные каталоги с символическими ("мягкими") ссылками на ваши входные файлы, чтобы гарантировать, что инструменты не получат случайный доступ к файлам, которые не были явно указаны
ta: சி.டபிள்யூ.எல் குறிப்பு ரன்னர் (சி.டபிள்யூ.எல்.டூல்) மற்றும் பிற ஓட்டப்பந்தய வீரர்கள் உங்கள் உள்ளீட்டு கோப்புகளுக்கு குறியீட்டு ("மென்மையான") இணைப்புகளுடன் தற்காலிக கோப்பகங்களை உருவாக்குகிறார்கள், கருவிகள் தற்செயலாக குறிப்பிடப்படாத கோப்புகளை அணுகவில்லை என்பதை உறுதிப்படுத்தவும்
zh_hans: CWL 参考运行程序 (cwltool) 和其他运行程序会建立临时目录，在其中创建指向您文件的符号链接（又称“软”链接），以防工具意外访问未经明文指定的文件

source: The field `inputBinding` is optional and indicates whether and how the input parameter should appear on the tool's command line. If `inputBinding` is missing, the parameter does not appear on the command line. Let's look at each example in detail.
ru: Поле `inputBinding` является необязательным и указывает, должен ли входной параметр отображаться в командной строке инструмента. Если `inputBinding` отсутствует, параметр не отображается в командной строке. Давайте рассмотрим каждый пример подробнее.
ta: புலம் `inputBinding` விருப்பமானது மற்றும் கருவியின் கட்டளை வரியில் உள்ளீட்டு அளவுரு எவ்வாறு தோன்ற வேண்டும் என்பதைக் குறிக்கிறது. `InputBinding` காணவில்லை என்றால், அளவுரு கட்டளை வரியில் தோன்றாது. ஒவ்வொரு உதாரணத்தையும் விரிவாகப் பார்ப்போம்.
zh_hans: 字段 `inputBinding` 为可选项，用来说明该输入参数是否应出现在工具的命令行上、以何种方式出现。 如果没有 `inputBinding`, 则该参数不会出现在命令行上。 我们来仔细看看每个示例。

source: Boolean types are treated as a flag. If the input parameter "example_flag" is "true", then `prefix` will be added to the command line. If false, no flag is added.
ja: ブール型はフラグとして扱われます。 入力パラメータ "example_flag "が "true "の場合、コマンドラインに`prefix` が追加されます。 falseの場合、フラグは付加されません。
ru: Булевы типы рассматриваются как флаг. Если входной параметр "example_flag" равен "true", то в командную строку будет добавлен `prefix`. Если false, то флаг не добавляется.
ta: பூலியன் வகைகள் ஒரு கொடியாக கருதப்படுகின்றன. உள்ளீட்டு அளவுரு "example_flag" "உண்மை" என்றால், `முன்னொட்டு` கட்டளை வரியில் சேர்க்கப்படும். தவறு என்றால், கொடி எதுவும் சேர்க்கப்படவில்லை.
zh_hans: 布尔类型的处理相当于一种“旗标”。如果输入参数“example_flag”为“true”（真），则 `prefix` 会被添加到命令行，否则将不添加旗标。

source: String types appear on the command line as literal values. The `prefix` is optional, if provided, it appears as a separate argument on the command line before the parameter . In the example above, this is rendered as `--example-string hello`.
ja: 文字列型は、コマンドライン上ではリテラル値として与えられます。 ` prefix` はオプションです。与えられた場合、コマンドライン上のパラメータの前に別の引数として与えられます。 上の例では、`--example-string hello` と与えられます。
ru: Строковые типы отображаются в командной строке как литеральные значения. Префикс ` необязателен, если он указан, то отображается как отдельный аргумент в командной строке перед параметром . В приведенном выше примере это выглядит как `--пример строки hello`.
ta: சரம் வகைகள் கட்டளை வரியில் நேரடி மதிப்புகளாக தோன்றும். `முன்னொட்டு` விருப்பமானது, வழங்கப்பட்டால், அது அளவுருவுக்கு முன் கட்டளை வரியில் ஒரு தனி வாதமாகத் தோன்றுகிறது. மேலே உள்ள எடுத்துக்காட்டில், இது `-எடுத்துக்காட்டாக-சரம் அலோ` என வழங்கப்படுகிறது.
zh_hans: 字符串类型以字面值 (literal value) 的方式出现在命令行上。 `prefix` 是可选的；如果提供，它将作为单独的参数，在命令行上出现在参数值之前。上例中，相应的结果是 `--example-string hello`.

source: Integer (and floating point) types appear on the command line with decimal text representation. When the option `separate` is false (the default value is true), the prefix and value are combined into a single argument. In the example above, this is rendered as `-i42`.
ru: Целочисленные типы (и типы с плавающей точкой) отображаются в командной строке в десятичном текстовом представлении. Когда опция `separate` равна false (по умолчанию значение true), префикс и значение объединяются в один аргумент. В приведенном выше примере это выглядит как `-i42`.
ta: தசம உரை பிரதிநிதித்துவத்துடன் கட்டளை வரியில் முழு எண் (மற்றும் மிதக்கும் புள்ளி) வகைகள் தோன்றும். `தனித்தனியாக` விருப்பம் தவறானது (இயல்புநிலை மதிப்பு உண்மை), முன்னொட்டு மற்றும் மதிப்பு ஒற்றை வாதமாக இணைக்கப்படுகின்றன. மேலே உள்ள எடுத்துக்காட்டில், இது `-i42` என வழங்கப்படுகிறது.
zh_hans: 整型和浮点型以其十进制表示，作为文本出现在命令行上。 若选项 `separate` 为 false（伪，默认为 true 真），前缀将和它的值合并为一个参数。上例中，其产物为 `-i42`.

source: File types appear on the command line as the path to the file. When the parameter type ends with a question mark `?` it indicates that the parameter is optional. In the example above, this is rendered as `--file=/tmp/random/path/whale.txt`. However, if the "example_file" parameter were not provided in the input, nothing would appear on the command line.
ru: Типы файлов отображаются в командной строке в виде пути к файлу. Если тип параметра заканчивается вопросительным знаком `?`, это означает, что параметр необязателен. В приведенном выше примере это выглядит как `--file=/tmp/random/path/whale.txt`. Однако если бы параметр "example_file" не был указан во входных данных, в командной строке ничего бы не появилось.
ta: கோப்பு வகைகள் கட்டளை வரியில் கோப்பின் பாதையாக தோன்றும். அளவுரு வகை ஒரு கேள்விக்குறியுடன் முடிவடையும் போது `?` இது அளவுரு விருப்பமானது என்பதை இது குறிக்கிறது. மேலே உள்ள எடுத்துக்காட்டில், இது `--file =/tmp/சீரற்ற/பாதை/திமிங்கலம். Txt` என வழங்கப்படுகிறது. இருப்பினும், உள்ளீட்டில் "எடுத்துக்காட்டு_பீல்" அளவுரு வழங்கப்படவில்லை என்றால், கட்டளை வரியில் எதுவும் தோன்றாது.
zh_hans: 文件类型在命令行上以文件路径的方式出现。参数类型末尾如有问号 `?` 意指该参数为可选。上例中，这一部分的命令行产物是 `--file=/tmp/random/path/whale.txt`. 不过，如果输入中未提供“example_file”参数，则不会在命令行上加入任何内容。

source: Input files are read-only. If you wish to update an input file, you must [first copy it to the output directory](staging-input-files.md).
ja: 入力ファイルは読み取り専用です。 入力ファイルを更新したい場合は、[まず出力ディレクトリにコピーする](staging-input-files.md)必要があります。
ru: Входные файлы доступны только для чтения. Если вы хотите обновить входной файл, вы должны [сначала скопировать его в выходной каталог](staging-input-files.md).
ta: உள்ளீட்டு கோப்புகள் படிக்க மட்டுமே. உள்ளீட்டு கோப்பை நீங்கள் புதுப்பிக்க விரும்பினால், நீங்கள் [முதலில் அதை வெளியீட்டு கோப்பகத்திற்கு நகலெடுக்க வேண்டும்](staging-input-files.md).
zh_hans: 输入文件是只读的。 如果要更新输入文件，必须将它[事先复制到输出目录](staging-input-files.md)。

source: The value of `position` is used to determine where parameter should appear on the command line. Positions are relative to one another, not absolute. As a result, positions do not have to be sequential, three parameters with positions 1, 3, 5 will result in the same command line as 1, 2, 3. More than one parameter can have the same position (ties are broken using the parameter name), and the position field itself is optional. The default position is 0.
ja: `position` の値は、パラメータがコマンドライン上のどこに表示されるかを決定するために使用されます。 Positionは、絶対的なものではなく、互いに相対的なものです。 そのため、位置は連続である必要はなく、1、3、5の位置にある3つのパラメータは、1、2、3と同じコマンドラインになります。 複数のパラメータが同じ位置を持つことも可能です（パラメータ名で紐付けを行います）。また、位置フィールドは任意です。 デフォルトの位置は0です。
ru: Значение `position` используется для определения места появления параметра в командной строке. Позиции являются относительными друг к другу, а не абсолютными. В результате, позиции не обязательно должны быть последовательными, три параметра с позициями 1, 3, 5 приведут к той же командной строке, что и 1, 2, 3. Более одного параметра могут иметь одинаковую позицию (связи разрываются с помощью имени параметра), а само поле позиции является необязательным. Позиция по умолчанию равна 0.
ta: கட்டளை வரியில் அளவுரு எங்கு தோன்ற வேண்டும் என்பதை தீர்மானிக்க `நிலை` இன் மதிப்பு பயன்படுத்தப்படுகிறது. நிலைகள் ஒருவருக்கொருவர் தொடர்புடையவை, முழுமையானவை அல்ல. இதன் விளைவாக, நிலைகள் தொடர்ச்சியாக இருக்க வேண்டியதில்லை, 1, 3, 5 நிலைகளைக் கொண்ட மூன்று அளவுருக்கள் 1, 2, 3 ஆக அதே கட்டளை வரியை ஏற்படுத்தும். ஒன்றுக்கு மேற்பட்ட அளவுருவுகள் ஒரே நிலையை கொண்டிருக்கலாம் (உறவுகளைப் பயன்படுத்தி உறவுகள் உடைக்கப்படுகின்றன அளவுரு பெயர்), மற்றும் நிலை புலம் விருப்பமானது. இயல்புநிலை நிலை 0.
zh_hans: `position`（位置）的值用于指定参数在命令行上应出现的位置 — 并非绝对位置，而是彼此间的相对顺序。这意味着，位置值不一定要连续；`position` 值为 1、3、5 的三个参数生成的命令行将与其值分别为 1、2、3 时相同。 多个参数可能有相同的 `position` 值（这种情况下由参数名进一步决定顺序），而且 `position` 字段本身是可选的。 默认的位置是0.

source: The `baseCommand` field will always appear in the final command line before the parameters.
ja: `baseCommand` フィールドは、常にパラメータの前の最終コマンド行に表示されます。
ru: Поле `baseCommand` всегда будет отображаться в конечной командной строке перед параметрами.
ta: `பேச் கமாண்ட்` புலம் எப்போதும் அளவுருக்களுக்கு முன் இறுதி கட்டளை வரியில் தோன்றும்.
zh_hans: `baseCommand` 字段一定会出现在最终生成的命令行中，而且位于所有参数之前。

source: Array Inputs
ja: 配列入力
ru: Входы массива
ta: வரிசை உள்ளீடுகள்
zh_hans: 数组输入

source: It is easy to add arrays of input parameters represented to the command line. There are two ways to specify an array parameter. First is to provide `type` field with `type: array` and `items` defining the valid data types that may appear in the array. Alternatively, brackets `[]` may be added after the type name to indicate that input parameter is array of that type.
ru: В командную строку легко добавлять массивы входных параметров, представленных в виде массива. Существует два способа указать параметр массива. Первый - указать поле `type` с `type: array` и `items`, определяющими допустимые типы данных, которые могут присутствовать в массиве. В качестве альтернативы после имени типа можно добавить скобки `[]`, чтобы указать, что входной параметр является массивом данного типа.
ta: கட்டளை வரியில் குறிப்பிடப்படும் உள்ளீட்டு அளவுருக்களின் வரிசைகளைச் சேர்ப்பது எளிது. வரிசை அளவுருவைக் குறிப்பிட இரண்டு வழிகள் உள்ளன. முதலாவது `வகை` புலத்துடன்` வகை: வரிசை` மற்றும் `உருப்படிகள்` வரிசையில் தோன்றக்கூடிய செல்லுபடியாகும் தரவு வகைகளை வரையறுத்தல். மாற்றாக, உள்ளீட்டு அளவுரு அந்த வகையின் வரிசை என்பதைக் குறிக்க வகை பெயருக்குப் பிறகு அடைப்புக்குறிகள் `[]` சேர்க்கப்படலாம்.
zh_hans: 将以数组形式出现的参数添加至命令行很简单。指定数组参数有两种办法。第一种是在 `type` 字段下给出 `type: array`, 并且用 `items` 定义数组中允许出现的有效数据类型。另一种办法，是在类型的名称后添加方括号 `[]`，以表明输入参数为此类型的数组。

source: `array-inputs.cwl`
ta: `வரிசை-inputs.cwl`

source: Now invoke `cwltool` providing the tool description and the input object on the command line:
ru: Теперь вызовите `cwltool`, указав в командной строке описание инструмента и входной объект:
ta: இப்போது கட்டளை வரியில் கருவி விளக்கத்தையும் உள்ளீட்டு பொருளையும் வழங்கும் `cwltool` ஐ அழைக்கவும்:
zh_hans: 现在，调用命令 `cwltool` 并为它提供工具描述和输入对象：

source: The `inputBinding` can appear either on the outer array parameter definition or the inner array element definition, and these produce different behavior when constructing the command line, as shown above. In addition, the `itemSeparator` field, if provided, specifies that array values should be concatenated into a single argument separated by the item separator string.
ja: `inputBinding` は、外側の配列パラメータ定義と内側の配列要素定義のいずれかに記述することができ、上図のようにコマンドラインを構築する際に異なる挙動を示します。また、`itemSeparator` フィールドがあれば、配列の値を項目区切り文字列で区切って1つの引数に連結することを指定することができます。
ru: Поле `inputBinding` может находиться как в определении внешнего параметра массива, так и в определении внутреннего элемента массива, что приводит к различному поведению при построении командной строки, как показано выше. Кроме того, поле `itemSeparator`, если оно задано, указывает, что значения массива должны быть объединены в один аргумент, разделенный строкой-разделителем элементов.
ta: `InputBinding` வெளிப்புற வரிசை அளவுரு வரையறை அல்லது உள் வரிசை உறுப்பு வரையறை ஆகியவற்றில் தோன்றக்கூடும், மேலும் இவை மேலே காட்டப்பட்டுள்ளபடி கட்டளை வரியை உருவாக்கும் போது வெவ்வேறு நடத்தைகளை உருவாக்குகின்றன. கூடுதலாக, `உருப்படி சிப்பி` புலம், வழங்கப்பட்டால், வரிசை மதிப்புகள் உருப்படி பிரிப்பான் சரத்தால் பிரிக்கப்பட்ட ஒற்றை வாதமாக இணைக்கப்பட வேண்டும் என்பதைக் குறிப்பிடுகிறது.
zh_hans: `inputBinding` 既可以出现在外部，即数组参数本身的定义中，也可以出现在内部，即数组元素的定义中。如上所示，这两种定义方式在构建命令行时所产生的行为是不一样的。另外，`itemSeparator`（项目分隔符）字段如果出现，则指明数组各元素的值应并入单独的一个参数，以指定的项目分隔符插入相邻的元素值之间。

source: Note that the arrays of inputs are specified inside square brackets `[]` in `array-inputs-job.yml`. Arrays can also be expressed over multiple lines, where array values that are not defined with an associated key are marked by a leading `-`. This will be demonstrated in the next lesson and is discussed in more detail in the [YAML Guide](yaml-guide.md#arrays). You can specify arrays of arrays, arrays of records, and other complex types.
ja: なお、入力の配列は大括弧の中で指定します `array-inputs-job.yml`の`[]`です.配列は複数行に渡って表現することも可能で、関連するキーで定義されていない配列の値は、先頭の`-` でマークされます。これは次のレッスンで実際に確認し、[YAML Guide](yaml-guide.md#arrays) でより詳細に説明されています。配列の配列、レコードの配列、その他の複雑な型を指定することができます。
ru: Обратите внимание, что массивы входных данных указываются внутри квадратных скобок `[]` в файле `array-inputs-job.yml`. Массивы также могут быть выражены в нескольких строках, при этом значения массива, которые не определены с соответствующим ключом, помечаются ведущим `-`. Это будет продемонстрировано в следующем уроке и более подробно рассмотрено в [Руководстве по YAML](yaml-guide.md#arrays). Вы можете указывать массивы массивов, массивы записей и другие сложные типы.
ta: உள்ளீடுகளின் வரிசைகள் சதுர அடைப்புக்குறிக்குள் குறிப்பிடப்பட்டுள்ளன `[]` வரிசை-உள்ளீடுகள்`array-inputs-job.yml` இல். பல வரிகளிலும் வரிசைகளையும் வெளிப்படுத்தலாம், அங்கு தொடர்புடைய விசையுடன் வரையறுக்கப்படாத வரிசை மதிப்புகள் ஒரு முன்னணி `-` ஆல் குறிக்கப்படுகின்றன. இது அடுத்த பாடத்தில் நிரூபிக்கப்படும் மற்றும் [YAML வழிகாட்டி](yaml-guide.md#arrays) இல் விரிவாக விவாதிக்கப்படுகிறது. வரிசைகளின் வரிசைகள், பதிவுகளின் வரிசைகள் மற்றும் பிற சிக்கலான வகைகளை நீங்கள் குறிப்பிடலாம்.
zh_hans: 请注意，在 `array-inputs-job.yml` 中，数组输入由方括号 `[]` 指定。表达数组的另一种形式是多行句法，即用行首的 `-` 标明数组元素，示意它并非键值。下一课中将演示后一种用法，在[《YAML 指南》](yaml-guide.md#arrays) 中也有详细讨论。可以指定的数组包括数组的数组、记录的数组及其他复合类型的数组。

source: Inclusive and Exclusive Inputs
ja: 包括的入力と排他的入力
ru: Инклюзивные и эксклюзивные входы
ta: உள்ளடக்கிய மற்றும் பிரத்யேக உள்ளீடுகள்
zh_hans: 相容和互斥输入

source: Sometimes an underlying tool has several arguments that must be provided together (they are dependent) or several arguments that cannot be provided together (they are exclusive). You can use records and type unions to group parameters together to describe these two conditions.
ja: 基本的なツールには、一緒に提供しなければならない複数の引数（依存関係あり）や、一緒に提供できない複数の引数（排他関係あり）があることがあります。 recordとユニオン型を使ってパラメータをグループ化し、この2つの条件を定義することができます。
ru: Иногда базовый инструмент имеет несколько аргументов, которые должны быть предоставлены вместе (они зависимы) или несколько аргументов, которые не могут быть предоставлены вместе (они исключительны). Для описания этих двух условий можно использовать записи и объединения типов, чтобы сгруппировать параметры.
ta: சில நேரங்களில் ஒரு அடிப்படை கருவியில் பல வாதங்கள் உள்ளன, அவை ஒன்றாக வழங்கப்பட வேண்டும் (அவை சார்புடையவை) அல்லது ஒன்றாக வழங்க முடியாத பல வாதங்கள் (அவை பிரத்தியேகமானவை). இந்த இரண்டு நிபந்தனைகளையும் விவரிக்க நீங்கள் பதிவுகள் மற்றும் குழு அளவுருக்களை ஒன்றாக இணைக்கலாம்.
zh_hans: 有时，基础工具具有多个必须一起提供的参数（它们是相互依赖的）或多个不能一起提供的参数（它们是互斥的）。 您可以使用记录类型或共用体 (union) 类型将参数加以组合，以分别描述这两种情况。

source: In the first example, you can't provide `itemA` without also providing `itemB`.
ja: 最初の例では、`itemB` も与えずに、`itemA` を与えることはできません。
ru: В первом примере вы не можете предоставить `пунктА`, не предоставив также `пунктВ`.
ta: முதல் எடுத்துக்காட்டில், `itemb` ஐ வழங்காமல்` உருப்படி` ஐ வழங்க முடியாது.
zh_hans: 在第一个示例中，一旦提供 `itemA` 就必须同时提供 `itemB`.

source: In the second example, `itemC` and `itemD` are exclusive, so only the first matching item (`itemC`) is added to the command line and remaining item (`itemD`) is ignored.
ja: 2番目の例では、`itemC` と`itemD` が排他的であるため、最初に一致した項目 (`itemC`) のみがコマンドラインに追加され、残りの項目 (`itemD`) は無視されます。
ru: Во втором примере `itemC` и `itemD` являются эксклюзивными, поэтому только первый совпадающий элемент (`itemC`) будет добавлен в командную строку, а оставшийся элемент (`itemD`) будет проигнорирован.
ta: இரண்டாவது எடுத்துக்காட்டில், `உருப்படிகள்` மற்றும்` உருப்படிகள்` பிரத்தியேகமானவை, எனவே முதல் பொருந்தக்கூடிய உருப்படி (`itemc`) கட்டளை வரியில் சேர்க்கப்பட்டு மீதமுள்ள உருப்படி (` உருப்படிகள்`) புறக்கணிக்கப்படுகிறது.
zh_hans: 在第二个示例中，`itemC` 和 `itemD` 是互斥的。因此，只有第一个匹配项 (`itemC`) 会添加到命令行，而余下的 (`itemD`) 将被忽略。

source: In the third example, only `itemD` is provided, so it appears on the command line.
ja: 3番目の例では、`itemD` のみが提供されているので、コマンドラインに表示されます。
ru: В третьем примере указан только `itemD`, поэтому он появляется в командной строке.
ta: மூன்றாவது எடுத்துக்காட்டில், `itemd` மட்டுமே வழங்கப்படுகிறது, எனவே இது கட்டளை வரியில் தோன்றும்.
zh_hans: 在第三个示例中，仅提供了 `itemD`, 因此它出现在命令行上。

source: Exclusive Input Parameters with Expressions
ja: 式で入力パラメータを排他的に指定する
ru: Исключение входных параметров с помощью выражений
ta: வெளிப்பாடுகளுடன் பிரத்யேக உள்ளீட்டு அளவுருக்கள்
zh_hans: 互斥输入参数与表达式

source: If you use exclusive input parameters combined with expressions, you need to be aware that the `inputs` JavaScript object will contain one of the exclusive input values. This means that you might need to use an **or** boolean operator to check which values are present.
ru: Если вы используете эксклюзивные входные параметры в сочетании с выражениями, вы должны знать, что объект JavaScript `inputs` будет содержать одно из эксклюзивных входных значений. Это означает, что вам может понадобиться использовать булевый оператор **or**, чтобы проверить, какие значения присутствуют.
ta: வெளிப்பாடுகளுடன் இணைந்து பிரத்யேக உள்ளீட்டு அளவுருக்களைப் பயன்படுத்தினால், `உள்ளீடுகள்` சாவாச்கிரிப்ட் பொருளில் பிரத்யேக உள்ளீட்டு மதிப்புகளில் ஒன்று இருக்கும் என்பதை நீங்கள் அறிந்திருக்க வேண்டும். இதன் பொருள் எந்த மதிப்புகள் உள்ளன என்பதைச் சரிபார்க்க நீங்கள் ** அல்லது ** பூலியன் ஆபரேட்டரைப் பயன்படுத்த வேண்டியிருக்கும்.
zh_hans: 将互斥的输入参数与表达式结合使用时，需要注意 `inputs` 这个 JavaScript 对象可能包含互斥输入值中的任何一个。这意味着你可能需要用逻辑“**或**”运算符来检查哪些值是存在的。

source: Let's use an example that contains an exclusive `file_format` input parameter that accepts `null` (i.e. no value provided), or any value from an enum.
ja: `file_format` 入力パラメータに、`null` (つまり、値がない)、または enum の任意の値を受け入れる排他的なものを含む例を使ってみましょう。
ru: Рассмотрим пример, содержащий эксклюзивный входной параметр `file_format`, который принимает значение `null` (т.е. значение не предоставляется) или любое значение из перечисления.
ta: `NULL` (அதாவது மதிப்பு எதுவும் வழங்கப்படவில்லை) அல்லது ஒரு ENUM இலிருந்து எந்த மதிப்பையும் ஏற்றுக்கொள்ளும் பிரத்யேக` file_format` உள்ளீட்டு அளவுருவைக் கொண்ட ஒரு உதாரணத்தைப் பயன்படுத்துவோம்.
zh_hans: 我们来看一个例子，其中 `file_format` 输入参数的取值是互斥的。该参数接受 `null`（即未提供任何值），或一个特定的枚举类型所包括的值。

source: `exclusive-parameter-expressions.cwl`
ta: `பிரத்யேக-அளவுரு-வெளிப்பாடுகள். cwl`

source: Note how the JavaScript expression uses the value of the exclusive input parameter without taking into consideration a `null` value. If you provide a valid value, such as “fasta” (one of the values of the enum), your command should execute successfully:
ru: Обратите внимание, что выражение JavaScript использует значение исключительного входного параметра, не принимая во внимание значение `null`. Если вы предоставите корректное значение, например "fasta" (одно из значений перечисления), ваша команда будет выполнена успешно:
ta: `பூச்ய` மதிப்பைக் கருத்தில் கொள்ளாமல் சாவாச்கிரிப்ட் வெளிப்பாடு பிரத்யேக உள்ளீட்டு அளவுருவின் மதிப்பை எவ்வாறு பயன்படுத்துகிறது என்பதைக் கவனியுங்கள். “ஃபாச்டா” (ENUM இன் மதிப்புகளில் ஒன்று) போன்ற சரியான மதிப்பை நீங்கள் வழங்கினால், உங்கள் கட்டளை வெற்றிகரமாக செயல்படுத்த வேண்டும்:
zh_hans: 请注意，这里的 JavaScript 表达式用到了互斥输入参数的值，但没有考虑到空值 `null` 的情况。如果提供的值有效，比如 “fasta” （枚举中的一个值），命令将会成功执行：

source: However, if you do not provide any input value, then `file_format` will be evaluated to a `null` value, which does not match the expected type for the output field (a `string`), resulting in failure when running your workflow.
ru: Однако если вы не предоставите никакого входного значения, то `file_format` будет оценен как `null`, что не соответствует ожидаемому типу выходного поля (`string`), что приведет к неудаче при запуске рабочего процесса.
ta: இருப்பினும், நீங்கள் எந்த உள்ளீட்டு மதிப்பையும் வழங்கவில்லை என்றால், `file_format` ஒரு` பூச்ய` மதிப்புக்கு மதிப்பீடு செய்யப்படும், இது வெளியீட்டு புலத்திற்கான எதிர்பார்க்கப்படும் வகையுடன் பொருந்தாது (ஒரு `சரம்`), இதன் விளைவாக உங்கள் பணிப்பாய்வுகளை இயக்கும் போது தோல்வி ஏற்படும் .
zh_hans: 但是，如果未提供任何输入值，则 `file_format` 的值为 `null`, 从而不符合输出字段的预期类型（字符串 `string`），导致工作流运行失败。

source: To correct it, you must remember to use an or operator in your JavaScript expression when using exclusive parameters, or any parameter that allows `null`. For example, the expression could be changed to `$(inputs.file_format || 'auto')`, to have a default value if none was provided in the command line or job input file.
ru: Чтобы исправить это, нужно не забывать использовать оператор or в выражении JavaScript при использовании эксклюзивных параметров или любых параметров, допускающих `null`. Например, выражение можно изменить на `$(inputs.file_format || 'auto')`, чтобы иметь значение по умолчанию, если оно не было указано в командной строке или входном файле задания.
ta: அதை சரிசெய்ய, பிரத்யேக அளவுருக்களைப் பயன்படுத்தும் போது அல்லது `NULL` ஐ அனுமதிக்கும் எந்த அளவுருவையும் பயன்படுத்தும் போது உங்கள் சாவாச்கிரிப்ட் வெளிப்பாட்டில் ஒரு அல்லது ஆபரேட்டரைப் பயன்படுத்த நினைவில் கொள்ள வேண்டும். எடுத்துக்காட்டாக, வெளிப்பாட்டை கட்டளை வரி அல்லது வேலை உள்ளீட்டு கோப்பில் எதுவும் வழங்கப்படாவிட்டால் இயல்புநிலை மதிப்பைக் கொண்டிருக்க `$ (உள்ளீடுகள்.
zh_hans: 为了修正这个问题，需要记住的，是在 JavaScript 表达式中使用互斥参数或任何允许为空 (`null`) 的参数时，应使用逻辑“或”运算符。例如，表达式可以修改为 `$(inputs.file_format || 'auto')`, 从而在命令行或作业输入文件未提供值的情况下有默认值可用。

source: Metadata and Authorship
ja: メタデータと著者
ru: Метаданные и авторство
ta: மேனிலை தரவு மற்றும் படைப்புரிமை
zh_hans: 元数据和著作人信息
