Repository: common-workflow-language/user_guide
Catalog: locales/*/LC_MESSAGES/user_guide.po
Languages: ja, ru, ta, zh_hans

source: [Docker][docker] containers simplify software installation by providing a complete known-good runtime for software and its dependencies. However, containers are also purposefully isolated from the host system, so in order to run a tool inside a Docker container there is additional work to ensure that input files are available inside the container and output files can be recovered from the container. A CWL runner can perform this work automatically, allowing you to use Docker to simplify your software management while avoiding the complexity of invoking and managing Docker containers.
ja: [Docker][docker]コンテナは、ソフトウェアとその依存関係のための完全な既知の良いランタイムを提供することによって、ソフトウェアのインストールを簡素化します。 しかし、コンテナはホストシステムから意図的に隔離されているため、Dockerコンテナ内でツールを実行するには、入力ファイルがコンテナ内で利用可能で、出力ファイルがコンテナから回収できることを確認するための追加作業が必要です。 CWLランナーはこの作業を自動的に行うことができるため、Dockerコンテナの呼び出しや管理の複雑さを回避しながら、Dockerを使用してソフトウェア管理を簡素化することができます。
ru: Контейнеры [Docker][docker] упрощают установку программного обеспечения, предоставляя полное известное время выполнения для программ и их зависимостей. Однако контейнеры также специально изолированы от хост-системы, поэтому для запуска инструмента в контейнере Docker необходимо выполнить дополнительную работу, чтобы убедиться, что входные файлы доступны внутри контейнера, а выходные файлы могут быть восстановлены из контейнера. CWL runner может выполнять эту работу автоматически, позволяя вам использовать Docker для упрощения управления программным обеспечением, избегая при этом сложностей, связанных с вызовом и управлением контейнерами Docker.
ta: [டோக்கர்][docker] கொள்கலன்கள் மென்பொருள் நிறுவலை எளிதாக்குகின்றன, மென்பொருள் மற்றும் அதன் சார்புகளுக்கு முழுமையான அறியப்பட்ட-நல்ல இயக்க நேரத்தை வழங்குவதன் மூலம். இருப்பினும், கொள்கலன்கள் புரவலன் அமைப்பிலிருந்து வேண்டுமென்றே தனிமைப்படுத்தப்படுகின்றன, எனவே ஒரு கப்பல்துறை கொள்கலனுக்குள் ஒரு கருவியை இயக்குவதற்கு கொள்கலனுக்குள் உள்ளீட்டுக் கோப்புகள் கிடைப்பதை உறுதிசெய்யக் கூடுதல் வேலை உள்ளது மற்றும் வெளியீட்டு கோப்புகளைக் கொள்கலனிலிருந்து மீட்டெடுக்க முடியும். ஒரு சி.டபிள்யூ.எல் ரன்னர் இந்த வேலையைத் தானாகவே செய்ய முடியும், இது உங்கள் மென்பொருள் நிர்வாகத்தை எளிமைப்படுத்த டோக்கரைப் பயன்படுத்த அனுமதிக்கிறது, அதே நேரத்தில் கப்பல்துறை கொள்கலன்களைத் தொடங்குவதற்கும் நிர்வகிப்பதற்கும் சிக்கலைத் தவிர்க்கிறது.

source: One of the responsibilities of the CWL runner is to adjust the paths of input files to reflect the location where they appear inside the container.
ja: CWLランナーの役割のひとつに、入力ファイルのパスをコンテナ内のでの配置位置に合わせることがあります。
ru: Одной из обязанностей программы запуска CWL является корректировка путей к входным файлам с учетом их расположения внутри контейнера.
ta: சி.டபிள்யூ.எல் ரன்னரின் பொறுப்புகளில் ஒன்று, உள்ளீட்டு கோப்புகளின் பாதைகளை கொள்கலனுக்குள் தோன்றும் இடத்தை பிரதிபலிக்கும் வகையில் சரிசெய்வது.

source: This example runs a simple Node.js script inside a Docker container which will then print "Hello World" to the standard output.
ja: この例では、Dockerコンテナ内で簡単なNode.jsスクリプトを実行し、標準出力に「Hello World」と表示します。
ru: Этот пример запускает простой скрипт Node.js внутри контейнера Docker, который затем выводит "Hello World" на стандартный вывод.
ta: இந்த எடுத்துக்காட்டு ஒரு கப்பல்துறை கொள்கலனுக்குள் ஒரு எளிய Node.js ச்கிரிப்டை இயக்குகிறது, பின்னர் அது "அலோ வேர்ல்ட்" ஐ நிலையான வெளியீட்டிற்கு அச்சிடும்.

source: Before we run this, let's just break it down and see what some bits do. Most of this has been explained in previous sections, the only part that is really new is the `dockerRequirement` section.
ru: Прежде чем мы запустим эту программу, давайте разберем ее на части и посмотрим, что делают некоторые элементы. Большая часть этого уже объяснялась в предыдущих разделах, единственная часть, которая действительно является новой, - это раздел `dockerRequirement`.
ta: இதை இயக்குவதற்கு முன், அதை உடைத்து சில பிட்கள் என்ன செய்கின்றன என்பதைப் பார்ப்போம். இவற்றில் பெரும்பாலானவை முந்தைய பிரிவுகளில் விளக்கப்பட்டுள்ளன, உண்மையில் புதிய ஒரே பகுதி `டோக்கர் ரெக்கமென்ட்` பிரிவு.

source: `baseCommand: node` tells CWL that we will be running this command using the Node Js runtime that is meant for Javascript files. We then need to specify some `hints` for how to find the container we want. In this case we list just our requirements for the docker container in `DockerRequirements`. The `dockerPull:` parameter takes the same value that you would pass to a `docker pull` command. That is, the name of the container image (you can even specify the tag, which is good idea for best practices when using containers for reproducible research). In this case we have used a container called `node:slim`.
ru: `Базовая команда: node` сообщает CWL, что мы будем выполнять эту команду, используя среду выполнения Node Js, предназначенную для файлов Javascript. Затем нам нужно указать несколько `подсказок` для поиска нужного нам контейнера. В данном случае мы перечислим только наши требования к контейнеру docker в `DockerRequirements`. Параметр `dockerPull:` принимает то же значение, которое вы бы передали команде `docker pull`. То есть имя образа контейнера (можно даже указать тег, что является хорошей идеей для лучших практик использования контейнеров для воспроизводимых исследований). В данном случае мы использовали контейнер под названием `node:slim`.
ta: `பேச் கமாண்ட்: நோட்` சி.டபிள்யூ.எல். ஐ சாவாச்கிரிப்ட் கோப்புகளுக்கான முனைய JS இயக்க நேரத்தைப் பயன்படுத்தி இந்த கட்டளையை இயக்குவோம் என்று கூறுகிறது. நாம் விரும்பும் கொள்கலனை எவ்வாறு கண்டுபிடிப்பது என்பதற்கான சில `குறிப்புகளை 'குறிப்பிட வேண்டும். இந்த விசயத்தில், கப்பல்துறை கொள்கலனுக்கான எங்கள் தேவைகளை `டோக்கர் ரெக்குவிரெமென்ட்ச்` இல் பட்டியலிடுகிறோம். `டோக்கர்புல்:` அளவுரு நீங்கள் ஒரு `டோக்கர் புல்` கட்டளைக்கு அனுப்பும் அதே மதிப்பை எடுக்கும். அதாவது, கொள்கலன் படத்தின் பெயர் (நீங்கள் குறிச்சொல்லைக் கூட குறிப்பிடலாம், இது இனப்பெருக்க ஆராய்ச்சிக்கு கொள்கலன்களைப் பயன்படுத்தும் போது சிறந்த நடைமுறைகளுக்கு நல்ல யோசனையாகும்). இந்த விசயத்தில் `முனை: ச்லிம்` என்ற கொள்கலனைப் பயன்படுத்தினோம்.

source: Create a Javascript file named "hello.js" and invoke `cwltool` providing the tool description and the input object on the command line:
ja: Javascriptで "hello.js "というファイルを作成し、`cwltool` コマンドラインでツール定義と入力オブジェクトを指定して呼び出します：
ru: Создайте Javascript-файл с именем "hello.js" и вызовите `cwltool`, указав в командной строке описание инструмента и объект ввода:
ta: "Hello.js" என்ற பெயரில் ஒரு சாவாச்கிரிப்ட் கோப்பை உருவாக்கி, கட்டளை வரியில் கருவி விளக்கத்தையும் உள்ளீட்டு பொருளையும் வழங்கும் `cwltool` ஐ அழைக்கவும்:

source: `hello.js`
ta: `அலோ.சேச்`

source: Notice the CWL runner has constructed a Docker command line to run the script.
ja: CWLランナーがスクリプトを実行するためにDockerコマンドラインを構築していることに注目してください。
ru: Обратите внимание, что программа запуска CWL создала командную строку Docker для запуска сценария.
ta: ச்கிரிப்டை இயக்க சி.டபிள்யூ.எல் ரன்னர் ஒரு கப்பல்துறை கட்டளை வரியை உருவாக்கியுள்ளது என்பதைக் கவனியுங்கள்.

source: In this example, the path to the script `hello.js` is `/home/me/cwl/user_guide/hello.js` outside the container but `/var/lib/cwl/job369354770_examples/hello.js` inside the container, as reflected in the invocation of the `node` command.
ja: この例では、スクリプト`hello.js` のパスは、コンテナの外側では `/home/me/cwl/user_guide/hello.js` が、コンテナの内側では`/var/lib/cwl/job369354770_examples/hello.js` です。これは`node` コマンドの呼び出しに反映されているためです。
ru: В этом примере путь к скрипту `hello.js` - это `/home/me/cwl/user_guide/hello.js` вне контейнера, но `/var/lib/cwl/job369354770_examples/hello.js` внутри контейнера, что отражено в вызове команды `node`.
ta: இந்த எடுத்துக்காட்டில், `அலோ.செச்` ச்கிரிப்டுக்கான பாதை கொள்கலனுக்கு வெளியே`/ஓம்/மீ/சி.டபிள்யூ.எல்/பயனர்_சியூட்/அலோ.சே.எச். , `முனை` கட்டளையின் அழைப்பில் பிரதிபலிக்கிறது.

source: Workflows
ja: ワークフロー
ru: Рабочие процессы
ta: பணிப்பாய்வு

source: A workflow is a CWL processing unit that executes command-line tools, expression tools, or workflows (sub-workflows) as steps. It must have `inputs`, `outputs`, and `steps` defined in the CWL document.
ja: Workflowは、CommandLineTool、ExpressionTool、またはWorkflow（サブワークフロー）をステップ として実行する CWL 処理単位です。CWL定義には`inputs` 、`outputs` 、`steps` を定義する必要があります。
ru: Рабочий процесс - это блок обработки CWL, который выполняет инструменты командной строки, средства выражения или рабочие процессы (подрабочие процессы) в качестве шагов. Он должен иметь `входы`, `выходы` и `шаги`, определенные в документе CWL.
ta: பணிப்பாய்வு என்பது ஒரு சி.டபிள்யூ.எல் செயலாக்க அலகு ஆகும், இது கட்டளை-வரி கருவிகள், வெளிப்பாடு கருவிகள் அல்லது பணிப்பாய்வுகளை (துணை வேலை பாய்ச்சல்கள்) படிகளாக செயல்படுத்துகிறது. இது CWL ஆவணத்தில் `உள்ளீடுகள்`,` வெளியீடுகள்` மற்றும் `படிகள்` வரையறுக்கப்பட வேண்டும்.

source: CWL workflow.
ja: CWLワークフローです。
ru: Рабочий процесс CWL.
ta: சி.டபிள்யூ.எல் பணிப்பாய்வு.

source: The CWL document `echo-uppercase.cwl` defines a workflow that runs the command-line tool, and the expression tool showed in the earlier examples.
ja: CWL定義`echo-uppercase.cwl` は、CommandLineTool、および先の例で示したExpressionToolを実行するワークフローを定義しています。
ru: CWL-документ `echo-uppercase.cwl` определяет рабочий процесс, который запускает инструмент командной строки и инструмент для работы с выражениями, показанный в предыдущих примерах.
ta: சி.டபிள்யூ.எல் ஆவணம் `எக்கோ-பெர்பெச்.க்விஎல்` கட்டளை-வரி கருவியை இயக்கும் ஒரு பணிப்பாய்வை வரையறுக்கிறது, மேலும் முந்தைய எடுத்துக்காட்டுகளில் காட்டப்பட்ட வெளிப்பாடு கருவி.

source: `echo-uppercase.cwl`
ta: `Echo-wpercase.cwl`

source: A command-line tool or expression tool can also be written directly in the same CWL document as the workflow. For example, we can rewrite the `echo-uppercase.cwl` workflow as a single file:
ja: CommandLineToolやExpressionToolは、Workflowと同じCWL定義に直接記述することも可能です。例えば、`echo-uppercase.cwl` ワークフローを1つのファイルとして書き換えることができます：
ru: Инструмент командной строки или инструмент выражения также может быть записан непосредственно в том же документе CWL, что и рабочий процесс. Например, мы можем переписать рабочий процесс `echo-uppercase.cwl` в виде одного файла:
ta: ஒரு கட்டளை-வரி கருவி அல்லது வெளிப்பாடு கருவி பணிப்பாய்வு போன்ற அதே CWL ஆவணத்தில் நேரடியாக எழுதப்படலாம். எடுத்துக்காட்டாக, `echo-wirpercase.cwl` பணிப்பாய்வுகளை ஒற்றை கோப்பாக மீண்டும் எழுதலாம்:

source: Having separate files helps with modularity and code organization. But it can be helpful writing everything in a single file for development. There are other ways to combine multiple files into a single file (e.g. `cwltool --pack`) discussed further in other sections of this user guide.
ru: Наличие отдельных файлов помогает в обеспечении модульности и организации кода. Но для разработки может быть полезно писать все в одном файле. Существуют и другие способы объединения нескольких файлов в один файл (например, `cwltool --pack`), о которых мы поговорим в других разделах этого руководства пользователя.
ta: தனித்தனி கோப்புகளை வைத்திருப்பது மட்டுப்படுத்தல் மற்றும் குறியீடு அமைப்புக்கு உதவுகிறது. ஆனால் அபிவிருத்திக்காக ஒரே கோப்பில் எல்லாவற்றையும் எழுதுவது உதவியாக இருக்கும். இந்த பயனர் வழிகாட்டியின் பிற பிரிவுகளில் மேலும் விவாதிக்கப்பட்ட பல கோப்புகளை ஒரே கோப்பாக (எ.கா. `CWLTOOL - -PACK`) இணைக்க வேறு வழிகள் உள்ளன.

source: For a sub-workflows you need to enable the requirement `SubworkflowFeatureRequirement`. It is covered in another section of this user guide in more detail.
ru: Для субрабочих процессов необходимо включить требование `SubworkflowFeatureRequirement`. Более подробно об этом говорится в другом разделе данного руководства пользователя.
ta: ஒரு துணை வேலை பாய்ச்சல்களுக்கு நீங்கள் `subworkflowfeatureerequirement` தேவையை இயக்க வேண்டும். இந்த பயனர் வழிகாட்டியின் மற்றொரு பிரிவில் இது இன்னும் விரிவாக உள்ளது.

source: Writing Workflows
ja: ワークフローを書く
ru: Написание рабочих процессов
ta: பணிப்பாய்வு எழுதுதல்

source: This workflow extracts a java source file from a tar file and then compiles it.
ja: このワークフローでは、tarファイルからJavaのソースファイルを取り出し、コンパイルします。
ru: Этот рабочий процесс извлекает исходный файл java из tar-файла, а затем компилирует его.
ta: இந்த பணிப்பாய்வு ஒரு தார் கோப்பிலிருந்து சாவா மூல கோப்பைப் பிரித்தெடுத்து பின்னர் தொகுக்கிறது.

source: `1st-workflow.cwl`
ta: `1 வது-வொர்க்ஃப்ளோ.சிடபிள்யூஎல்`

source: Visualization of 1st-workflow.cwl
ja: 1st-workflow.cwlの可視化
ta: 1 வது-வொர்க்ஃப்ளோ.ச்விஎல் காட்சிப்படுத்தல்

source: [![Visualization of 1st-workflow.cwl](https://view.commonwl.org/graph/png/github.com/common-workflow-language/user_guide/blob/a29e7eae0006660946fc705a310b37a21a7e1edc/_includes/cwl/21-1st-workflow/1st-workflow.cwl)](https://view.commonwl.org/graph/png/github.com/common-workflow-language/user_guide/blob/a29e7eae0006660946fc705a310b37a21a7e1edc/_includes/cwl/21-1st-workflow/1st-workflow.cwl)
ta: [![1st-workflow.cwl காட்சிப்படுத்தல்](https://view.commonwl.org/graph/png/github.com/common-workflow-language/user_guide/blob/a29e7eae0006660946fc705a310b37a21a7e1edc/_includes/cwl/21-1st-workflow/1st-workflow.cwl)](https://view.commonwl.org/graph/png/github.com/common-workflow-language/user_guide/blob/a29e7eae0006660946fc705a310b37a21a7e1edc/_includes/cwl/21-1st-workflow/1st-workflow.cwl)

source: Use a YAML or a JSON object in a separate file to describe the input of a run:
ja: Runの入力データを記述するために、別ファイルのYAMLまたはJSONオブジェクトを使用します：
ru: Используйте YAML или JSON-объект в отдельном файле для описания входных данных для запуска:
ta: ஒரு ரன்னின் உள்ளீட்டை விவரிக்க ஒரு தனி கோப்பில் ஒரு YAML அல்லது சாதொபொகு பொருளைப் பயன்படுத்தவும்:

source: `1st-workflow-job.yml`
ta: `1 வது-வொர்க்ஃப்ளோ-JOB.YML`

source: Next, create a sample Java file and add it to a tar file to use with the command-line tool.
ja: 次に、サンプルとなるJavaファイルを作成し、コマンドラインツールで使用するためにtarファイルに追加します。
ru: Далее создайте пример Java-файла и добавьте его в tar-файл для использования с инструментом командной строки.
ta: அடுத்து, ஒரு மாதிரி சாவா கோப்பை உருவாக்கி, கட்டளை-வரி கருவியுடன் பயன்படுத்த தார் கோப்பில் சேர்க்கவும்.

source: What's going on here? Let's break it down:
ja: どうなっているのでしょう？ 分解してみましょう：
ru: Что здесь происходит? Давайте разберемся:
ta: இங்கே என்ன நடக்கிறது? அதை உடைப்போம்:

source: The `cwlVersion` field indicates the version of the CWL spec used by the document. The `class` field indicates this document describes a workflow.
ja: `cwlVersion` フィールドは、この文書が使用するCWL仕様のバージョンを示します。 ` class` フィールドは、この文書がワークフローを記述していることを示します。
ru: Поле `cwlVersion` указывает на версию спецификации CWL, используемую в документе. Поле `class` указывает, что этот документ описывает рабочий процесс.
ta: `Cwlversion` புலம் ஆவணத்தால் பயன்படுத்தப்படும் CWL விவரக்குறிப்பின் பதிப்பைக் குறிக்கிறது. `வகுப்பு` புலம் இந்த ஆவணம் ஒரு பணிப்பாய்வுகளை விவரிக்கிறது என்பதைக் குறிக்கிறது.

source: The `inputs` section describes the inputs of the workflow. This is a list of input parameters where each parameter consists of an identifier and a data type. These parameters can be used as sources for input to specific workflows steps.
ja: `inputs` セクションでは、ワークフローの入力について記述します。 これは入力パラメータのリストであり、各パラメータは識別子とデータ型から構成されます。 これらのパラメータは、特定のワークフロー・ステップへの入力として使用できます。
ru: Раздел `входы` описывает входы рабочего процесса. Это список входных параметров, где каждый параметр состоит из идентификатора и типа данных. Эти параметры могут быть использованы в качестве источников входных данных для определенных этапов рабочего процесса.
ta: `உள்ளீடுகள்` பிரிவு பணிப்பாய்வுகளின் உள்ளீடுகளை விவரிக்கிறது. ஒவ்வொரு அளவுருவும் ஒரு அடையாளங்காட்டி மற்றும் தரவு வகையைக் கொண்ட உள்ளீட்டு அளவுருக்களின் பட்டியல் இது. இந்த அளவுருக்களை குறிப்பிட்ட பணிப்பாய்வு படிகளுக்கான உள்ளீட்டிற்கான ஆதாரங்களாகப் பயன்படுத்தலாம்.

source: The `outputs` section describes the outputs of the workflow. This is a list of output parameters where each parameter consists of an identifier and a data type. The `outputSource` connects the output parameter `classfile` of the `compile` step to the workflow output parameter `compiled_class`.
ja: `outputs` セクションでは、ワークフローの出力について記述します。 これは出力パラメータのリストであり、各パラメータは識別子とデータ型から構成されます。 ` outputSource` は、`compile` ステップの出力パラメータ`classfile` を、ワークフロー出力パラメータ`compiled_class` とします。
ru: Раздел `outputs` описывает выходные данные рабочего процесса. Это список выходных параметров, где каждый параметр состоит из идентификатора и типа данных. Параметр `outputSource` соединяет выходной параметр `classfile` шага `compile` с выходным параметром рабочего процесса `compiled_class`.
ta: `வெளியீடுகள்` பிரிவு பணிப்பாய்வுகளின் வெளியீடுகளை விவரிக்கிறது. ஒவ்வொரு அளவுருவும் ஒரு அடையாளங்காட்டி மற்றும் தரவு வகையைக் கொண்ட வெளியீட்டு அளவுருக்களின் பட்டியல் இது. `OutputSource`` தொகுக்கப்பட்ட` படியின் `கிளாச்ஃபைல்` ஐ பணிப்பாய்வு வெளியீட்டு அளவுருவுக்கு` தொகுக்கப்பட்ட_ கிளாச்` உடன் இணைக்கிறது.

source: The `steps` section describes the actual steps of the workflow. In this example, the first step extracts a file from a tar file, and the second step compiles the file from the first step using the java compiler. Workflow steps are not necessarily run in the order they are listed, instead the order is determined by the dependencies between steps (using `source`). In addition, workflow steps which do not depend on one another may run in parallel.
ru: Раздел `steps` описывает фактические шаги рабочего процесса. В этом примере первый шаг извлекает файл из tar-файла, а второй шаг компилирует файл, полученный на первом шаге, с помощью java-компилятора. Шаги рабочего процесса не обязательно выполняются в том порядке, в котором они перечислены, вместо этого порядок определяется зависимостями между шагами (с помощью `source`). Кроме того, шаги рабочего процесса, которые не зависят друг от друга, могут выполняться параллельно.
ta: `படிகள்` பிரிவு பணிப்பாய்வுகளின் உண்மையான படிகளை விவரிக்கிறது. இந்த எடுத்துக்காட்டில், முதல் படி ஒரு தார் கோப்பிலிருந்து ஒரு கோப்பைப் பிரித்தெடுக்கிறது, இரண்டாவது படி சாவா கம்பைலரைப் பயன்படுத்தி முதல் படியிலிருந்து கோப்பை தொகுக்கிறது. பணிப்பாய்வு படிகள் அவை பட்டியலிடப்பட்ட வரிசையில் அவசியமில்லை, அதற்கு பதிலாக ஆர்டர் படிகளுக்கு இடையிலான சார்புகளால் தீர்மானிக்கப்படுகிறது (`மூலத்தை` பயன்படுத்தி). கூடுதலாக, ஒருவருக்கொருவர் சார்ந்து இல்லாத பணிப்பாய்வு படிகள் இணையாக இயங்கக்கூடும்.

source: The first step, `untar` runs `tar-param.cwl` (described previously in [Parameter References](parameter-references.md)). This tool has two input parameters, `tarfile` and `extractfile` and one output parameter `extracted_file`.
ru: Первый шаг, `untar`, запускает `tar-param.cwl` (описанный ранее в [Parameter References](parameter-references.md)). Этот инструмент имеет два входных параметра, `tarfile` и `extractfile`, и один выходной параметр `extracted_file`.
ta: முதல் படி, `untar` `tar-param.cwl` ஐ இயக்குகிறது (முன்னர் [அளவுரு குறிப்புகள்](parameter-references.md) இல் விவரிக்கப்பட்டுள்ளது). இந்த கருவி இரண்டு உள்ளீட்டு அளவுருக்களைக் கொண்டுள்ளது, `tarfile` மற்றும்`extractfile` மற்றும் ஒரு வெளியீட்டு அளவுரு `extracted_file`.

source: The ``in`` section of the workflow step connects these two input parameters to the inputs of the workflow, `tarball` and `name_of_file_to_extract` using `source`. This means that when the workflow step is executed, the values assigned to `tarball` and `name_of_file_to_extract` will be used for the parameters `tarfile` and `extractfile` in order to run the tool.
ru: Секция ``in`` шага рабочего процесса соединяет эти два входных параметра с входами рабочего процесса, `tarball` и `name_of_file_to_extract`, используя `source`. Это означает, что при выполнении шага рабочего процесса значения, присвоенные параметрам `tarball` и `name_of_file_to_extract`, будут использоваться для параметров `tarfile` и `extractfile` для запуска инструмента.
ta: பணிப்பாய்வு படியின் `` in`` பிரிவு இந்த இரண்டு உள்ளீட்டு அளவுருக்களையும் பணிப்பாய்வு உள்ளீடுகளுடன் இணைக்கிறது, `tarball` மற்றும்`name_of_file_to_extract` `source` பயன்படுத்துகிறது. இதன் பொருள், பணிப்பாய்வு படி செயல்படுத்தப்படும்போது, `tarball` மற்றும்`name_of_file_to_extract` ஆகியவற்றுக்கு ஒதுக்கப்பட்ட மதிப்புகள் கருவியை இயக்க `tarfile` மற்றும்`extractfile` ஆகியவற்றிற்கு பயன்படுத்தப்படும்.

source: The `out` section of the workflow step lists the output parameters that are expected from the tool.
ru: В разделе `out` шага рабочего процесса перечислены выходные параметры, которые ожидаются от инструмента.
ta: பணிப்பாய்வு படியின் `அவுட்` பிரிவு கருவியிலிருந்து எதிர்பார்க்கப்படும் வெளியீட்டு அளவுருக்களை பட்டியலிடுகிறது.

source: The second step `compile` depends on the results from the first step by connecting the input parameter `src` to the output parameter of `untar` using `untar/extracted_file`. It runs `arguments.cwl` (described previously in [Additional Arguments and Parameters](additional-arguments-and-parameters.md)). The output of this step `classfile` is connected to the `outputs` section for the Workflow, described above.
ru: Второй шаг `compile` зависит от результатов первого шага, соединяя входной параметр `src` с выходным параметром `untar` с помощью `untar/extracted_file`. Он запускает `arguments.cwl` (описанный ранее в [Additional Arguments and Parameters](additional-arguments-and-parameters.md)). Выход этого шага `classfile` подключается к секции `outputs` для рабочего процесса, описанного выше.
ta: இரண்டாவது படி `compile `(தொகுத்தல்) `untar/extracted_file` ஐப் பயன்படுத்தி உள்ளீட்டு அளவுருவை `src` இன் வெளியீட்டு அளவுருவுடன் இணைப்பதன் மூலம் முதல் படியின் முடிவுகளைப் பொறுத்தது. இது `arguments.cwl` ஐ இயக்குகிறது (முன்னர் [கூடுதல் வாதங்கள் மற்றும் அளவுருக்கள்](additional-arguments-and-parameters.md) இல் விவரிக்கப்பட்டுள்ளது). இந்த படி `classfile` இன் வெளியீடு மேலே விவரிக்கப்பட்ட பணிப்பாய்வுக்கான `outputs` பிரிவுடன் இணைக்கப்பட்டுள்ளது.

source: Nested Workflows
ja: ネストされたワークフロー
ru: Вложенные рабочие процессы
ta: உள்ளமைக்கப்பட்ட பணிப்பாய்வு

source: Workflows are ways to combine multiple tools to perform a larger operations. We can also think of a workflow as being a tool itself; a CWL workflow can be used as a step in another CWL workflow, if the workflow engine supports the `SubworkflowFeatureRequirement`:
ja: ワークフローは、複数のツールを組み合わせてより大きな処理を実行するための方法です。ワークフローエンジンが`SubworkflowFeatureRequirement` をサポートしている場合、CWL ワークフローを別の CWL ワークフローのステップとすることができます ：
ru: Рабочие процессы - это способы объединения нескольких инструментов для выполнения более крупных операций. Можно также считать, что рабочий процесс сам по себе является инструментом; рабочий процесс CWL может использоваться в качестве шага в другом рабочем процессе CWL, если механизм рабочего процесса поддерживает `SubworkflowFeatureRequirement`:
ta: பணிப்பாய்வு என்பது ஒரு பெரிய செயல்பாடுகளைச் செய்ய பல கருவிகளை இணைப்பதற்கான வழிகள். ஒரு பணிப்பாய்வு ஒரு கருவியாக இருப்பதையும் நாம் நினைக்கலாம்; ஒரு சி.டபிள்யூ.எல் பணிப்பாய்வு மற்றொரு சி.டபிள்யூ.எல் பணிப்பாய்வுகளின் ஒரு படியாகப் பயன்படுத்தப்படலாம், பணிப்பாய்வு இயந்திரம் `சப்ச்வொர்க்ஃப்ளோஃபீட்டர்ரெக்யூமென்ட்` ஆதரித்தால்:

source: Here's an example workflow that uses our `1st-workflow.cwl` as a nested workflow:
ja: `1st-workflow.cwl` をネストしたワークフローの例を紹介します：
ru: Вот пример рабочего процесса, который использует наш `1st-workflow.cwl` в качестве вложенного рабочего процесса:
ta: எங்கள் `1 வது-வொர்க்ஃப்ளோ.க்விஎல்` ஐ உள்ளமைக்கப்பட்ட பணிப்பாய்வுகளாகப் பயன்படுத்தும் ஒரு எடுத்துக்காட்டு பணிப்பாய்வு இங்கே:

source: `nestedworkflows.cwl`
ta: `NestestWorkflows.cwl`
